<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="../style.css" type="text/css" />
</head>
<body>
<p>Extensions pour NVDA</p>
<audio autoplay="autoplay" preload="auto">
<source src="https://blindhelp.github.io/sweep.wav" type="audio/wav" />
</audio>
<footer>
Derni&#232;re mise &#224; jour le Samedi 4 D&#233;cembre 2021
</footer>
<p>Avertissement: &#128128;<br />
Le blog de BlindHelp n'est pas responsable des dommages caus&#233;s par une mauvaise utilisation de l'extension t&#233;l&#233;charg&#233; ni des informations ce trouvant sur la documentation d&#233;di&#233; et l'utilisation de l'extension t&#233;l&#233;charg&#233; est &#224; vos risques et p&#233;rils. &#9760;</p>
<hr />
<h1 id="le-coffre-des-extensions-pour-nvda">Le coffre des Extensions pour NVDA</h1>
<br />
Coucou mes amis du blog de BlindHelp!<br />
Bienvenue sur le coffre des Extensions pour NVDA!<br />
Anciennement appel&#233;s Module Compl&#233;mentaire!<br />
Le lien reste le m&#234;me pour les amis qui ont partag&#233; le lien sur leurs blogs ou ailleurs, mais le titre de la page et la grande partie de son contenu ont &#233;t&#233; modifi&#233;s pour l'utilisation du terme &quot;extension&quot; &#224; la place de &quot;module compl&#233;mentaire&quot; (sugg&#233;r&#233;e et approuv&#233;e par les traducteurs de NVDA).<br />
Annotez qu'il est probable que dans la documentation de certaines extensions, ce nom n&#8217;a pas &#233;t&#233; chang&#233;, que l'extension soit tr&#232;s ancienne ou qu'elle soit abandonn&#233;e par son auteur. Dans cette page nous l'avons donc remplac&#233; par le nouveau terme utilis&#233; par la communaut&#233; fran&#231;aise de NVDA.<br />
Ici vous retrouvez la plus part des extensions officielles ou non officielles regrouper par mes soins pour NVDA!!!<br />

<div>

<a href="#vous_pouvez_consulter_la_liste_des_extensions_compatibles">Vous pouvez consultez la liste des extensions compatibles avec Python3</a> puis les t&#233;l&#233;chargez! En tout cas je vous donne les plus utile pour moi!!! Il se peut que certaines extensions elles ne sont pas list&#233;e; peut-&#234;tre parce que j'ai jug&#233; qu'ils ne sont pas tr&#232;s utile; ou parce que je n'avez aucunne id&#233;e de leurs existences!!! Donc si vous ne trouvez pas votre extension ad&#233;quate list&#233; plus bas, mille merci de consulter la section
<div>
<p><a href="#references_des_liens_externes">R&#233;f&#233;rences des liens externes</a>, afin de trouvez votre bonheur!!! Et si vous souhaitez que une extension figure ici! faites-le savoire SVP!!!pour cela envoyez-moi un courriel en cliquant sur l'adresse qui se trouve en bas:<br />
<script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;&#32;&#40;&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Merci par avance pour votre contribution!!!<br />
N'oubliez pas surtout avant d'installer une extension, que vous devez d'abord installer le lecteur d'&#233;cran en opensource nomm&#233;:<br />
NVDA.</p>
<p><br />
Vous pouvez obtenir la derni&#232;re version de NVDA <a href="http://www.nvda-project.org/">depuis la page du site officiel en anglais d&#233;dier &#224; le lecteur d'&#233;cran en opensources NVDA:</a><br />
et une fois t&#233;l&#233;chargez le fichier, validez sur le .exe puis suivre le programme d'installation qui est enti&#232;rement vocaliser.<br />
<br />
Vous pouvez aussi t&#233;l&#233;charger la derni&#232;re version de NVDA <a href="http://www.nvda-fr.org/">depuis la page francophone d&#233;dier &#224; le lecteur d'&#233;cran en opensources nomm&#233; NVDA:</a><br />
N'oubliez pas de consulter cette page pour voir la derni&#232;re version de NVDA en date!!!<br />
<br />
Donc, maintenant vous pouvez consulter puis t&#233;l&#233;charger les extensions compatibles depuis les liens directes, list&#233; plus bas!!!<br />
<br />
Il inclus les extensions donner par notre ami Michel Such qui c&#232;de le poste &#224; partir du 15/08/2018, &#224; une partie de l'&#233;quipe en charge du site <a href="https://www.progaccess33.net/">ProgAccess</a>, Corentin pour toute la partie codage et maintien &#224; jour du site, et Pascal pour la partie graphique, donc vous pouvez consulter <a href="https://www.nvda-fr.org/addons.php">la page francophone d&#233;dier &#224; les extensions par ici:</a><br />
C'est donc d&#232;s l'heure une toute nouvelle &#233;quipe qui va apporter un coup de jeune au site, tout en gardant l'intuitivit&#233; et la simplicit&#233; &#224; laquelle Michel Such a toujours su faire preuve.<br />
N'oubliez pas de consulter cette page pour voir les nouveaut&#233;s!!!<br />
<br />
Mille merci &#224; lui et la nouvelle &#233;quipe pour leurs partage!!!</p>
<p><br />
Le coffre des extensions pour NVDA inclus aussi des extensions fait par des autres membres de la liste de N-V-D-A en espagnol ainsi que des gars de la liste de NVDA en anglais, etc, etc...<br />
<a href="#vous_pouvez_consulter_la_liste_des_anciennes_extensions">Vous pouvez aussi consultez la liste des anciennes extensions compatibles pour NVDA 2019.2.1 (y compris les versions plus anciennes)</a></p>
<hr />
<h3 id="quest-ce-quune-extension">Qu'est-ce qu'une extension ?</h3>
<p><a href="https://www.nvaccess.org/">NVDA</a> est un lecteur d'&#233;cran tr&#232;s souple et extensible. Les extensions pour NVDA sont des scripts additionnels qui peuvent &#234;tre t&#233;l&#233;charg&#233;s et int&#233;gr&#233;s &#224; votre copie de NVDA afin d'am&#233;liorer ou d'ajouter des fonctionnalit&#233;s. Ces extensions peuvent inclure des fonctionnalit&#233;s et des commandes suppl&#233;mentaires qui peuvent &#234;tre utilis&#233;es partout, am&#233;liorant le support d'un programme ou ajoutant un support pour un nouveau terminaux braille ou un synth&#233;tiseur vocal.</p>
<hr />
<h3 id="comment-installer-les-extensions-pour-nvda">Comment installer les extensions pour NVDA ?</h3>
<p>Consulter la page officielle du <a href="https://addons.nvda-project.org/index.fr.html">site Comunautaire des Extensions NVDA</a> Pour en savoir plus.</p>
<p>Consulter aussi le <a href="https://blindhelp.github.io/userGuide.html">Guide de l'utilisateur</a> pour installer, d&#233;sinstaller et d&#233;sactiver une extension NVDA.</p>
<p>Pour en savoir plus sur la gestion des extensions, rendez-vous au chapitre <a href="https://blindhelp.github.io/userGuide.html#AddonsManager">Gestionnaire d'Extensions du guide de l'utilisateur</a></p>
<hr />
<h3 id="vous_pouvez_consulter_la_liste_des_extensions_compatibles">&#224; continuation voici la liste des extensions compatibles avec Python3, avec leurs respective description et leurs lien de t&#233;l&#233;chargement:</h3>
<hr />
<div>
<p>Voici la liste des extensions compatibles avec Python3 &#224; t&#233;l&#233;charger!!!</p>
</div>
<p>Attention : Si votre navigateur est Internet Explorer, il peut arriver que l'extension t&#233;l&#233;charg&#233;e se retrouve avec l'extension de fichier .zip au lieu de .nvda-addon. Dans ce cas, il vous faudra changer l'extension du fichier. Par exemple, si votre extension a &#233;t&#233; t&#233;l&#233;charg&#233;e sous le nom &quot;mon_Extension.zip&quot;, vous devrez le renommer en &quot;mon_Extension.nvda-addon&quot; avant de pouvoir l'installer dans NVDA.</p>
<h2 id="extensions-compatibles-avec-python3">Extensions compatibles avec Python3<a id="extensions_compatibles"></a></h2>
<p>Pour en savoir plus sur la compatibilit&#233; des extensions NVDA et Python 3 consulter la page sur le <a href="https://addons.nvda-project.org/addons/nvdapy3.fr.html">site international de NVDA</a></p>
<p>Merci &#224; Cyrille pour la traduction de cette page!</p>
<hr />
<h1 id="extensions-compatibles-avec-python3-1">Extensions compatibles avec Python3 <a id="extensions compatibles avec Python3"></a></h1>
<p><a href="#AccessolutionsNvdaPro-py3">AccesSolutionsNVDAPro</a> (extension non officielle) <a href="#AcortadorURL-py3">AcortadorURL (R&#233;duireURL)</a> (extension non officielle) <a href="#addonPackager-py3">addonPackager</a> (extension non officielle) <a href="#addonsHelp-py3">addonsHelp</a> (extension officielle) <a href="#AirLiveDrive-py3">AirLiveDrive (AirAccessibility)</a> (extension non officielle) <a href="#applicationDictionary-py3">applicationDictionary</a> (extension non officielle) <a href="#apprentiClavierAccessEnhancement-py3">apprentiClavierAccessEnhancement</a> (extension non officielle) <a href="#audacityAccessEnhancement-py3">audacityAccessEnhancement</a> (extension non officielle) <a href="#ChromeUtilities-py3">ChromeUtilities</a> (extension non officielle) <a href="#clipspeak-py3">Clipspeak</a> ) (extension non officielle) <a href="#commandHelper-py3">commandHelper</a> ) (extension non officielle) <a href="#cricricri-py3">cricricri</a> ) (extension non officielle) <a href="#dropbox-py3">dropbox</a> (extension officielle) <a href="#EnhancedDictionaries-py3">EnhancedDictionaries</a> (extension non officielle) <a href="#EnhancedFindDialog-py3">EnhancedFindDialog</a> (extension non officielle) <a href="#FENReader-py3">FENReader</a> (extension non officielle) <a href="#firefox+-py3">firefox+</a> (extension non officielle) <a href="#Hotkeys+-py3">Hotkeys+ (Raccourcis+)</a> (extension non officielle) <a href="#markdownForever-py3">markdownForever</a> (extension non officielle) <a href="#NVDAExtensionGlobalPlugin-py3">NVDAExtensionGlobalPlugin</a> (extension non officielle) <a href="#OBJSounds%20(KevanGC%20Version)-py3">OBJSounds (KevanGC Version)</a> (extension non officielle) <a href="#poeditMadeEasy-py3">poeditMadeEasy</a> (extension non officielle) <a href="#radioSureAccessEnhancement-py3">radioSureAccessEnhancement</a> (extension non officielle) <a href="#recuvaAccessEnhancement-py3">recuvaAccessEnhancement</a> (extension non officielle) <a href="#RemapKeyAplication-py3">RemapKeyAplication</a> (extension non officielle) <a href="#reportPasswords-py3">reportPasswords</a> (extension non officielle) <a href="#Svox%20Pico-py3">Svox Pico</a> (extension non officielle) <a href="#Thunderbird+%20pour%20NVDA,%20plus%20d&#39;efficacit&#233;%20et%20de%20confort%20lors%20de%20l&#39;utilisation%20de%20Thunderbird%2091,%2078%20et%2068-py3">Thunderbird+ pour NVDA, plus d'efficacit&#233; et de confort lors de l'utilisation de Thunderbird 91, 78 et 68</a> (extension non officielle) <a href="#TiendaNVDA-py3">TiendaNVDA</a> (extension non officielle) <a href="#TimerForNVDA-py3">TimerForNVDA</a> (extension non officielle) <a href="#VLCAccessEnhancement-py3">VLCAccessEnhancement</a> (extension non officielle) <a href="#Weather_Plus-py3">Weather_Plus</a> (extension officielle) <a href="#winExplore-py3">winExplore</a> (extension non officielle) <a href="#wordAccessEnhancement-py3">wordAccessEnhancement</a> (extension non officielle) <a href="#zPod-py3">zEmoticonos</a> (extension non officielle) <a href="#zPod-py3">zPod</a> (extension non officielle) <a href="#zRadio-py3">zRadio</a> (extension non officielle) <a href="#zUtilidades-py3">zUtilidades</a> (extension non officielle)</p>
<hr />
<table style="width:100%;">
<caption>Extensions compatibles avec Python3</caption>
<colgroup>
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
</colgroup>
<thead>
<tr class="header">
<th>Nom</th>
<th>Compatibilit&#233; avec Python3</th>
<th>Compatible avec les versions de NVDA</th>
<th>Auteur</th>
<th>Langues support&#233;s</th>
<th>Description</th>
<th>Lien de t&#233;l&#233;chargement #1</th>
<th>Lien de t&#233;l&#233;chargement #2</th>
<th>Informations suppl&#233;mentaires</th>
<th>#</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>AccesSolutionsNVDAPro <a id="AccessolutionsNvdaPro-py3"></a></td>
<td>oui</td>
<td>2018.2.1 &#224; 2021.1</td>
<td><a href="http://www.accessolutions.fr/">AccesSolutions</a></td>
<td>Fran&#231;ais</td>
<td>Accessolutions NVDA Pro, extension dont la fonction principale est de faciliter la transition depuis le lecteur d'&#233;cran JAWS, plus particuli&#232;rement lors de la navigation internet.</td>
<td><a href="https://www.nvda-fr.org/r?p=AccessPro">T&#233;l&#233;charger AccesSolutionsNVDAPro via nvda-fr.org</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>AcortadorURL (R&#233;duireURL) <a id="AcortadorURL-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Arabe, Espagnol et Fran&#231;ais</td>
<td>Extension pour NVDA utilisant un service en ligne pour r&#233;duire URLs</td>
<td><a href="https://nvda.es/files/get.php?file=acortadorurl">T&#233;l&#233;charger la version actuelle 0.4.1 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension AcortadorURL (R&#233;duireURL) via BlindHelp.github.io <a href="https://blindhelp.github.io/AcortadorURL/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>addonPackager <a id="addonPackager-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Anglais, Arabe, Espagnol, Fran&#231;ais et Portugais du Portugal / Br&#233;sil</td>
<td>Empaqueteuse d'extensions pour NVDA</td>
<td><a href="https://nvda.es/files/get.php?file=addonpackager">T&#233;l&#233;charger la version actuelle 0.7.2 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension addonPackager via BlindHelp.github.io <a href="https://blindhelp.github.io/addonPackager/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>addonsHelp <a id="addonsHelp-py3"></a></td>
<td>oui</td>
<td>2017.3 &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#116;&#x69;&#102;&#108;&#x6f;&#116;&#x65;&#x63;&#110;&#x69;&#x61;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x75;&#x69;&#46;&#102;&#x6f;&#110;&#116;&#x65;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#x75;&#x69;&#32;&#70;&#x6f;&#110;&#116;&#x65;&#x73;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#x75;&#x69;&#32;&#70;&#x6f;&#110;&#116;&#x65;&#x73;&#32;&#40;&#114;&#x75;&#x69;&#46;&#102;&#x6f;&#110;&#116;&#x65;&#x73;&#32;&#x61;&#116;&#32;&#116;&#x69;&#102;&#108;&#x6f;&#116;&#x65;&#x63;&#110;&#x69;&#x61;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Cette extension fournit un moyen rapide d'acc&#233;der &#224; la documentation des extensions que vous avez install&#233;es. Elle ajoute, dans le menu Aide de NVDA, deux sous-menus. L'un, appel&#233; &quot;Documentation des extensions en cours d'ex&#233;cution&quot;, regroupe la documentation de chaque extension et met &#224; disposition une liste de commandes pour toutes les extensions en cours d'ex&#233;cution, avec un tableau pour chaque extension. L'autre sous-menu intitul&#233; &quot;Documentation des extensions d&#233;sactiv&#233;es&quot; r&#233;pertorie les extensions d&#233;sactiv&#233;es.</td>
<td><a href="https://addons.nvda-project.org/files/get.php?file=addonshelp">T&#233;l&#233;charger la version stable via le site comunautaire des extensions NVDA</a></td>
<td></td>
<td><a href="https://addons.nvda-project.org/addons/addonsHelp.fr.html">Pour plus d'informations vous pouvez consulter la documentation sur le site comunautaire des extensions NVDA</a></td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>AirLiveDrive (AirAccessibility)<a id="AirLiveDrive-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera, Gerar K&#233;ssler</span></td>
<td>Espagnol, Fran&#231;ais et Portugais du Portugal / Br&#233;sil</td>
<td>Rend plus accessibles les produits AirExplorer et AirLiveDrive pour NVDA</td>
<td><a href="https://nvda.es/files/get.php?file=airlivedrive">T&#233;l&#233;charger la version actuelle 1.0 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension AirLiveDrive via BlindHelp.github.io <a href="https://blindhelp.github.io/AirLiveDrive/">en cliquant ici</a> Ce sont des gars hispanophones qu'ils ont mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>applicationDictionary <a id="applicationDictionary-py3"></a></td>
<td>oui</td>
<td>2019.1 &#224; 2020.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#46;&#108;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#x39;&#x35;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#32;&#76;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#32;&#76;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#32;&#40;&#114;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#46;&#108;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#x39;&#x35;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript> et <script type="text/javascript">
<!--
h='&#116;&#x69;&#102;&#108;&#x6f;&#116;&#x65;&#x63;&#110;&#x69;&#x61;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x75;&#x69;&#46;&#102;&#x6f;&#110;&#116;&#x65;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#x75;&#x69;&#32;&#70;&#x6f;&#110;&#116;&#x65;&#x73;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#x75;&#x69;&#32;&#70;&#x6f;&#110;&#116;&#x65;&#x73;&#32;&#40;&#114;&#x75;&#x69;&#46;&#102;&#x6f;&#110;&#116;&#x65;&#x73;&#32;&#x61;&#116;&#32;&#116;&#x69;&#102;&#108;&#x6f;&#116;&#x65;&#x63;&#110;&#x69;&#x61;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais, Portugais-Br&#233;sil, et Portugais-Portugal</td>
<td>Permet la cr&#233;ation de dictionnaires sp&#233;cifiques &#224; l'application. Utilisez la commande NVDA+Maj+P pour acc&#233;der au dictionnaire de l'application en cours.</td>
<td><a href="https://blindhelp.github.io/applicationDictionary-1.3.nvda-addon">T&#233;l&#233;charger l'extension applicationDictionary-1.3.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Pour plus d'informations vous pouvez consulter la documentation, pour cela appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>apprentiClavierAccessEnhancement <a id="apprentiClavierAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2020.4 &#224; 2021.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Arabe et Fran&#231;ais</td>
<td>Cette extension permet d'utiliser le c&#233;l&#232;bre logiciel <a href="http://www.apprenticlavier.com/">ApprentiClavier</a> pour apprendre &#224; taper au clavier en tentant de le rendre le plus accessible possible sous NVDA. Cette extension n'ajoute aucun script. Pour ceux qui utilisent le logiciel ApprentiClavier, voici la mise &#224; jour de l'extension NVDA compatible avec la version 2020.4 et sup&#233;rieur. Cette extension a chang&#233;e de nom pour raison d'homog&#233;n&#233;it&#233; avec les autres extensions fait par l'auteur. Son installation s'ocuppe de tout. Pas besoin de d&#233;sinstaller la pr&#233;c&#233;dente. Hormis cette compatibilit&#233;, a &#233;t&#233; ajout&#233; la mise &#224; jour automatique de l'extension.</td>
<td><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/apprentiClavierAccessEnhancement/apprentiClavierAccessEnhancement-1.6.nvda-addon?raw=true">T&#233;l&#233;charger l'extension apprentiClavierAccessEnhancement-1.6.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Bien que cette extension ne soit pas parfaite (ce logiciel &#233;tant bien coriace et devenant instable sous W10), j'esp&#232;re qu'elle vous permettra d'utiliser autant que possible ApprentiClavier. ApprentiClavier ne paraissant plus maintenu, Daniel Poiraud, du club informatique AVH16, a modifi&#233; quelques &#233;l&#233;ments de la programmation, pour faire d&#233;tecter sur l'ordinateur NVDA et les derni&#232;res versions de Jaws. Des pages d'informations ont &#233;t&#233; modifi&#233;es pour tenir compte de NVDA comme autre lecteur d'&#233;cran que Jaws. Cette version modifi&#233;e a &#233;t&#233; not&#233;e 1.10. Vous pourrez consulter la page ApprentiClavier cr&#233;&#233;e &#224; cette occasion sur le site, &#224; cette adresse: <a href="http://angouleme.avh.asso.fr/fichesinfo/apprenticlavier/index.htm" class="uri">http://angouleme.avh.asso.fr/fichesinfo/apprenticlavier/index.htm</a> Les sources de cette version sont t&#233;l&#233;chargeables depuis le site mentionn&#233; ci-dessus puisque c&#8217;est un logiciel libre.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>audacityAccessEnhancement <a id="audacityAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Arabe, Anglais, Espagnol, Fran&#231;ais et Turc</td>
<td>Cette extension am&#233;liore l'accessiblit&#233; du logiciel Audacity. Cette version de l'extension a &#233;t&#233; test&#233;e avec NVDA 2021.3 et audacity version 3.1, 3.0 et 2.4.2. Les pr&#233;c&#233;dentes versions d'Audacity ne sont pas support&#233;es.</td>
<td><a href="https://github.com/paulber007/AllMyNVDAAddons/raw/master/audacityAccessEnhancement/audacityAccessEnhancement-2.5.1.nvda-addon">T&#233;l&#233;charger l'extension audacityAccessEnhancement-2.5.1.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>ChromeUtilities <a id="ChromeUtilities-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Arabe, Anglais, Espagnol, Fran&#231;ais et Portugais-Br&#233;sil, et Portugais-Portugal</td>
<td>Am&#233;lioration pour rendre Chrome plus facile &#224; utiliser avec NVDA</td>
<td><a href="https://nvda.es/files/get.php?file=chromeutils">T&#233;l&#233;charger la version actuelle 0.94 (seulement valable pour Chrome 94) par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td><a href="https://github.com/hxebolax/Utilidades-Chrome/releases/download/0.92/ChromeUtilities-0.92.nvda-addon">T&#233;l&#233;charger la version compatible avec Chrome 92 et 93 par l&#224;: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension ChromeUtilities via BlindHelp.github.io <a href="https://blindhelp.github.io/ChromeUtilities/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>Clipspeak <a id="clipspeak-py3"></a></td>
<td>oui</td>
<td>2018.3 &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#100;&#x63;&#112;&#x65;&#110;&#100;&#108;&#x65;&#116;&#x6f;&#110;&#46;&#112;&#108;&#x75;&#x73;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#100;&#x61;&#x6d;&#x69;&#x65;&#110;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x53;&#x79;&#x6b;&#x65;&#x73;&#x2d;&#76;&#x69;&#110;&#100;&#108;&#x65;&#x79;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x53;&#x79;&#x6b;&#x65;&#x73;&#x2d;&#76;&#x69;&#110;&#100;&#108;&#x65;&#x79;&#32;&#40;&#100;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x61;&#116;&#32;&#100;&#x63;&#112;&#x65;&#110;&#100;&#108;&#x65;&#116;&#x6f;&#110;&#32;&#100;&#x6f;&#116;&#32;&#112;&#108;&#x75;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Extension pour verbaliser les informations du presse-papiers. Diff&#233;rence entre l'extension Clipspeak et l'extension fakeClipboardAnouncement: Avec l'extension fakeClipboardAnouncement NVDA vous dit couper, copier ou coller en appuyant sur Contr&#244;le+X, Contr&#244;le+C et Contr&#244;le+V respectivement, mais vous ne savez pas si l'action a effectivement eu lieu ou non, m&#234;me si l'action n'a pas &#233;t&#233; fait celle-ci est annonc&#233;. De l&#224; vient le nom, fakeClipboardAnouncement, dont la traduction litt&#233;rale en fran&#231;ais est Faux Annonce du Presse-papiers. Au lieu de cela, l'extension Clipspeak v&#233;rifie que l'action est en cours avant de le dire. Interf&#233;rence entre l'extension Clipspeak et l'extension Clip Contents Designer: Gardez &#224; l'esprit que, avec ou sans traduction, cette extension peut &#234;tre interf&#233;r&#233; par Clip Contents Designer sur certaines touches. Pour le r&#233;soudre, nous pouvons aller dans Pr&#233;f&#233;rences&gt; Gestes de commandes et supprimer les touches ctrl+C et ctrl+X dans la section &quot;Revue de texte&quot; (elles sont dans: &quot;Copier dans le presse-papiers, avec la possibilit&#233; de demander une confirmation pr&#233;alable&quot; et: &quot;Couper &#224; partir du presse-papiers, avec la possibilit&#233; de demander une confirmation pr&#233;alable&quot;). Interf&#233;rence entre l'extension Clipspeak et l'extension fakeClipboardAnouncement: Remarque Tr&#232;s Importante ; Si vous avez install&#233; l'extension fakeClipboardAnouncement s&#233;par&#233;ment, vous devez le d&#233;sinstaller avant d'installer l'extension Clipspeak. Interf&#233;rence entre l'extension Clipspeak et l'extension NVDAExtensionGlobalPlugin: Note : Si vous avez install&#233; l'extension NVDAExtensionGlobalPlugin fait par Paul de la liste scriptNVDA, vous aurez la fonctionnalit&#233;: Annonce de la fonction associ&#233;e aux commandes d'&#233;dition du style &quot;copier&quot;, &quot;Coller&quot; Cette fonctionnalit&#233; est install&#233;e par d&#233;faut. Les fonctions d&#233;clench&#233;es par les raccourcis &quot;control+v&quot;, &quot;control+c&quot;, &quot;control+x&quot;, &quot;control+z&quot; n'&#233;tant pas vocalis&#233;es par NVDA, l'extension s'en charge. Aucun controle sur le r&#233;sultat de la fonction n'est fait. Mais pour les raccourcis &quot;control+c&quot;, &quot;control+x&quot;, l'absence de s&#233;lection de texte est signal&#233;e dans les arborescences et les listes. Si l'extension fakeClipboardAnnouncement est install&#233; (qui r&#233;alise la m&#234;me fonction), il faut le d&#233;sinstaller. Vous devez aussi d&#233;sinstaller cette fonctionnalit&#233; au pr&#233;alable dans l'extension NVDAExtensionGlobalPlugin avant d'installer l'extension Clipspeak. Donc pour ce faire, aller dans le Menu NVDA (NVDA+n) puis Pr&#233;f&#233;rences puis Param&#232;tres Extension des commandes de base de NVDA... sous-menu puis Installation des fonctionnalit&#233;s... Rechercher l'&#233;l&#233;ment: Annonce de la fonction associ&#233;e aux commandes d'&#233;dition Installer Cette fonctionnalit&#233; est install&#233;e par d&#233;faut. Faire une fll&#232;che gauche pour avoir: Annonce de la fonction associ&#233;e aux commandes d'&#233;dition Ne pas installer Puis tab jusq'au bouton: OK Relancez NVDA pour que les modifications prennent effet. Une fois d&#233;sinstall&#233;e cette fonctionnalit&#233; dans l'extension NVDAExtensionGlobalPlugin et ensuite avoir install&#233;e l'extension Clipspeak, celui-ci permet &#224; NVDA d'annoncer automatiquement les op&#233;rations du presse-papiers (telles que couper, copier et coller), ainsi que d'autres op&#233;rations courantes. L'extension a &#233;t&#233; modifi&#233; pour initialiser le syst&#232;me de traduction et ajouter une premi&#232;re traduction en espagnol (merci &#224; Iv&#225;n Novegil Cancelas). J'ai &#233;t&#233; inspir&#233; &#224; faire de m&#234;me, mais pour initialiser le syst&#232;me de traduction et ajouter une premi&#232;re traduction en fran&#231;ais.</td>
<td>[T&#233;l&#233;charger l'extension clipspeak-1.1-es-fr.nvda-addon par ici: <a href="https://novegil.es/nvda/complementos/clipspeak-1.1-es-fr.nvda-addon">lien externe</a> (merci &#224; Iv&#225;n Novegil Cancelas).</td>
<td></td>
<td>Pour plus d'informations vous pouvez consulter la documentation, pour cela appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>commandHelper <a id="commandHelper-py3"></a></td>
<td>oui</td>
<td>2018.1 &#224; 2021.1</td>
<td><span lang="es"><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;&#x25;&#x33;&#x43;&#x2f;&#x73;&#112;&#x61;&#110;&#x25;&#x33;&#x45;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#xed;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#xed;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x25;&#x33;&#x43;&#x2f;&#x73;&#112;&#x61;&#110;&#x25;&#x33;&#x45;&#x29;</noscript></td>
<td>Arabe, Anglais, Chinois, traditionnel et simplifi&#233;, Espagnol, Fran&#231;ais et Portugais-Br&#233;sil, et Portugais-Portugal</td>
<td>(Assistant de commandes) Fournit une autre m&#233;thode d'ex&#233;cution de scripts pour les personnes qui ont des difficult&#233;s &#224; appuyer sur des combinaisons de clavier compliqu&#233;es.</td>
<td><a href="https://nvda.es/files/get.php?file=cmdHelper-dev">T&#233;l&#233;charger la version actuelle dev20210703 de l'extension commandeHelper par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td><a href="https://github.com/javidominguez/commandHelper/">Voir code source sur le d&#233;p&#244;t de l'auteur sur GitHub</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>cricricri <a id="cricricri-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol et Fran&#231;ais</td>
<td>Extension pour changer le maudit manifeste</td>
<td><a href="https://nvda.es/files/get.php?file=cricricri">T&#233;l&#233;charger la version actuelle 0.1 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension cricricri via BlindHelp.github.io <a href="https://blindhelp.github.io/cricricri/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>dropbox <a id="dropbox-py3"></a></td>
<td>oui</td>
<td>2019.1 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#122;&#x61;&#106;&#100;&#x61;&#46;&#102;&#114;';a='&#64;';n='&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;&#32;&#40;&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#x61;&#116;&#32;&#122;&#x61;&#106;&#100;&#x61;&#32;&#100;&#x6f;&#116;&#32;&#102;&#114;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Cette extension ajoute un raccourci permettant d'annoncer le statut ou la version de Dropbox, mais aussi d'ouvrire le menu contextuel de l'ic&#244;ne Dropbox dans la zone de notification. Elle rends &#233;galement possible d'utiliser les onglets de la bo&#238;te de dialogue pr&#233;f&#233;rences avec Ctrl+tab / Ctrl+Maj+Tab et Ctrl+PagePr&#233;c/Suiv. Pour conclure, ajoute &#233;chapp pour activer le bouton Annuler.</td>
<td><a href="https://github.com/Nardol/dropbox/releases/download/v4.6/dropbox-4.6.nvda-addon">T&#233;l&#233;charger l'extension dropbox-4.6.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td><a href="https://patrick.zajda.fr/nvda/dropbox-4.6.nvda-addon" class="uri">https://patrick.zajda.fr/nvda/dropbox-4.6.nvda-addon</a></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>EnhancedDictionaries <a id="EnhancedDictionaries-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;&#32;&#40;&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais, Portugais du Br&#233;sil et Portugais du Portugal</td>
<td>Traitement des dictionnaires plus avanc&#233;s pour NVDA. Cette extension introduit des am&#233;liorations dans le traitement des dictionnaires dans NVDA. Maintenant, vous pouvez utiliser des dictionnaires sp&#233;cifiques pour chaque profil, ce qui vous permet une plus grande productivit&#233; en permettant &#224; divers dictionnaires d'&#234;tre utilis&#233;s dans diff&#233;rentes applications ou &#224; des fins diff&#233;rentes.</td>
<td>T&#233;l&#233;charger <a href="https://github.com/marlon-sousa/EnhancedDictionaries/releases/download/1.2.1/EnhancedDictionaries-1.2.1.nvda-addon">version actuelle 1.2.1 sur le d&#233;p&#244;t de l'auteur sur GitHub [lien externe]</a></td>
<td></td>
<td><a href="https://github.com/marlon-sousa/EnhancedDictionaries">Voir code source sur le d&#233;p&#244;t de l'auteur sur GitHub</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>EnhancedFindDialog <a id="EnhancedFindDialog-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;&#32;&#40;&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais, Portugais du Br&#233;sil, Portugais du Portugal et Russe</td>
<td>Dialogue de recherche &#233;tendue pour NVDA Cette extension introduit des am&#233;liorations dans la bo&#238;te de dialogue de recherche de NVDA. Maintenant c'est possible d'acc&#233;der aux termes de recherche pr&#233;c&#233;dents, ce qui vous permettra de mener des recherches en fonction des termes pr&#233;c&#233;dents de mani&#232;re beaucoup plus efficace</td>
<td>T&#233;l&#233;charger <a href="https://github.com/marlon-sousa/EnhancedFindDialog/releases/download/1.2.0/EnhancedFindDialog-1.2.0.nvda-addon">version actuelle 1.2.0 sur le d&#233;p&#244;t de l'auteur sur GitHub [lien externe]</a></td>
<td></td>
<td><a href="https://github.com/marlon-sousa/EnhancedFindDialog">Voir code source sur le d&#233;p&#244;t de l'auteur sur GitHub</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>FENReader <a id="FENReader-py3"></a></td>
<td>oui</td>
<td>2018.1 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Cette extension d&#233;crit une position de jeu d'&#233;checs a partir de un code FEN.</td>
<td><a href="https://nvda.es/files/get.php?file=fenreader">T&#233;l&#233;charger l'extension fenReader-2.0.nvda-addon [Via la page GitHub de l'auteur]</a></td>
<td></td>
<td><a href="https://github.com/javidominguez/FenReader/">Voir code source sur le d&#233;p&#244;t de l'auteur sur GitHub</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>firefox+ <a id="firefox+-py3"></a></td>
<td>oui</td>
<td>2019.1 et suivants</td>
<td>Javi Dominguez de l'extension Mozilla version 1.12, PaulBert auteur de l'extension Firefox 1.2 et R&#233;my Ruiz auteur de l'extension Firefox+ 1.12, adapt&#233; en une seule extension par AVH16</td>
<td>Fran&#231;ais</td>
<td>Pour ceux et celles qui utilisent&#160; Firefox avec NVDA, voici une extension qui fournit des fonctions d'accessibilit&#233; pour <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/firefox/index.htm">Mozilla Firefox et Waterfox</a> Compatible avec Firefox 68 &#224; 89, Waterfox 2020.x, Windows 7 &#224; 10. Important. Si les extensions Firefox 1.2 de PaulBert, ou Mozilla Apps Enhanced de Javi Dominguez, ou la version pr&#233;c&#233;dente de Firefox+ sont install&#233;es, vous devez d'abord les d&#233;sinstaller avant d'installer Firefox+.</td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/firefox+_2.2.nvda-addon">T&#233;l&#233;charger l'extension firefox+ version actuelle 2.2 du 12 juillet 2021 par ici</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension Firefox+ <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/firefox/firefox_extension.htm">en cliquant ici</a> Vous y trouverez les commandes disponibles ainsi que les changements apport&#233;es &#224; cette nouvelle extension. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>Hotkeys+ (Raccourcis+ ) <a id="Hotkeys+-py3"></a></td>
<td>oui</td>
<td>2019.1 et suivants</td>
<td><script type="text/javascript">
<!--
h='&#114;&#112;&#116;&#x6f;&#x6f;&#108;&#x73;&#46;&#x6f;&#114;&#x67;';a='&#64;';n='&#112;&#108;&#114;&#46;&#108;&#x69;&#x73;&#116;&#x65;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x69;&#x65;&#114;&#114;&#x65;&#x2d;&#76;&#x6f;&#x75;&#x69;&#x73;&#32;&#82;&#46;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x69;&#x65;&#114;&#114;&#x65;&#x2d;&#76;&#x6f;&#x75;&#x69;&#x73;&#32;&#82;&#46;&#32;&#40;&#112;&#108;&#114;&#46;&#108;&#x69;&#x73;&#116;&#x65;&#x73;&#32;&#x61;&#116;&#32;&#114;&#112;&#116;&#x6f;&#x6f;&#108;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x6f;&#114;&#x67;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Ajoute ces raccourcis clavier &#224; NVDA : - Pause : ferme la fen&#234;tre active en envoyant Alt+F4. - Control+pause : ferme l'onglet actif en envoyant Control+w. - Control+Retour arri&#232;re : ferme l'onglet actif en envoyant Control+F4. - Alt+pause : ferme toutes les fen&#234;tres apr&#232;s confirmation.</td>
<td><a href="http://www.rptools.org/?p=8701">T&#233;l&#233;charger l'extension Hotkeys+ (Raccourcis+) version actuelle 1.1 du 27 novembre 2020 par ici</a></td>
<td></td>
<td>Si la version pr&#233;c&#233;dente de l'extension pour NVDA nomm&#233; <a href="https://blindhelp.github.io/FermeFenaitre/">&quot;FermeFenaitre&quot;</a> faite par G&#233;rard est install&#233;e, vous devez tout d'abord la d&#233;sinstaller avant d'installer Hotkeys+ (Raccourcis+). Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension Hotkeys+ (Raccourcis+) <a href="http://www.rptools.org/Outils-DV/NVDA-HotkeysPlus.html">en cliquant ici</a> ; Pour acc&#233;der &#224; la section &quot;Attribuer un raccourci &#224; une action&quot;, visitez <a href="http://www.rptools.org/Outils-DV/NVDA-RaccourcisPlus.html#toc4">cette page</a> ; Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>markdownForever <a id="markdownForever-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x61;&#110;&#100;&#114;&#x65;&#x61;&#98;&#x63;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#100;&#x65;&#118;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#110;&#100;&#114;&#xe9;&#x2d;&#x41;&#98;&#x75;&#x73;&#104;&#32;&#x43;&#108;&#x61;&#x75;&#x73;&#x65;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#110;&#100;&#114;&#xe9;&#x2d;&#x41;&#98;&#x75;&#x73;&#104;&#32;&#x43;&#108;&#x61;&#x75;&#x73;&#x65;&#32;&#40;&#100;&#x65;&#118;&#32;&#x61;&#116;&#32;&#x61;&#110;&#100;&#114;&#x65;&#x61;&#98;&#x63;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript>, <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#104;&#x65;&#108;&#108;&#x6f;&#x73;&#x6f;&#102;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x53;&#x6f;&#102;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x53;&#x6f;&#102;&#32;&#40;&#104;&#x65;&#108;&#108;&#x6f;&#x73;&#x6f;&#102;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript> et autres contributeurs</td>
<td>Anglais, Chinois, Espagnol, Fran&#231;ais, Turc et Vietnamien</td>
<td>Convertisseur Markdown et HTML complet pour NVDA</td>
<td><a href="https://andreabc.net/projects/NVDA_addons/markdownForever.nvda-addon">T&#233;l&#233;charger l'extension MarkdownForever version stable par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions vous pouvez consulter la documentation en allant dans le menu NVDA, puis chercher Markdown Forever (suivi du num&#233;ro de version) sous-menu puis en appuyant sur Entr&#233;e sur l'&#233;l&#233;ment: Documentation. Bravo Andr&#233; et Sof pour tout ce travail! &#128515;</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>NVDAExtensionGlobalPlugin <a id="NVDAExtensionGlobalPlugin-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.2</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Arabe, Anglais, Espagnol, Fran&#231;ais, Portugais-Br&#233;sil, Portugais-Portugal, Russe, Serbe, Turc et Vietnamien</td>
<td>Extension des commandes de base de NVDA. Avant d'installer cette extension, supprimer toutes les installation de l'extension Global Plugin &quot;liste des fen&#234;tres&quot; et l'extensions &quot;fakeClipboardAnouncement&quot; car cette version les inclut.</td>
<td><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/NVDAExtensionGlobalPlugin/NVDAExtensionGlobalPlugin-10.1.nvda-addon">T&#233;l&#233;charger l'extension NVDAExtensionGlobalPlugin-10.1.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>OBJSounds (KevanGC Version) <a id="OBJSounds (KevanGC Version)-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td>Tyler Spivey et <script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript> pour l'adaptation de cette extension &#224; Pithon 3 avec NVDA2021.1</td>
<td>Anglais, Fran&#231;ais et Espagnol</td>
<td>Cette extension annonce les types d'objets &#224; travers diff&#233;rents sons. C'est-&#224;-dire que lorsque nous nous positionnons, par exemple, sur une case &#224; cocher, cela &#233;mettra un son et lorsque nous avons le focus sur une liste d&#233;roulante, ce sera un autre son et ainsi de suite. La version modifi&#233;e par KevanGC ajoute le raccourci NVDA + alt + O pour activer ou d&#233;sactiver les sons et r&#233;duire leur volume. Les sons peuvent &#234;tre modifi&#233;s en rempla&#231;ant celui qui correspond dans le dossier: <code>globalPlugins&gt;objsounds&gt;objdata</code>, en consid&#233;rant comme racine le dossier o&#249; est install&#233; l'extension (g&#233;n&#233;ralement, ex&#233;cuter Windows+r puis taper: <code>%appdata%</code>, NVDA, addons, ObjSounds, dans les copies portables, la premi&#232;re &#233;tape aie remplac&#233;e en explorant le r&#233;pertoire nomm&#233; userConfig situ&#233; dans le r&#233;pertoire de votre copie portable de NVDA. Obj Sounds c'est la m&#234;me version mais modifier par KevanGC</td>
<td><a href="https://blindhelp.github.io/objsounds-0.20120928.01-P05.nvda-addon">T&#233;l&#233;charger l'extension OBJSounds (KevanGC Version) modifi&#233; par Paul [via BlindHelp.github.io]</a></td>
<td></td>
<td>Commentaire par BlindHelp: Il peut &#233;galement &#234;tre personnalis&#233; sans trop de difficult&#233;, ont peut mettre dans le dossiers correspondants les fichiers sons avec leurs noms et le format appropri&#233;. Sette extension contrairement &#224; la version originale, a une fa&#231;on de Activer et d&#233;sactiver les sons, avec NVDA + alt + o. Ce que je n'aime pas c'est qu'ils ont mis la touche alt; lorsque la touche alt est enfonc&#233;e, le menu s'ouvre, mais malgr&#233; cela, ce raccourci peut &#234;tre utilis&#233;, cependant si vous ne vous sentez pas &#224; l'aise nous devrons donc le modifier dans le dialogue Gestes de commandes, dans la cat&#233;gorie &quot;Divers&quot; puis chercher &quot;Activer/d&#233;sactiver le signalement du type des objets par un son&quot;, le geste de commande par d&#233;faut est &quot;NVDA+alt+o (clavier, toutes les dispositions)&quot;. Je le pr&#233;f&#232;re aussi parce que le son des oiseaux est plus faible et moins envahissant. Par ailleurs, je pense qu'il est &#233;gal &#224; l'extension de l'auteur original. J'esp&#232;re qu'ells servent.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>poeditMadeEasy <a id="poeditMadeEasy-py3"></a></td>
<td>oui</td>
<td>2019.1 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#100;&#114;&#x69;&#x73;&#104;&#116;&#x69;&#98;&#x61;&#x63;&#104;&#x61;&#x6b;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#72;&#x69;&#x6d;&#32;&#80;&#114;&#x61;&#x73;&#x61;&#100;&#32;&#x47;&#x61;&#x75;&#116;&#x61;&#x6d;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#72;&#x69;&#x6d;&#32;&#80;&#114;&#x61;&#x73;&#x61;&#100;&#32;&#x47;&#x61;&#x75;&#116;&#x61;&#x6d;&#32;&#40;&#100;&#114;&#x69;&#x73;&#104;&#116;&#x69;&#98;&#x61;&#x63;&#104;&#x61;&#x6b;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript> et <script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript> pour l'adaptation de cette extension &#224; Pithon 3 avec NVDA2021.1</td>
<td>Anglais, Espagnol, Fran&#231;ais, Hindi, N&#233;palais et tamoul</td>
<td>Am&#233;lioration de l'Acc&#232;s sur poedit. Cette extension annonce les actions effectu&#233; en appuyant sur les commandes des raccourci de poedit. Il indique les diff&#233;rente cat&#233;gories de messages par un bip sp&#233;cifique. &#201;galement en appuyant sur les gestes sp&#233;cifi&#233;s, vous pouvez conna&#238;tre la source et le texte du message traduit en plus de basculer entre activer/d&#233;sactiver le mode bip. Note: la version 3.1 de l'extension poeditMadeEasy proposer par l'auteur original ne contient-pas ces deux langues (Espagnol et Fran&#231;ais) ni la compatibilit&#233; avec Python3 avec la nouvelle version 2021.1.</td>
<td><a href="https://blindhelp.github.io/nvda-poeditMadeEasy-3.1-p03.nvda-addon">T&#233;l&#233;charger l'extension nvda-poeditMadeEasy-3.1-p03.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>radioSureAccessEnhancement <a id="radioSureAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Arabe, Anglais, Espagnol, Fran&#231;ais et Turc</td>
<td>Cette extension am&#233;liore l'accessibilit&#233; du logiciel RadioSure avec NVDA. Cette extension a &#233;t&#233; test&#233; avec la version 2.2 de RadioSure. Les versions ant&#233;rieures ne sont pas support&#233;es. Voir le manuel utilisateur pour plus d'informations.</td>
<td><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/radioSureAccessEnhancement/radioSureAccessEnhancement-2.4.nvda-addon">T&#233;l&#233;charger l'extension radioSureAccessEnhancement-2.4.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>recuvaAccessEnhancement <a id="recuvaAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2020.4 &#224; 2021.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Anglais, Arabe Espagnol et Fran&#231;ais</td>
<td>Bien que cette application soit relativement bien accessible, cette extension tente d'am&#233;liorer l'accessibilit&#233; du logiciel de r&#233;cup&#233;ration de fichiers avec NVDA. Cette extension a &#233;t&#233; test&#233;e avec Recuva version 1.53.</td>
<td><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/recuvaAccessEnhancement/recuvaAccessEnhancement-1.4.nvda-addon">T&#233;l&#233;charger l'extension recuvaAccessEnhancement-1.4.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>RemapKeyAplication <a id="RemapKeyAplication-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol et Fran&#231;ais</td>
<td>&quot;&quot;&quot;Simuler la touche Applications</td>
<td><a href="https://nvda.es/files/get.php?file=RemapKeyAplication">T&#233;l&#233;charger la version actuelle 0.1.5 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension RemapKeyAplication via BlindHelp.github.io <a href="https://blindhelp.github.io/RemapKeyAplication/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>reportPasswords <a id="reportPasswords-py3"></a></td>
<td>oui</td>
<td>2019.3 ou ult&#233;rieure</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;&#32;&#40;&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Fran&#231;ais et d'autres langues support&#233;s par NVDA</td>
<td>Lorsque cette extension est install&#233;e, NVDA peut annoncer le texte tap&#233; dans les contr&#244;les prot&#233;g&#233;s telles que les mots de passe.</td>
<td><a href="http://addons.nvda-project.org/files/get.php?file=rp">T&#233;l&#233;charger la derni&#232;re version stable de l'extension reportPasswords via le lien du site Communautaire des Extensions NVDA</a></td>
<td><a href="http://addons.nvda-project.org/files/get.php?file=rp-dev">T&#233;l&#233;charger la derni&#232;re version en cours de d&#233;veloppement de l'extension reportPasswords via le lien du site Communautaire des Extensions NVDA</a></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>Svox Pico <a id="Svox Pico-py3"></a></td>
<td>oui</td>
<td>les plus r&#233;centes</td>
<td>Aleksey Sadovoy, Michael Curran et repris par: <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#100;&#104;&#102;&#x33;&#54;&#48;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x61;&#118;&#x69;&#100;&#32;&#x43;&#x4d;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x61;&#118;&#x69;&#100;&#32;&#x43;&#x4d;&#32;&#40;&#100;&#104;&#102;&#x33;&#54;&#48;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Voix TTS Svox Pico. L'extension Svox-Pico installe le synth&#233;tiseur Open-Source Svox Pico pour NVDA. Svox Pico est un tr&#232;s petit synth&#233;tiseur vocal, mais avec une apparence humaine qui prend en charge les langues Anglais Am&#233;ricain, Anglais Britannique, Espagnol, Fran&#231;ais, Italien et Allemand.</td>
<td><a href="https://nvda.es/files/get.php?file=svoxpico-dev">T&#233;l&#233;charger La derni&#232;re version en d&#233;veloppement de l'extension Svox Pico via le d&#233;p&#244;t de l'auteur sur GitHub</a></td>
<td></td>
<td>Installez-le simplement comme n'importe quel extension NVDA. Puis ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le synth&#233;tiseur: Svox pico synthesizer puis appuyez sur OK ou faire tout simplement Entr&#233;e, ensuite ex&#233;cutez le raccourci: Control+NVDA+V pour changer la langue de la voix par le Fran&#231;ais, et choisissez le d&#233;bit, la hauteur et le volume Que vous voulez, puis appuyez sur OK et n'oubliez pas d'enregistrer vos param&#232;tres &#224; l'aide du raccourci: Control+NVDA+C. Vous pouvez consulter l'article <a href="https://blindhelp.github.io/PicoTTS-NVDA/">Pico TTS, maintenant compatible avec les versions r&#233;centes de NVDA sur BlindHelp.github.io</a></td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>Thunderbird+ pour NVDA, plus d'efficacit&#233; et de confort lors de l'utilisation de Thunderbird 91, 78 et 68<a id="Thunderbird+ pour NVDA, plus d'efficacit&#233; et de confort lors de l'utilisation de Thunderbird 91, 78 et 68-py3"></a></td>
<td>oui</td>
<td>2018.4 et suivantes</td>
<td>Yannick, Mise &#224; jour Daniel Poiraud, Documentation : Pierre-Louis</td>
<td>Fran&#231;ais</td>
<td>Thunderbird+ pour NVDA, plus d'efficacit&#233; et de confort lors de l'utilisation de Thunderbird 91, 78 et 68. Cette version de l'extension Thunderbird+ est bas&#233;e sur l'extension thunderBird de Yannick. Compatibilit&#233;: L'extension a &#233;t&#233; test&#233;e sous Windows 11 et se comporte comme sous Windows 10, 8.1 et 7. Version de Thunderbird compatibles: 60.x, 68.x, 78.x, 91 ou sup&#233;rieur. Si les extensions suivantes sont install&#233;es sur votre ordinateur, vous devez d'abord les supprimer avant d'installer Thunderbird+: thunderBird 2.x ou 3.x ; Chichi ; Mozilla Apps Enhancements de Javie Dominguez.</td>
<td>Quelle version choisir ? ? Si vous utilisez Thunderbird 78.x, t&#233;l&#233;chargez la version 2.x uniquement ; Si vous utilisez Thunderbird 68, t&#233;l&#233;chargez de pr&#233;f&#233;rence la version 2.3 et sup&#233;rieures. La version 1.31 est &#233;galement compatible avec cette version de Thunderbird mais pas avec NVDA 2021.x ; Si vous utilisez la version 60.x de Thunderbird, t&#233;l&#233;chargez la version 1.x uniquement. Comme indiqu&#233; ci-dessus, cette version n'est pas compatible avec NVDA 2021.x ; <a href="http://www.rptools.org/?p=8580">T&#233;l&#233;charger Thunderbird+ 3.0 pour Thunderbird 91</a> ; <a href="http://www.rptools.org/?p=8579">T&#233;l&#233;charger Thunderbird+ 2.3.3 pour Thunderbird 78 et 68</a> ; <a href="http://www.rptools.org/?p=8564">T&#233;l&#233;charger Thunderbird+ 1.31 pour Thunderbird 68 et 60</a>. Derni&#232;re mise &#224; jour le 12.11.2021 Versions 3.0 stable, 2.3.3 et 1.31</td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions. <a href="http://www.rptools.org/Outils-DV/NVDA-ThunderbirdPlus.html">Pour plusd'informations consulter la pr&#233;sentation de l'extension Thunderbird+ pour NVDA, plus d'efficacit&#233; et de confort lors de l'utilisation de Thunderbird 91, 78 et 68, en cliquant ici:</a> ; Vous pouvez aussi consulter la <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/thunderbird/index.htm">Fiche de Daniel Poiraud sur l'utilisation du client de messagerie Thunderbird, en cliquant ici:</a> ; Et enfin, vous pouvez consulter cette <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/thunderbird/thunderbird_extension.htm">Fiche de Daniel Poiraud sur l'extension Thunderbird+, en cliquant ici:</a> Grand merci &#224; Pierre-Louis et Daniel Poiraud pour leur excellent travail. &#128521;</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>TiendaNVDA <a id="TiendaNVDA-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol, Fran&#231;ais et plusieurs autres langues traduites par des membres de la communaut&#233; internationale des extensions NVDA</td>
<td>Boutique pour NVDA.ES Boutique des extensions non officielles de <a href="https://www.nvda.es" class="uri">https://www.nvda.es</a></td>
<td><a href="https://nvda.es/files/get.php?file=tienda">T&#233;l&#233;charger la version actuelle 0.6.1 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension Tienda NVDA via BlindHelp.github.io <a href="https://blindhelp.github.io/TiendaNVDA/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>TimerForNVDA <a id="TimerForNVDA-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4d;&#x61;&#114;&#108;&#x6f;&#110;&#32;&#66;&#114;&#x61;&#110;&#100;&#xe3;&#x6f;&#32;&#100;&#x65;&#32;&#x53;&#x6f;&#x75;&#x73;&#x61;&#32;&#40;&#x6d;&#x61;&#114;&#108;&#x6f;&#110;&#46;&#98;&#x73;&#x6f;&#x75;&#x73;&#x61;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais, Portugais du Br&#233;sil et Portugais du Portugal</td>
<td>Minuterie et chronom&#232;tre simples pour NVDA. Cette extension apporte une impl&#233;mentation rapide, fonctionnelle et simple d'une minuterie et d'un chronom&#232;tre &#224; utiliser avec NVDA. D&#233;marrer une minuterie ou un chronom&#232;tre, en utilisant une unit&#233; de temps et les modes d'indications dont vous avez besoin. Choisisser l'indication entre parole, son ou aucun. Surveiller le progr&#232;s via des indications, via le dialogue de param&#232;tres ou n'importe o&#249; &#224; l'aide de commandes NVDA. Contr&#244;ler la minuterie et le chronom&#232;tre de n'importe o&#249; avec des commandes NVDA.</td>
<td>T&#233;l&#233;charger <a href="https://github.com/marlon-sousa/TimerForNVDA/releases/download/1.3.0/TimerForNVDA-1.3.0.nvda-addon">version actuelle 1.3.0 sur le d&#233;p&#244;t de l'auteur sur GitHub [lien externe]</a></td>
<td></td>
<td><a href="https://github.com/marlon-sousa/TimerForNVDA">Voir code source sur le d&#233;p&#244;t de l'auteur sur GitHub</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>VLCAccessEnhancement <a id="VLCAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2021.1 &#224; 2021.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Anglais, Arabe, Espagnol, Fran&#231;ais, Russe et Turc</td>
<td>Cette extension ajoute diverses commandes pour faciliter la lecture des m&#233;dias avec NVDA. Cette version est compatible avec la version 3.0 de VLC. La liste des commandes est obtenue par Control+NVDA+H</td>
<td><a href="https://github.com/paulber007/AllMyNVDAAddons/raw/master/VLCAccessEnhancement/VLCAccessEnhancement-2.7.nvda-addon">T&#233;l&#233;charger l'extension VLCAccessEnhancement-2.7.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>Weather_Plus <a id="Weather_Plus-py3"></a></td>
<td>oui</td>
<td>2017.3 &#224; 2021.2</td>
<td><script type="text/javascript">
<!--
h='&#x79;&#x61;&#104;&#x6f;&#x6f;&#46;&#x69;&#116;';a='&#64;';n='&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;&#32;&#40;&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;&#32;&#x61;&#116;&#32;&#x79;&#x61;&#104;&#x6f;&#x6f;&#32;&#100;&#x6f;&#116;&#32;&#x69;&#116;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Cette extension ajoute la temp&#233;rature locale et les pr&#233;visions &#224; 24 heures et jusqu'&#224; 2 jours au-del&#224; &#224; NVDA.</td>
<td><a href="http://www.nvda.it/files/plugin/weather_plus8.7.nvda-addon">T&#233;l&#233;charger l'extension Weather_Plus8.7.nvda-addon par ici: [lien externe]</a></td>
<td></td>
<td>Pour plus d'informations sur son utilisation, consultez la documentation depuis le menu Outils/G&#233;rer les extensions... Chercher le nom de l'extension &quot;Weather_Plus. Puis appuyez sur le bouton &quot;Aide&quot; de cette extension. Merci &#224; mon ami Adriano pour cette extension tr&#232;s sympas pour NVDA! (handshake)</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>winExplore<a id="winExplore-py3"></a></td>
<td>oui</td>
<td>2018.4 et suivants.</td>
<td>Daniel Poiraud</td>
<td>Fran&#231;ais</td>
<td>Cette extension est pour rechercher des &#233;l&#233;ments dans une fen&#234;tre en pr&#233;cisant leur type, puis pour explorer le ruban des applications Microsoft. Cette extension est utilisable avec Windows 7 &#224; 10.</td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/winExplore_v4.5.1.nvda-addon">T&#233;l&#233;charger la version actuelle 4.5.1 du 05.07.2021 par ici:</a></td>
<td></td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules_avh16.htm">Pour plus d'informations vous pouvez consulter la documentation de l'extension par ici:</a> Vous trouverez aussi sur cette m&#234;me page l'extension pour Windows Live Mail et Windows Mail.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>wordAccessEnhancement <a id="wordAccessEnhancement-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais et Turc</td>
<td>Cette extension change de nom pour &#233;viter toute confusion avec d'autres extensions. Sa version repart &#224; 1.0. Cette extension a &#233;tait test&#233; avec les versions 2013, 2016 et 2019 de Microsoft Word, (marche peut-&#234;tre aussi avec Word 365), puis a &#233;t&#233; ajout&#233;e la mise &#224; jour automatique.</td>
<td><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/wordAccessEnhancement/wordAccessEnhancement-3.0.nvda-addon">T&#233;l&#233;charger l'extension wordAccessEnhancement-3.0.nvda-addon par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>zEmoticonos <a id="zPod-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2022.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol, Fran&#231;ais et Portugais du Portugal / Br&#233;sil</td>
<td>Affiche toutes les &#233;motic&#244;nes et symboles qui sont prises en charges par NVDA</td>
<td><a href="https://nvda.es/files/get.php?file=zEmoticonos">T&#233;l&#233;charger la version actuelle 0.2 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension zEmoticonos via BlindHelp.github.io <a href="https://blindhelp.github.io/zEmoticonos/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>zPod <a id="zPod-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol, Fran&#231;ais et Portugais du Portugal / Br&#233;sil</td>
<td>Aper&#231;u des fichiers multim&#233;dia rapidement</td>
<td><a href="https://nvda.es/files/get.php?file=zpod">T&#233;l&#233;charger la version actuelle 0.1.5 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension zPod via BlindHelp.github.io <a href="https://blindhelp.github.io/zPod/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="odd">
<td>zRadio <a id="zRadio-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Anglais, Arabe, Espagnol, Fran&#231;ais, Italien et Portugais du Portugal / Br&#233;sil</td>
<td>Lecteur de Radio en ligne pour NVDA</td>
<td><a href="https://nvda.es/files/get.php?file=zradio">T&#233;l&#233;charger la version actuelle 0.5.3 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension zRadio via BlindHelp.github.io <a href="https://blindhelp.github.io/zRadio-pour-NVDA/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
<tr class="even">
<td>zUtilidades <a id="zUtilidades-py3"></a></td>
<td>oui</td>
<td>2019.3 &#224; 2021.1</td>
<td><span lang="es">H&#233;ctor J. Ben&#237;tez Corredera</span></td>
<td>Espagnol, Fran&#231;ais et Portugais du Portugal / Br&#233;sil</td>
<td>Ensemble d'utilit&#233; pour Windows</td>
<td><a href="https://nvda.es/files/get.php?file=zUtilidades">T&#233;l&#233;charger la version actuelle 0.2.3 par ici: [lien externe via le d&#233;p&#244;t de l'auteur sur GitHub]</a></td>
<td></td>
<td>Vous pouvez consulter un article d&#233;di&#233;e &#224; l'extension zUtilidades via BlindHelp.github.io <a href="https://blindhelp.github.io/zUtilidades/">en cliquant ici</a> C'est un gars hispanophone qui a mis cela en place, et la traduction est fait par mes soins afin de la faire conna&#238;tre &#224; des amis francophone. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20compatibles%20avec%20Python3">Retour aux extensions compatibles avec Python3</a></td>
</tr>
</tbody>
</table>
<hr />
<h3 id="vous_pouvez_consulter_la_liste_des_anciennes_extensions">&#224; continuation voici la liste des anciennes extensions compatibles pour NVDA 2019.2.1 (y compris les versions plus anciennes), avec leurs respective description et leurs lien de t&#233;l&#233;chargement:</h3>
<hr />
<div>
<h2 id="anciennes-extensions">Anciennes extensions <a id="anciennes_extensions"></a></h2>
<p>Les extensions ci-dessous ne sont plus activement d&#233;velopp&#233;s ou compatibles avec NVDA 2019.3.</p>
<h1 id="extensions-non-compatibles-avec-nvda-2019.3">Extensions non compatibles avec NVDA 2019.3 <a id="extensions non compatibles avec NVDA 2019.3"></a></h1>
<p><a href="#Avira%20Configuration">Avira Configuration</a> (extension non officielle) <a href="#Balloon%20History">Balloon History</a> (extension non officielle) <a href="#braillenoteDriver">braillenoteDriver</a> (extension non officielle) <a href="#CdBurnerXP">CdBurnerXP</a> (extension non officielle) <a href="#Cloud%20OCR">Cloud OCR</a> (extension non officielle) <a href="#DragonNaturallySpeaking">DragonNaturallySpeaking</a> (extension non officielle) <a href="#Eclipse%20Enhance">Eclipse Enhance</a> (extension non officielle) <a href="#Pilote%20pour%20les%20Terminaux%20Braille%20(Eurobraille)">Pilote pour les Terminaux Braille (Eurobraille)</a> (extension non officielle) <a href="#extendedWinamp">extendedWinamp</a> (extension officielle) <a href="#extendedWinamp-mod-RemyRuiz">extendedWinamp-mod-RemyRuiz</a> (extension non officielle) <a href="#extendedWinamp-2017-03-24">extendedWinamp-2017-03-24</a> (extension non officielle) <a href="#fakeClipboardAnouncement">fakeClipboardAnouncement</a> (extension non officielle) <a href="#FENReader">FENReader</a> (extension non officielle) <a href="#festivalTts-2.0-mod">festivalTts-2.0-mod</a> (extension non officielle) <a href="#File%20Reader">File Reader</a> (extension non officielle) <a href="#Firefox">Firefox</a> (extension non officielle) <a href="#iFree-Skype-Recorder">iFree-Skype-Recorder</a> (extension non officielle) <a href="#Instant%20Translate%204.1-dev-mod-Remy%20Ruiz">Instant Translate 4.1-dev-mod-Remy Ruiz</a> (extension non officielle) <a href="#JumpToLine">JumpToLine</a> (extension non officielle) <a href="#ListeIconesZoneNotification">ListeIconesZoneNotification</a> (extension non officielle) <a href="#modifyLockAnnouncement">modifyLockAnnouncement</a> (extension non officielle) <a href="#noBeepsSpeechMode">noBeepsSpeechMode</a> (extension officielle) <a href="#OBJSounds%20(KevanGC%20Version)">OBJSounds (KevanGC Version)</a> (extension non officielle) <a href="#objsounds">objsounds</a> (extension non officielle) <a href="#OCR">OCR</a> (extension officielle) <a href="#Partial%20Lines">Partial Lines</a> (extension non officielle) <a href="#percentage%20checker">percentage checker</a> (extension non officielle) <a href="#Perky">Perky</a> (extension non officielle) <a href="#QTranslate">QTranslate</a> (extension non officielle) <a href="#reportPasswords">reportPasswords</a> (extension non officielle) <a href="#SaveLog">SaveLog</a> (extension non officielle) <a href="#SpecificSearch%20mod">SpecificSearch mod</a> (extension non officielle) <a href="#Svox-Pico-Synthesizer">Svox-Pico-Synthesizer</a> (extension officielle) <a href="#Tapin_Radio">Tapin_Radio</a> (extension non officielle) <a href="#Thunderbird%20pour%20NVDA,%20compagnon%20de%20Chichi">Thunderbird pour NVDA, compagnon de Chichi</a> (extension non officielle) <a href="#toneMaster">toneMaster</a> (extension officielle) <a href="#windows7magnifier">windows7magnifier</a> (extension non officielle) <a href="#Windows%20Mail">Windows Mail</a> (extension non officielle) <a href="#Windows%20Live%20Mail">Windows Live Mail</a> (extension non officielle) <a href="#Word-Count">Word-Count</a> (extension non officielle)</p>
<hr />
<table style="width:100%;">
<caption>Extensions non compatibles avec NVDA 2019.3</caption>
<colgroup>
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
<col width="10%" />
</colgroup>
<thead>
<tr class="header">
<th>Nom</th>
<th>Compatibilit&#233; avec Python3</th>
<th>Compatible avec les versions de NVDA</th>
<th>Auteur</th>
<th>Langues support&#233;s</th>
<th>Description</th>
<th>Lien de t&#233;l&#233;chargement #1</th>
<th>Lien de t&#233;l&#233;chargement #2</th>
<th>Informations suppl&#233;mentaires</th>
<th>#</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>Avira Configuration <a id="Avira Configuration"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#98;&#100;&#x65;&#108;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#98;&#100;&#x65;&#108;&#32;&#40;&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Cet addon devrait vous permettre d'am&#233;liorer l'accessibilit&#233; des options de configuration du logiciel Avira-Free-Antivirus. Ces options de configuration sont accessibles &#224; partir de l'ic&#244;ne d'Avira figurant dans la zone de notification. Par d&#233;faut, les items de l'arborescence ne sont pas du tout vocalis&#233;s sans la pr&#233;sence de l'addon. Notes: L'addon a &#233;t&#233; cr&#233;&#233; avec la version free d'Avira, il n'a pas &#233;t&#233; test&#233; sur les versions pro. L'addon a &#233;t&#233; test&#233; sous Windows-XP, ainsi que Windows-10. Avec Windows-10, il se peut que l'item du pare-feu provoque un plantage momentan&#233;, dans ce cas, refermer puis r&#233;ouvrir les options pour retrouver un comportement normal.</td>
<td>[t&#233;l&#233;charger <a href="http://cyber25.free.fr/nvda-addons/Avira-configuration-1.0-dev.nvda-addon">version de d&#233;veloppement</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Balloon History <a id="Balloon History"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Historique des info-bulles: Appuyez sur Maj NVDA f11 pour obtenir l'historique des info-bulles. Info-bulles! C'est trop souvent que nous manquons &#224; eux lorsque NVDA parle d'eux et nous avons maintenant avoir un moyen de consulter les info-bulles pr&#233;c&#233;dent. Ce plugin vous indique combien de temp l'info-bulle a &#233;t&#233; cr&#233;&#233;, avec son texte.</td>
<td><a href="https://blindhelp.github.io/balloonHistory.nvda-addon">T&#233;l&#233;charger l'extension balloonHistory.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>braillenoteDriver <a id="braillenoteDriver"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Rui Batista</td>
<td>Anglais, Espagnol, Fran&#231;ais, Italien et Portugais</td>
<td>Pilote pour le Terminal Braille Braillenote Classic. Pilote natif pour le bloc-notes Braille Braillenote Classic.</td>
<td><a href="https://blindhelp.github.io/braillenoteDriver-0.2.nvda-addon">T&#233;l&#233;charger l'extension braillenoteDriver-0.2.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>CdBurnerXP <a id="CdBurnerXP"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Daniel Poiraud</td>
<td>Fran&#231;ais</td>
<td>Dans la version actuelle, CdBurnerXP est suffisamment accessible pour &#234;tre utilis&#233; sans extension, sauf pour le lecteur audio disponible dans la fen&#234;tre des compilations audios. L'extension permet cependant de simplifier son utilisation dans les fen&#234;tres de compilation, gr&#226;ce &#224; des commandes permettant notamment:&#160;d'aller directement &#224; l'arborescence, &#224; la zone de liste du dossier ouvert, &#224; la zone de compilation, au lecteur audio s'il est affich&#233;; d'ajouter directement des dossiers ou fichiers &#224; la compilation, sans passer par des boites de dialogues; de savoir si le lecteur audio est affich&#233;, de l'afficher si besoin, d'agir sur le bouton Marche/Arr&#234;t du lecteur, et de se d&#233;placer dans la piste pendant la lecture. Il est utilisable avec CdBurnerXP 4.5.4, Windows XP &#224; 8.1. Il a &#233;t&#233; test&#233; avec NVDA 2014.3, mais il doit pouvoir fonctionner avec les versions pr&#233;c&#233;dentes ou r&#233;centes.</td>
<td><a href="https://blindhelp.github.io/CdBurnerXP-v1.2.nvda-addon">T&#233;l&#233;charger l'extension CdBurnerXP-v1.2.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Vous pouvez consulter les fiches de Daniel Poiraud concernant CdBurnerXP: <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_1.htm">Graver des CD et DVD avec CdBurnerXP - Fiche #1,</a>, <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_2.htm">Graver une compilation avec CdBurnerXP - Fiche #2.</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>Cloud OCR <a id="Cloud OCR"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x71;&#x2d;&#x63;&#x6f;&#110;&#116;&#x69;&#110;&#x75;&#x75;&#x6d;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#x71;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x43;&#104;&#114;&#x69;&#x73;&#116;&#x6f;&#112;&#104;&#x65;&#114;&#32;&#84;&#x6f;&#116;&#104;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x43;&#104;&#114;&#x69;&#x73;&#116;&#x6f;&#112;&#104;&#x65;&#114;&#32;&#84;&#x6f;&#116;&#104;&#32;&#40;&#x71;&#32;&#x61;&#116;&#32;&#x71;&#x2d;&#x63;&#x6f;&#110;&#116;&#x69;&#110;&#x75;&#x75;&#x6d;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td></td>
<td>Cette extension est utilis&#233; pour effectuer une reconnaissance optique de caract&#232;res en ligne(OCR) de l'objet s&#233;lectionn&#233; &#224; l'aide de l'API ocr.space. Mode d'utilisation: Placez le navigateur d&#8217;objets NVDA dans la fen&#234;tre ou l&#8217;objet que vous souhaitez reconna&#238;tre. Appuyez sur NVDA + Maj + r. Vous entendrez 3 bips ascendants. Lorsque la reconnaissance est termin&#233;e, vous entendrez un bip. Utilisez les commandes de r&#233;vision de texte NVDA pour lire le contenu. Note: Utilisez les touches 7 et 9 du pav&#233; num&#233;rique pour lire par lignes ou leurs &#233;quivalents dans la disposition du clavier portable. Les fl&#232;ches ne fonctionnent pas.</td>
<td><a href="https://github.com/ctoth/cloudOCR/releases/download/v0.1/cloudOCR-0.1.nvda-addon">T&#233;l&#233;charger l'extension cloudOCR-0.1.nvda-addon via la page GitHub de l'auteur:</a></td>
<td></td>
<td><a href="https://github.com/ctoth/cloudOCR">Code source sur GitHub:</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>DragonNaturallySpeaking <a id="DragonNaturallySpeaking"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Extension pour le logiciel de dict&#233;e vocale Dragon Naturally Speaking (version 10, 11 et 12.5).</td>
<td><a href="https://blindhelp.github.io/DragonNaturallySpeaking%201.0.nvda-addon">T&#233;l&#233;charger l'extension DragonNaturallySpeaking 1.0.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Pour une pr&#233;sentation de Dragon, vous pouvez consulter les fiches de Daniel Poiraud ici : <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_dragon/index.htm">les fiches de Daniel Poiraud concernant Dragon</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>Eclipse Enhance <a id="Eclipse Enhance"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Alberto Zanella, Alessandro Albano</td>
<td>Anglais</td>
<td>Cette extension pour NVDA offre un support am&#233;lior&#233; en vocal et en braille tout en travaillant dans l'environnement de d&#233;veloppement Eclipse (signalisation des erreurs et des avertissements dans Eclipse IDE).</td>
<td><a href="https://github-production-release-asset-2e65be.s3.amazonaws.com/92582336/dd6cb708-878a-11e7-9690-853e621e425c?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20181016%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20181016T115358Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=1ba436bb8a50bbb47c6689dd80faa5f92438e9d0b47345c6a1b6d6d8f9b2feae&amp;X-Amz-SignedHeaders=host&amp;actor_id=0&amp;response-content-disposition=attachment%3B%20filename%3DeclipseEnhance-0.2.nvda-addon&amp;response-content-type=application%2Foctet-stream">T&#233;l&#233;charger l'extension eclipseEnhance-0.2.nvda-addon en cliquant ici: [lien externe]</a></td>
<td></td>
<td><a href="https://github.com/albzan/eclipse-nvda">Code Source de l'extension sur GitHub:</a> ; Pour plus d'informations sur son utilisation, consultez la documentation en Anglais se trouvant dans l'extension.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Pilote pour les Terminaux Braille (Eurobraille) <a id="Pilote pour les Terminaux Braille (Eurobraille)"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Eurobraille, Michel Such</td>
<td>Anglais, Espagnol, Fran&#231;ais et Italien</td>
<td>Pilote natif pour les terminaux Braille Eurobraille.</td>
<td><a href="https://blindhelp.github.io/Erbnvda2017-06-20.nvda-addon">T&#233;l&#233;charger l'extension Erbnvda2017-06-20.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td><a href="http://www.eurobraille.fr/">Site Eurobraille FR</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>extendedWinamp <a id="extendedWinamp"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Hrvoje Katic et l'&#233;quipe de NVDA-addon. Note: L'auteur ne assume plu cette extension, seule l'&#233;quipe NVDA-addon.</td>
<td>Fran&#231;ais</td>
<td>Cette extension ajoute des fonctionnalit&#233;s a cette extension applicative pour Winamp d&#233;j&#224; disponible dans NVDA.</td>
<td><a href="https://blindhelp.github.io/extendedWinamp-1.1.nvda-addon">T&#233;l&#233;charger l'extensions extendedWinamp-1.1.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Version originale fait par l'auteur.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>extendedWinamp-mod-RemyRuiz <a id="extendedWinamp-mod-RemyRuiz"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Hrvoje Katic et l'&#233;quipe de NVDA-addon. Note: L'auteur ne assume plu cette extension, seule l'&#233;quipe NVDA-addon.</td>
<td>Fran&#231;ais</td>
<td>Cette extension ajoute des fonctionnalit&#233;s a cette extension applicative pour Winamp d&#233;j&#224; disponible dans NVDA.</td>
<td><a href="https://blindhelp.github.io/extendedWinamp-1.1-mod-RemyRuiz.nvda-addon">T&#233;l&#233;charger l'extension extendedWinamp-1.1-mod-RemyRuiz.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Commentaire par BlindHelp: Cette m&#234;me version est identique &#224; la pr&#233;c&#233;dente sauf qu'il contient une meilleure traduction des messages en fran&#231;ais et en espagnol pour une meilleure compr&#233;hension fait par mes soins. Pour ma part je recommande instamment de t&#233;l&#233;chargez et installer cette version modifier. N'oubliez pas SVP de d&#233;sinstaller au pr&#233;alable l'extension avant d'installer celle-ci, en lieu de faire une actualisation de la pr&#233;sente extension! Cette extension a &#233;t&#233; publi&#233; dans le coffre des extensions pour NVDA</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>extendedWinamp-2017-03-24 <a id="extendedWinamp-2017-03-24"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Hrvoje Katic et l'&#233;quipe de NVDA-addon. Note: L'auteur ne assume plu cette extension, seule l'&#233;quipe NVDA-addon.</td>
<td>Fran&#231;ais</td>
<td>Cette extension ajoute des fonctionnalit&#233;s a cette extension applicative pour Winamp d&#233;j&#224; disponible dans NVDA. Cette extension est compatible avec Winamp 5.8 Build 3660</td>
<td><a href="https://blindhelp.github.io/extendedWinamp-1.1-2017-03-24.nvda-addon">T&#233;l&#233;charger l'extension extendedWinamp-1.1-2017-03-24.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Commentaire par BlindHelp: Avec l'ancienne extension Winamp (extendedWinamp-1.1.nvda-addon version originale de l'auteur), quand on va dans l'&#233;diteur de playlist, la liste des morceaux n'est pas annonc&#233; lorsque vous vous d&#233;placez en haut et en bas de la liste. C'est comme &#231;a depuis qu'une chose dans l'extension utilis&#233;e a &#233;tait modifi&#233; dans NVDA. Maintenant, je vois qu'il n'a pas &#233;t&#233; mis &#224; jour dans la version sur la page des extensions NVDA, voici donc &#224; nouveau l'extension avec le fichier winamp.py mis &#224; jour et l'&#233;diteur de playlist (playlist editor) lequel devrait fonctionner correctement avec celle-ci. Note: il n'y a rien de nouveau &#224; traduire dans cette mise &#224; jour, il suffit d'avoir ajout&#233; quelque chose sur une seule ligne dans le fichier source, rien &#224; voir avec les traductions. Nom de l'extension r&#233;cemment mis &#224; jour: extendedWinamp-1.1-2017-03-24.nvda-addon Le nom du fichier change simplement de nom afin de le diff&#233;rencier del'extension pr&#233;c&#233;dente (en interne c'est le m&#234;me nom et num&#233;ro de version.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>fakeClipboardAnouncement <a id="fakeClipboardAnouncement"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#46;&#x73;&#x6b;';a='&#64;';n='&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;&#32;&#40;&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;&#32;&#x61;&#116;&#32;&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#x73;&#x6b;&#x29;</noscript> et autres contributeurs de NVDA</td>
<td>Anglais, Espagnol, Fran&#231;ais, Italien, slovaque et tch&#232;que</td>
<td>SimulerAnnoncePresse-papiers. L'extension suivante annoncera les commandes clavier Ctrl+a Ctrl+C Ctrl+V Ctrl+x Ctrl+Y Ctrl+Z lorsque ils sont press&#233;s.</td>
<td><a href="https://blindhelp.github.io/fakeClipboardAnouncement.nvda-addon">T&#233;l&#233;charger l'extension fakeClipboardAnouncement.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>S'il vous pla&#238;t Merci de d&#233;sinstaller cette extension si vous avez d&#233;j&#224; install&#233; l'extension &quot;NVDAExtensionGlobalPlugin&quot; car l'extension &quot;fakeClipboardAnouncement&quot; est inclut dans celle-ci. Utilit&#233; de l'extension: Lors de l'utilisation des raccourcis clavier pour utiliser le presse-papiers sont annonc&#233;es par NVDA et est ensuite envoy&#233;e &#224; l'application. Remarque : Sette extension ne fonctionne pas dans la console Windows. Commandes:Control+C: copier le texte ou le fichier s&#233;lectionn&#233; dans le presse-papiers. Le message annoncer par NVDA est: &quot;Copier&quot; Control+X: couper le texte ou le fichier s&#233;lectionn&#233; et le d&#233;placez dans le presse-papiers. Le message annoncer par NVDA est: &quot;Couper&quot; Control+V: pour coller le contenu du presse-papiers. Le message annoncer par NVDA est: &quot;Coller&quot; Control+A: s&#233;lectionner tout le texte ou tous les fichiers. Le message annoncer par NVDA est: &quot;S&#233;lectionner Tout&quot; Control+Z: annuler la derni&#232;re action. Le message annoncer par NVDA est: &quot;Annuler&quot; Control+Y: r&#233;tablir la derni&#232;re action. Le message annoncer par NVDA est: &quot;R&#233;tablir&quot;</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>FENReader <a id="FENReader"></a></td>
<td>non</td>
<td>2018.1.0 &#224; 2019.2.1</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Cette extension traduit une position de jeu d'&#233;checs a partir de un code FEN &#224; l'homme avec une description tr&#232;s conviviales</td>
<td><a href="https://blindhelp.github.io/fenReader-1.0.1.nvda-addon">T&#233;l&#233;charger l'extension fenReader-1.0.1.nvda-addon [via BlindHelp.github.io]</a></td>
<td><a href="https://github.com/javidominguez/FenReader/releases/download/v1.01/fenReader-1.0.1.nvda-addon">T&#233;l&#233;charger l'extension fenReader-1.0.1.nvda-addon[ Via la page GitHub de l'auteur]</a></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>festivalTts-2.0-mod <a id="festivalTts-2.0-mod"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#46;&#x6f;&#114;&#x67;';a='&#64;';n='&#x61;&#100;&#x6d;&#x69;&#110;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#78;&#86;&#32;&#x41;&#x63;&#x63;&#x65;&#x73;&#x73;&#32;&#76;&#x69;&#x6d;&#x69;&#116;&#x65;&#100;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#78;&#86;&#32;&#x41;&#x63;&#x63;&#x65;&#x73;&#x73;&#32;&#76;&#x69;&#x6d;&#x69;&#116;&#x65;&#100;&#32;&#40;&#x61;&#100;&#x6d;&#x69;&#110;&#32;&#x61;&#116;&#32;&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x6f;&#114;&#x67;&#x29;</noscript> et <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#108;&#x67;&#x61;&#32;&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#108;&#x67;&#x61;&#32;&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#32;&#40;&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>dans la version modifier: Anglais, Espagnol, Italien et Tch&#232;que.</td>
<td>Synth&#233;tiseurs Vocaux Festival pour NVDA 2012.2 ou sup&#233;rieur. Le syst&#232;me de synth&#232;se vocale Festival. Contrairement &#224; la version d'origine qui contient l'Anglais puis le Tch&#232;que. Avec la commande, NVDA + Control + S, vous choisissez dans la liste des synth&#233;tiseurs Festival. Avec la commande, NVDA + Control + V, vous trouverez une liste des voix disponibles et leurs langues.</td>
<td><a href="https://blindhelp.github.io/festivalTts-2.0-mod.nvda-addon">T&#233;l&#233;charger l'extension festivalTts-2.0-mod.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td><a href="http://www.nvda-project.org/wiki/ExtraVoices">Source de la page en anglais &#224; consulter pour les Voix Extra pour NVDA!</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>File Reader <a id="File Reader"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Lit les fichiers sans &#234;tre vu. Lit le fichier avec NVDA sans &#234;tre vu. Utilisez le menu lecteur de documents pour commencer. Il vous permet de lire avec les m&#233;moires tampons de texte invisible. Il y a un menu ajout&#233; &#224; la barre de t&#226;ches syst&#232;me et il vous annonce toutes les touches de raccourci que vous avez besoin de savoir.</td>
<td><a href="https://blindhelp.github.io/File%20Reader.nvda-addon">T&#233;l&#233;charger l'extension File Reader.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Firefox <a id="Firefox"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#112;&#x61;&#x75;&#108;&#98;&#x65;&#114;&#x31;&#x39;&#32;&#x61;&#116;&#32;&#108;&#x61;&#112;&#x6f;&#x73;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Pour ceux et celles qui utilisent&#160; Firefox avec NVDA, voici une extension qui compl&#232;te celle embarqu&#233;e dans NVDA et qui apporte: l'annonce du nom suivi de la position&#160; de l'onglet (si plusieurs onglets sont ouverts) la commande clavier &quot;control+=&quot; pour aller &#224; la liste des onglets, la lecture correcte de la barre d'&#233;tat dynamiquement ou avec la commande clavier &quot;NVDA+Fin&quot;, la possibilit&#233; de d&#233;sactiver la lecture dynamique de cette barre d'&#233;tat si elle est trop g&#234;nante.</td>
<td><a href="https://blindhelp.github.io/firefox%20v1.2.nvda-addon">T&#233;l&#233;charger l'extension firefox v1.2.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>iFree-Skype-Recorder <a id="iFree-Skype-Recorder"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#98;&#100;&#x65;&#108;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#98;&#100;&#x65;&#108;&#32;&#40;&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais et Arabe</td>
<td>Cette extension am&#233;liore l'accessibilit&#233; du logiciel iFree Skype Recorder avec NVDA</td>
<td><a href="http://cyber25.free.fr/nvda-addons/iFree-Skype-Recorder-2.0.nvda-addon">T&#233;l&#233;charger l'extension iFree-Skype-Recorder-2.0.nvda-addon par ici: [lien externe]</a></td>
<td></td>
<td>Voici le lien direct de t&#233;l&#233;chargement de la derni&#232;re version du logiciel <a href="http://www.ifree-recorder.com/iFreeRecorder.exe">iFreeRecorder</a>, <a href="http://www.ifree-recorder.com/">iFreeRecorder page d'accueil en anglais</a>; Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Instant Translate 4.1-dev-mod-Remy Ruiz <a id="Instant Translate 4.1-dev-mod-Remy Ruiz"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#112;&#114;&#x6f;&#x67;&#x67;&#x65;&#114;&#46;&#x73;&#x75;';a='&#64;';n='&#108;&#x65;&#120;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#108;&#x65;&#120;&#x79;&#32;&#x53;&#x61;&#100;&#x6f;&#118;&#x6f;&#x79;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#108;&#x65;&#120;&#x79;&#32;&#x53;&#x61;&#100;&#x6f;&#118;&#x6f;&#x79;&#32;&#40;&#108;&#x65;&#120;&#32;&#x61;&#116;&#32;&#112;&#114;&#x6f;&#x67;&#x67;&#x65;&#114;&#32;&#100;&#x6f;&#116;&#32;&#x73;&#x75;&#x29;</noscript>, <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#98;&#x65;&#x71;&#x61;&#112;&#114;&#x6f;&#x67;&#x67;&#x65;&#114;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#66;&#x65;&#x71;&#x61;&#32;&#x47;&#x6f;&#122;&#x61;&#108;&#x69;&#x73;&#104;&#118;&#x69;&#108;&#x69;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#66;&#x65;&#x71;&#x61;&#32;&#x47;&#x6f;&#122;&#x61;&#108;&#x69;&#x73;&#104;&#118;&#x69;&#108;&#x69;&#32;&#40;&#98;&#x65;&#x71;&#x61;&#112;&#114;&#x6f;&#x67;&#x67;&#x65;&#114;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript>, <script type="text/javascript">
<!--
h='&#x73;&#114;&#x63;&#46;&#x67;&#110;&#x6f;&#x6d;&#x65;&#46;&#x6f;&#114;&#x67;';a='&#64;';n='&#x6d;&#104;&#x61;&#x6d;&#x65;&#x65;&#100;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4d;&#x65;&#x73;&#x61;&#114;&#32;&#72;&#x61;&#x6d;&#x65;&#x65;&#100;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4d;&#x65;&#x73;&#x61;&#114;&#32;&#72;&#x61;&#x6d;&#x65;&#x65;&#100;&#32;&#40;&#x6d;&#104;&#x61;&#x6d;&#x65;&#x65;&#100;&#32;&#x61;&#116;&#32;&#x73;&#114;&#x63;&#32;&#100;&#x6f;&#116;&#32;&#x67;&#110;&#x6f;&#x6d;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#x6f;&#114;&#x67;&#x29;</noscript>, <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#46;&#98;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#108;&#98;&#x65;&#114;&#116;&#x6f;&#32;&#66;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#108;&#98;&#x65;&#114;&#116;&#x6f;&#32;&#66;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;&#32;&#40;&#x61;&#46;&#98;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript> et d'autres contributeurs</td>
<td>Fran&#231;ais</td>
<td>Cette extension permet de traduire le texte s&#233;lectionn&#233; et ou le texte copi&#233; dans le presse-papiers d'une langue &#224; une autre. Il utilise un service externe.</td>
<td><a href="https://blindhelp.github.io/instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon">T&#233;l&#233;charger l'extension instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>c'est une version modifi&#233; par mes soins, il inclus la derni&#232;re mise &#224; jour du fichier nvda.po puis la traduction du fichier manifest.ini en fran&#231;ais. Ce n'est pas inclus dans le dossier de la langue en fran&#231;ais dans la version Instant Translate 4.1-dev. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>JumpToLine <a id="JumpToLine"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#x6f;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript> (modifi&#233; par <script type="text/javascript">
<!--
h='';a='&#64;';n='';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#x75;&#108;&#32;&#100;&#x65;&#32;&#108;&#x61;&#32;&#108;&#x69;&#x73;&#116;&#x65;&#32;&#x73;&#x63;&#114;&#x69;&#112;&#116;&#78;&#86;&#68;&#x41;&#32;&#40;&#32;&#x61;&#116;&#32;&#x29;</noscript>paulber19@laposte.net)</td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Acc&#233;der &#224; une ligne d'un texte avec NVDA+Maj+j. Le raccourci &quot;NVDA+Maj+j&quot; vous permet d'acc&#233;der une ligne particuli&#232;re du document par son num&#233;ro de ligne. Une boite de dialogue vous demande d'entrer le num&#233;ro de cette ligne, en l'initialisant par d&#233;ffaut avec le num&#233;ro de la ligne courante. Comme son nom l'indique, il vous permet de sauter &#224; n'importe quelle ligne dans n'importe quel texte, y compris les sites Web. Raccourci clavier: NVDA+Maj+J</td>
<td><a href="https://blindhelp.github.io/jumpToLine-v1.2.nvda-addon">T&#233;l&#233;charger l'extension jumpToLine-v1.2.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>ListeIconesZoneNotification <a id="ListeIconesZoneNotification"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Yannick Mayot, avec la participation de Daniel Poiraud</td>
<td>Fran&#231;ais</td>
<td>Liste des icones de la zone de notification. Affiche la liste des icones dans la zone de notification avec NVDA+F11</td>
<td><a href="https://blindhelp.github.io/ListeIconesZoneNotification.nvda-addon">T&#233;l&#233;charger l'extension ListeIconesZoneNotification.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>modifyLockAnnouncement <a id="modifyLockAnnouncement"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#98;&#100;&#x65;&#108;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#98;&#100;&#x65;&#108;&#32;&#40;&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Fran&#231;ais et Espagnol</td>
<td>Changement de l'annonce des touches de verrouillage. Cette extension permet d'offrir la possibilit&#233; de personnaliser l'annonce des touches verrouillage num&#233;rique, verrouillage majuscule, ainsi que la touche arr&#234;t.</td>
<td><a href="http://cyber25.free.fr/nvda-addons/modifyLockAnnouncement.nvda-addon">T&#233;l&#233;charger l'extension modifyLockAnnouncement.nvda-addon par ici: [lien externe]</a></td>
<td></td>
<td>Pour plus d'informations vous pouvez consulter la documentation pour la version 1.0 depuis le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>noBeepsSpeechMode <a id="noBeepsSpeechMode"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#46;&#98;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#108;&#98;&#x65;&#114;&#116;&#x6f;&#32;&#66;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#108;&#98;&#x65;&#114;&#116;&#x6f;&#32;&#66;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;&#32;&#40;&#x61;&#46;&#98;&#x75;&#102;&#102;&#x6f;&#108;&#x69;&#110;&#x6f;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Cette extension supprime les bips dans le mode parole quand on presse NVDA+s. Vous n'avez le choix qu'entre d&#233;sactiv&#233; et activ&#233;.</td>
<td><a href="https://addons.nvda-project.org/files/get.php?file=nb">T&#233;l&#233;charger la version stable via le site comunautaire des extensions NVDA</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>OBJSounds (KevanGC Version) <a id="OBJSounds (KevanGC Version)"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Tyler Spivey</td>
<td></td>
<td>Cette extension annonce les types d'objets &#224; travers diff&#233;rents sons. C'est-&#224;-dire que lorsque nous nous positionnons, par exemple, sur une case &#224; cocher, cela &#233;mettra un son et lorsque nous avons le focus sur une liste d&#233;roulante, ce sera un autre son et ainsi de suite. La version modifi&#233;e par KevanGC ajoute le raccourci NVDA + alt + O pour activer ou d&#233;sactiver les sons et r&#233;duire leur volume. Les sons peuvent &#234;tre modifi&#233;s en rempla&#231;ant celui qui correspond dans le dossier: <code>globalPlugins&gt;objsounds&gt;objdata</code>, en consid&#233;rant comme racine le dossier o&#249; est install&#233; l'extension (g&#233;n&#233;ralement, ex&#233;cuter Windows+r puis taper: <code>%appdata%</code>, NVDA, addons, ObjSounds, dans les copies portables, la premi&#232;re &#233;tape aie remplac&#233;e en explorant le r&#233;pertoire nomm&#233; userConfig situ&#233; dans le r&#233;pertoire de votre copie portable de NVDA. Obj Sounds c'est la m&#234;me version mais modifier par KevanGC</td>
<td><a href="https://blindhelp.github.io/OBJSounds%20%28KevanGC%20Version%29.nvda-addon">T&#233;l&#233;charger l'extension OBJSounds (KevanGC Version).nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Commentaire par BlindHelp: Il peut &#233;galement &#234;tre personnalis&#233; sans trop de difficult&#233;, ont peut mettre dans le dossiers correspondants les fichiers sons avec leurs noms et le format appropri&#233;. Sette extension contrairement &#224; la version originale, a une fa&#231;on de Activer et d&#233;sactiver les sons, avec NVDA + alt + o. Ce que je n'aime pas c'est qu'ils ont mis la touche alt; lorsque la touche alt est enfonc&#233;e, le menu s'ouvre, mais malgr&#233; cela, ce raccourci peut &#234;tre utilis&#233;. Je le pr&#233;f&#232;re aussi parce que le son des oiseaux est plus faible et moins envahissant. Par ailleurs, je pense qu'il est &#233;gal &#224; l'extension de l'auteur original. J'esp&#232;re qu'ells servent.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>objsounds <a id="objsounds"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Tyler Spivey</td>
<td></td>
<td>Cette extension annonce les types d'objets &#224; travers diff&#233;rents sons. C'est-&#224;-dire que lorsque nous nous positionnons, par exemple, sur une case &#224; cocher, cela &#233;mettra un son et lorsque nous avons le focus sur une liste d&#233;roulante, ce sera un autre son et ainsi de suite. Les sons peuvent &#234;tre modifi&#233;s en rempla&#231;ant celui qui correspond dans le dossier: <code>globalPlugins&gt;objsounds&gt;objdata</code>, en consid&#233;rant comme racine le dossier o&#249; est install&#233; l'extension (g&#233;n&#233;ralement, ex&#233;cuter Windows+r puis taper: <code>%appdata%</code>, NVDA, addons, ObjSounds, dans les copies portables, la premi&#232;re &#233;tape aie remplac&#233;e en explorant le r&#233;pertoire nomm&#233; userConfig situ&#233; dans le r&#233;pertoire de votre copie portable de NVDA. Obj Sounds c'est la version original fait par l'auteur: Tyler Spivey</td>
<td><a href="https://blindhelp.github.io/objsounds.nvda-addon">T&#233;l&#233;charger l'extension objsounds.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Commentaire par BlindHelp: il me semble sauf erreur de ma part que Le son est plus fort que la version modifier par KevanGC J'esp&#232;re qu'elles servent.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>OCR <a id="OCR"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>NV Access Limited et autres colaborateurs.</td>
<td>Fran&#231;ais</td>
<td>Effectue une reconnaissance de caract&#232;res (OCR) pour extraire le texte d'un objet inaccessible. Utilise le moteur d'OCR Tesseract. Pour ex&#233;cuter l'OCR, placez-vous sur l'objet et appuyez sur NVDA+r. Vous pouvez d&#233;finir la langue de l'OCR en allant dans le menu Pr&#233;f&#233;rences du menu NVDA et s&#233;lectionnez R&#233;glage OCR.</td>
<td><a href="https://blindhelp.github.io/ocr_0.20120529.01.nvda-addon">T&#233;l&#233;charger l'extension ocr_0.20120529.01.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Partial Lines <a id="Partial Lines"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#112;&#x63;&#100;&#x65;&#x73;&#x6b;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#116;&#x73;&#112;&#x69;&#118;&#x65;&#x79;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#84;&#x79;&#108;&#x65;&#114;&#32;&#x53;&#112;&#x69;&#118;&#x65;&#x79;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#84;&#x79;&#108;&#x65;&#114;&#32;&#x53;&#112;&#x69;&#118;&#x65;&#x79;&#32;&#40;&#116;&#x73;&#112;&#x69;&#118;&#x65;&#x79;&#32;&#x61;&#116;&#32;&#112;&#x63;&#100;&#x65;&#x73;&#x6b;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Anglais</td>
<td>Change les fl&#232;ches haut/bas pour lire avant ou apr&#232;s le curseur</td>
<td><a href="https://github.com/tspivey/partialLines/releases/download/v0.1/partialLines-0.1.nvda-addon">T&#233;l&#233;charger l'extension partialLines-0.1.nvda-addon via la page github de l'auteur en cliquant ici:</a></td>
<td></td>
<td>Cette extension a plusieurs op&#233;rations traitant les lignes: NVDA+maj+effacement change les fl&#232;ches haut/bas pour lire &#224; partir du d&#233;but de la ligne vers le curseur, &#224; partir du curseur jusqu'&#224; la fin de la ligne, ou toute la ligne. NVDA+maj+page pr&#233;c&#233;dente lit depuis le d&#233;but de la ligne jusqu'au curseur. NVDA+maj+page suivante lit &#224; partir du curseur jusqu'&#224; la fin de la ligne.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>percentage checker <a id="percentage checker"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x67;&#x6f;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x67;&#x6f;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Allemand, Anglais, Espagnol, Fran&#231;ais</td>
<td>Lire le pourcentage de texte actuel &#224; l'aide du raccourci CTRL+NVDA+P</td>
<td><a href="https://blindhelp.github.io/percentage%20checker.nvda-addon">T&#233;l&#233;charger l'extension percentage checker.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Perky <a id="Perky"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;&#32;&#40;&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Fran&#231;ais et Espagnol</td>
<td>Cette extension permet de conna&#238;tre les points en braille correspondant &#224; un caract&#232;re donn&#233; dans les documents de Perky Duck.</td>
<td><a href="https://blindhelp.github.io/perky-1.0.nvda-addon">T&#233;l&#233;charger l'extension perky-1.0.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td><a href="http://www.duxburysystems.org/downloads/perky1102.msi">T&#233;l&#233;charger le programme gratuit Perky Duck par ici: [lien externe]</a> Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>QTranslate <a id="QTranslate"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x63;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x63;&#32;&#40;&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td></td>
<td>Extension applicative pour QTranslate. Am&#233;liore l'accessibilit&#233; de l'application QTranslate .</td>
<td><a href="https://blindhelp.github.io/QTranslate-1.0-dev.nvda-addon">T&#233;l&#233;charger l'extension QTranslate-1.0-dev.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td><a href="https://qtranslate1.appspot.com/QTranslate.6.7.1.exe">T&#233;l&#233;charger le programme QTranslate.6.7.1 version instalable par ici: [archive exe]</a>, <a href="http://qtranslate2.appspot.com/QTranslate.6.7.1.zip">T&#233;l&#233;charger le programme QTranslate.6.7.1 version portable par ici: [archive zip]</a>. Notes par BlindHelp: Vous verrez que son utilisation est intuitive: Il y a une zone d'&#233;dition o&#249; le texte que nous voulons traduire devra &#234;tre plac&#233;, et dans la suivante bo&#238;te de dialogue la traduction appara&#238;tra, une fois que nous avons cliqu&#233; sur le bouton&quot;Traduire&quot;. Les langues source et destination peuvent &#234;tre facilement chang&#233;es dans les options dans les zones de listes d&#233;roulantes. Par d&#233;faut il utilise le Service de Traduction de Google. Remarque&#160;: il pourrait y avoir quelques probl&#232;mes de qualit&#233; en raison du service de traduction, lorsque vous faites Ctrl+Tab par inadvertance, car vous changer le Service de Traduction ; pour y rem&#233;dier faire &#224; nouveau Ctrl+Tab plusieurs fois pour revenir au Service de Traduction de Google.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>reportPasswords <a id="reportPasswords"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;&#32;&#40;&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Voici une extension tr&#232;s pratique qui permet &#224; nvda de vocaliser le mot de passe lors de la r&#233;daction. On peut aussi activer ou d&#233;sactiver cette fonctionnalit&#233; selon le besoin, avec le raccourci : NVDA+Contr&#244;le+Maj+p. Remarque : La commande ci-dessus peut &#234;tre chang&#233;e dans le Menu NVDA, sous-menu Pr&#233;f&#233;rences, dans le dialogue Gestes de commandes, cat&#233;gorie Parole. Vous pourrez configurer cette extension en allant dans le menu &quot;Pr&#233;f&#233;rences/Param&#232;tres ReportPasswords&quot;, pour cocher ou d&#233;cocher la case &#224; cocher : Report passwords. Ensuite faire tab, puis faire entr&#233;e sur le bouton : OK. Si vous souhaitez conserver cette case &#224; cocher active, vous devez cliquer sur l'&#233;l&#233;ment : Sauvegarder la configuration en allant dans le menu NVDA. Ces changements seront sauvegard&#233;s dans le fichier nvda.ini. Cette case &#224; cocher n&#8217;est pas coch&#233;e par d&#233;faut.</td>
<td><a href="https://blindhelp.github.io/reportPasswords-1.3-dev.nvda-addon">T&#233;l&#233;charger l'extension reportPasswords-1.3-dev.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>La traduction en Fran&#231;ais et espagnol n&#8217;est pas incluse dans l'extension d'origine fait par l'auteur. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>SaveLog <a id="SaveLog"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#78;&#x6f;&#x65;&#108;&#x69;&#x61;&#32;&#82;&#x75;&#x69;&#122;&#32;&#x4d;&#x61;&#114;&#116;&#xed;&#110;&#x65;&#122;&#32;&#40;&#110;&#114;&#x6d;&#x31;&#x39;&#x37;&#x37;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol, Fran&#231;ais et Italien</td>
<td>Extension pour g&#233;rer le fichier journal (log); pr&#233;c&#233;dent et actuel de NVDA.</td>
<td><a href="https://blindhelp.github.io/savelog-4.0.nvda-addon">T&#233;l&#233;charger l'extension SaveLog-4.0.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>La traduction en Fran&#231;ais et espagnol n&#8217;est pas incluse dans l'extension d'origine fait par l'auteur. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>SpecificSearch mod <a id="SpecificSearch mod"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#xf3;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#xf3;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>Extension pour rechercher le texte que vous souhaitez rechercher dans des documents virtuels sp&#233;cifiques.</td>
<td><a href="https://blindhelp.github.io/SpecificSearch%20mod.nvda-addon">T&#233;l&#233;charger l'extension SpecificSearch mod.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Maintenant l'extension Specific Search mod utilise les touches: point et deux-pouints sur des sites Web avec aucune bo&#238;te de dialogue. Une modif pour l'extension d&#233;velopp&#233; par Noelia Ruiz Mart&#237;nez, avec quelques changements fait par Oriol G&#243;mez: il s'agit d'une extension pour rechercher du texte selon le titre de la page. Les modifications fait par Oriol G&#243;mez sont: Remplacement des raccourcis clavier pour (point et deux-points) pour le rendre plus facile &#224; utiliser comme les touches de navigation rapide, avec des filtres dynamiques pour s'assurer que vous &#234;tes en mode de navigation. NVDA ne remplace pas le dernier texte rechercher pour une recherche sp&#233;cifique. L'autre extension fait cela, et je ne vois pas pourquoi. Il est plus commode d'avoir NVDA Rechercher son propre texte et d'avoir une recherche sp&#233;cifique afin de rechercher ce qu'il veut sans remplacer le texte recherch&#233; de NVDA. Enlev&#233; le texte %s non trouv&#233; de message dans la bo&#238;te de dialogue et la remplac&#233; pour un appel au synth&#233;tiseur. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>Svox-Pico-Synthesizer <a id="Svox-Pico-Synthesizer"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Aleksey Sadovoy, Michael Curran</td>
<td></td>
<td>Synth&#233;tiseur Svox Pico. L'extension Svox-Pico installe le synth&#233;tiseur Open-Source Svox Pico pour NVDA.</td>
<td><a href="https://blindhelp.github.io/Svox-Pico-Synthesizer.nvda-addon">T&#233;l&#233;charger l'extension Svox-Pico-Synthesizer.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le synth&#233;tiseur.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Tapin_Radio <a id="Tapin_Radio"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Jiri Holzinger (modifi&#233; par Daniel Poiraud)</td>
<td>Il prend en compte la langue du programme TapinRadio. Lorsqu'il maximise la fen&#234;tre du programme. Cette action est vocalis&#233;e par NVDA en utilisant la localization de l'extension Tapin Radio Information Announcer (si disponnible).</td>
<td>Une extension qui montre les informations de ce qui se joue et vous permet de maximiser la fen&#234;tre du programme avec la commande NVDA+maj+t. Raccourci: Une simple frappe de NVDA+Maj+T annonce la station s&#233;lectionn&#233;e, le temps &#233;coul&#233; et la quantit&#233; de donn&#233;es utilis&#233;es pour la station. Ces informations sont copi&#233;es dans le presse-papier. Une double frappe de NVDA+Maj+T maximise la fen&#234;tre du programme. Cette action est vocalis&#233;e. Avec une double frappe, il y a bien s&#251;r copie des infos dans le presse-papier.</td>
<td><a href="https://github.com/BlindHelp/TapinRadioStatusAnnouncer/releases/download/2.0/TapinRadioStatusAnnouncer-2.0.nvda-addon">T&#233;l&#233;charger l'extension TapinRadioStatusAnnouncer-2.0.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Remarque par BlindHelp: L'extension TapinRadio utilise la m&#234;me commande que l'extension Instant Translate par d&#233;faut. Note : La commande ci-dessus peut &#234;tre chang&#233; depuis le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de commandes, dans la cat&#233;gorie Configuration.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>Thunderbird pour NVDA, compagnon de Chichi <a id="Thunderbird pour NVDA, compagnon de Chichi"></a></td>
<td>non</td>
<td>2017.3 &#224; 2019.1.1</td>
<td>Yannick</td>
<td>Fran&#231;ais</td>
<td>Thunderbird pour NVDA, compagnon de Chichi. &#192; partir de cette version 3.0, cette extension est maintenant compatible avec Thunderbird 52 et sup&#233;rieures .</td>
<td><a href="http://www.rptools.org/?p=8552">T&#233;l&#233;charger l'extension Thunderbird pour NVDA version 3.0.1 du 14 juin 2019 :</a></td>
<td></td>
<td>Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions. <a href="http://www.rptools.org/Outils-DV/NVDA-Thunderbird.html">Pour plusd'informations consulter la pr&#233;sentation de l'extension Thunderbird pour NVDA, compagnon de Chichi en cliquant ici:</a> Derni&#232;re mise &#224; jour le 14 Juin 2019. <a href="http://www.rptools.org/?p=8561">T&#233;l&#233;charger Chichi&#160; version 2019 05 22 :</a> Derni&#232;re modification: 22/05/2019. Cette version de Chichi est maintenant installable sur les version 50 et ult&#233;rieures de Thunderbird. Ceci sera utile pour les utilisateurs de Thunderbird 52 ESR . <a href="http://www.rptools.org/Outils-DV/chichi-thunderbird.html">Pour plusd'informations consulter la pr&#233;sentation de Chichi : extension d'accessibilit&#233; et d'efficacit&#233; pour Mozilla Thunderbird en cliquant ici</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>toneMaster <a id="toneMaster"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;&#32;&#40;&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Fran&#231;ais</td>
<td>Jouer des m&#233;lodies musicales cr&#233;&#233; &#224; partir des fichiers de donn&#233;es de tonalit&#233; en utilisant les bips de NVDA.</td>
<td><a href="https://blindhelp.github.io/toneMaster-1.3.nvda-addon">T&#233;l&#233;charger l'extension toneMaster-1.3.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td>Pour commencer, allez dans le menu NVDA-&gt;Outils-&gt;Tone Master. Appuyer sur NVDA+Alt+T pour jouer le fichier de donn&#233;es de tonalit&#233; charg&#233;. Appuyer sur NVDA+Alt+Maj+T pour arr&#234;ter la lecture. Pour d'autres instructions, appuyez sur le bouton Aide de cette extension, dans le Gestionnaire d'Extensions.</td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>windows7magnifier <a id="windows7magnifier"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#100;&#x6f;&#x6d;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;&#32;&#40;&#100;&#x6f;&#x6d;&#32;&#x61;&#116;&#32;&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></td>
<td>Anglais, Fran&#231;ais, Espagnol et N&#233;palais</td>
<td>Loupe de Windows 7. Incorporation de la loupe de Windows 7 &#224; l'interface graphique de NVDA. Cette extension int&#232;gre des options de configurati&#243;n a l'interface graphique standard de NVDA. Pour acc&#233;der, allez dans Pr&#233;f&#233;rences, Param&#232;tres de la loupe, dans le menu de NVDA. Raccourci clavier: NVDA- + MAJ + g: activer ou d&#233;sactiver la loupe. NVDA- + i: changer l'inversion des couleurs. NVDA- + signe plus: approcher. NVDA + signe moins: &#233;loigner.</td>
<td><a href="https://blindhelp.github.io/windows7magnifier-1.1.1.nvda-addon">T&#233;l&#233;charger l'extension windows7magnifier-1.1.1.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Windows Mail <a id="Windows Mail"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Daniel Poiraud</td>
<td>Fran&#231;ais</td>
<td>L'extension propos&#233;e est utilisable avec Windows 7 &#224; 10, NVDA 2014.4 et suivants.</td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/windowsmail_v2.3.nvda-addon">T&#233;l&#233;charger l'extension windowsmail_v2.3.nvda-addon par ici:</a></td>
<td></td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A2">Consulter la fiche d&#233;di&#233; aux extensions pour Windows Mail sur le site AVH Angoul&#234;me:</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="odd">
<td>Windows Live Mail <a id="Windows Live Mail"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td>Daniel Poiraud</td>
<td>Fran&#231;ais</td>
<td>L'extension propos&#233; est utilisable avec Windows 7 &#224; 10, Windows Live Mail 2009 &#224; 2012, NVDA 2015.4 et suivants.</td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/wlmail_v2.3.nvda-addon">T&#233;l&#233;charger l'extension wlmail_v2.3.nvda-addon par ici:</a></td>
<td></td>
<td><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A1">Consulter la fiche d&#233;di&#233; &#224; l'extension pour Windows Live Mail sur le site AVH Angoul&#234;me:</a></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
<tr class="even">
<td>Word-Count <a id="Word-Count"></a></td>
<td>non</td>
<td>ant&#233;rieures &#224; 2019.3</td>
<td><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#xf3;&#x6d;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x4f;&#114;&#x69;&#x6f;&#108;&#32;&#x47;&#xf3;&#x6d;&#x65;&#122;&#32;&#40;&#x6f;&#x67;&#x6f;&#x6d;&#x65;&#122;&#46;&#x73;&#x39;&#50;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript></td>
<td>Anglais, Espagnol et Fran&#231;ais</td>
<td>comptage de mots lorsque vous s&#233;lectionnez du texte et vous appuyez sur NVDA + maj + W</td>
<td><a href="https://blindhelp.github.io/word-count.nvda-addon">T&#233;l&#233;charger l'extension word-count.nvda-addon [via BlindHelp.github.io]</a></td>
<td></td>
<td></td>
<td><a href="#extensions%20non%20compatibles%20avec%20NVDA%202019.3">Retour aux extensions non compatibles avec NVDA 2019.3</a></td>
</tr>
</tbody>
</table>
<hr />
<p><a href="https://addons.nvda-project.org/addons/nvdapy3.fr.html">En cliquant ici</a>, vous pouvez consulter la liste officielle des extensions compatibles avec Python 3. Par exemple vous trouver l'extension extendedWinamp, qui est r&#233;pertori&#233; maintenant comme compatible.</p>
<hr />
<p>Je vous souhaite a vous tous un bon t&#233;l&#233;chargement!<br />
Merci de me faire savoir S'il vous plait s'il y a un lien bris&#233; ou une extension non mis &#224; jour.<br />
Et si vous souhaitez que une extension figure ici! faites-le savoire SVP!!!pour cela envoyez-moi un courriel en cliquant sur l'adresse qui se trouve en bas:<br />
<script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;&#32;&#40;&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Merci par avance pour votre contribution!!!<br />
@+<br />
BlindHelp!</p>
<hr />
<h4 id="references_des_liens_externes">R&#233;f&#233;rences des liens externes:</h4>
<hr />
<div>
<p>Voici quelques liens externes ou trouver des extensions que peut-&#234;tre ils ne sont pas list&#233; ici:</p>
</div>
<p><a href="https://www.nvda-fr.org/addons.php">Page de t&#233;l&#233;chargement pour les extensions dans le site francophone</a> <a href="http://www.cecitek.fr/index.php?module=nvda&amp;action=index">Page de t&#233;l&#233;chargement pour les extensions dans le site CECITEK</a> de notre ami Yannick PLASSIARD <a href="https://www.progaccess33.net/cat.php?id=10">Page de t&#233;l&#233;chargement pour les extensions sur le site ProgAccess</a> de notre ami Corentin <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Visitez la page d&#233;di&#233; aux extensions dans le site AVH Angoul&#234;me</a> <a href="http://addons.nvda-project.org/">Page principal du site comunautaire des extensions NVDA pour t&#233;l&#233;charger les AddOns pour NVDA</a> <a href="http://jeff.tdrealms.com/index.php?page=NVDA">Page de Jeff en anglais qui rassemble aussi des extensions &#224; t&#233;l&#233;charger pour NVDA</a></p>
<hr />
<h1 id="sp&#233;cial-merci-&#224;">Sp&#233;cial Merci &#224; :</h1>
<p>A mes amis Patrick Zajda, Michel Such et Bachir Benanou ;<br />
Merci de m'avoir donner leurs conseils bien averti de la fa&#231;on de Comment traduire une extension pour NVDA<br />
et Merci d'avoir rep&#233;r&#233; tous les points faibles dans la traductions de ceux-ci en fran&#231;ais y compris leurs pages Web d&#233;dier qui se trouve sur le site comunautaire des extensions NVDA... et de les avoir corriger ...<br />
Encore un grand Merci &#224; eux !<br />
Voila un clin d'&#339;il !</p>
<hr />
<p>Je vous remercie pour votre visite dans le coffre des Extensions pour NVDA!<br />
Et si vous le souhaitez vous pouvez laisser votre commentaire! <a href="http://blindhelp.blogspot.fr/2013/02/le-coffre-des-modules-complementaires.html">Pour cela cliquez par ici!</a><br />
Et si vous le souhaitez vous pouvez aussi visiter le blog de BlindHelp!<br />
<a href="http://blindhelp.blogspot.fr/">Pour cela cliquez par la!</a><br />
ET...<br />
<a href="https://blindhelp.github.io/">Voici le nouvel espace de BlindHelp via GitHub que est aussi le votre!</a><br />
Sur ce, je vous dit &#224; tr&#232;s bient&#244;t, donc!!!<br />
@+<br />
BlindHelp !!!</p>
<hr />
</div>
<footer>
Derni&#232;re mise &#224; jour le Samedi 4 D&#233;cembre 2021
</footer>
</div>
</body>
</html>
