<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title>Le coffre des Modules Compl&#233;mentaires pour NVDA</title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="../style.css" type="text/css" />
</head>
<body>
<div id="header">
<h1 class="title">Le coffre des Modules Compl&#233;mentaires pour NVDA</h1>
</div>
<audio autoplay="autoplay" preload="auto">
<source src="https://cld.pt/dl/download/1f9de1c1-f54d-4a5d-ba24-930685023717/sweep.wav?download=true" type="audio/wav" />
</audio>
<p>Derni&#232;re mise &#224; jour le 22.08.2016.</p>
<hr />
<h1 id="le-coffre-des-modules-compl&#233;mentaires-pour-nvda">Le coffre des Modules Compl&#233;mentaires pour NVDA</h1>
<p><br />
Coucou mes amis du blog de BlindHelp!!!<br />
Bienvenue sur le coffre des Modules Compl&#233;mentaires pour NVDA!!!</p>
<p>Ici vous retrouvez la plus part des modules compl&#233;mentaires regrouper par mes soins pour NVDA!!!</p>
<div>
<a href="#vous_pouvez_consulter_la_liste">Vous pouvez consultez la liste</a> puis les t&#233;l&#233;chargez! En tout cas je vous donne les plus utile pour moi!!! Il se peut que certain modules compl&#233;mentaires ils ne sont pas list&#233;; peut-&#234;tre parsque j'ai jug&#233; qu'ils ne sont pas tr&#232;s utile; ou parsque je n'avez aucunne id&#233;e de leurs existences!!! Donc si vous ne trouvez pas votre module complementaire ad&#233;quat list&#233; plus bas, mille merci de consulter la section
<div>
<p><a href="#references_des_liens_externes">R&#233;f&#233;rences des liens externes</a>, afin de trouvez votre bonheur!!! Et si vous souhaitez que un module compl&#233;mentaire figure ici! faites-le savoire SVP!!!pour cela envoyez-moi un courriel en cliquant sur l'adresse qui se trouve en bas: <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;&#32;&#40;&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Merci par avance pour votre contribution!!!<br />
N'oubliez pas surtout avant d'installer un module compl&#233;mentaire, que vous devez d'abord installer le lecteur d'&#233;cran en opensource nomm&#233;: NVDA.</p>
<p><br />
Vous pouvez obtenir la derni&#232;re version de NVDA <a href="http://www.nvda-project.org/">depuis la page du site officiel en anglais d&#233;dier &#224; le lecteur d'&#233;cran en opensources NVDA:</a><br />
et une fois t&#233;l&#233;chargez le fichier, validez sur le .exe puis suivre le programme d'installation qui est enti&#232;rement vocaliser.</p>
<p><br />
Vous pouvez aussi t&#233;l&#233;charger la derni&#232;re version de NVDA <a href="http://www.nvda-fr.org/">depuis la page francophone d&#233;dier &#224; le lecteur d'&#233;cran en opensources nomm&#233; NVDA:</a><br />
N'oubliez pas de consulter cette page pour voir la derni&#232;re version de NVDA en date!!!</p>
<p><br />
Donc, maintenant vous pouvez consulter puis t&#233;l&#233;charger les modules compl&#233;mentaires depuis les liens directes, list&#233; plus bas!!!</p>
<p><br />
Il inclus les modules compl&#232;mentaires donner par notre ami Michel Such fait par nos amis de NVDA FR Qui participe activement &#224; la cr&#233;ation de celui-ci, pour cela vous pouvez consulter <a href="http://www.nvda-fr.org/addons/">la page francophone d&#233;dier &#224; les modules compl&#233;mentaires par ici:</a> N'oubliez pas de consulter cette page pour voir les nouveaut&#233;s!!!</p>
<p><br />
Mille merci &#224; lui et &#224; son &#233;quipe pour le partage!!!</p>
<p><br />
Le coffre des Modules Compl&#233;mentaires pour NVDA inclus aussi des modules compl&#233;mentaires fait par des autres membres de la liste de N-V-D-A en espagnol ainsi que des gars de la liste de NVDA en anglais, etc, etc...</p>
<hr />
<h2 id="comment-installer-les-modules-complementaires-pour-nvda">1. Comment installer les modules complementaires pour NVDA?</h2>
<p>Instructions pour l'installation<br />
Vous pouvez installer un module compl&#233;mentaire en proc&#233;dant comme suit.</p>
<ol style="list-style-type: decimal">
<li>Ouvrir le menu de NVDA, pour cela appuyez sur les touches: &quot;NVDA+N&quot;</li>
<li>Aller sur &quot;Outils&quot;</li>
<li>Ensuite aller sur &quot;Gestion des modules compl&#233;mentaires&quot; Il s'ouvre une bo&#238;te de dialogue donc vous devez choisir &quot;Installer&quot;, donc vous devez Appuyez sur tab jusqu'&#224; ce que vous obtenez ce bouton, ensuite appuyez sur espace ou entr&#233;e pour l'activer</li>
<li>et dans cette nouvelle bo&#238;te de dialogue parcourez votre disque dure pour trouver le module compl&#233;mentaire que vous souhaitez installer Dans cette bo&#238;te de dialogue, il y &#224; le bouton Ouvrir afin d'ouvrir le module compl&#233;mentaire, que ont souhaite installer.</li>
<li>Apr&#232;s avoir cliquer sur le bouton &quot;Ouvrir&quot; une bo&#238;te de dialogue d'avertissement vous demandera de confirmer l'installation. Cliquez sur Oui ;</li>
<li>Une fois fini l'installation il faut Tabulez jusqu'au bouton &quot;Fermer&quot;</li>
<li>et appuyez sur espace ou Entr&#233;e.</li>
<li>Red&#233;marrez NVDA lorsque c'est demand&#233;. en tout cas c'est une bonne id&#233;e de red&#233;marrer en particulier si vous installer d'autres voix</li>
</ol>
<hr />
<h2 id="note-importante-&#224;-propos-de-linstallation-des-modules-compl&#233;mentaires-pour-nvda"><strong>2. Note importante &#224;-propos de l'installation des modules compl&#233;mentaires pour NVDA</strong></h2>
<p>Pour installer les modules compl&#233;mentaires pour NVDA, ont peut le fair directement si nous avons installer au pr&#233;alable la version 2012.3.1 ou une version sup&#233;rieur de NVDA, pour cela il suffit de valider sur le fichier avec l'extension .nvda-addon, pour installer les module compl&#233;mentaire. S'il s'agit de l'actualisation d'un module compl&#233;mentaire d&#233;j&#224; installer, je conseil fortement plut&#244;t de supprimer l'ancienne version du module compl&#233;mentaire; et installer la nouvelle version de celui-ci, que de faire l'actualisation directement du module compl&#233;mentaire concerner. Pour moi cette proc&#233;dure est plus fiable et prope.</p>
<hr />
<h3 id="vous_pouvez_consulter_la_liste">3. &#224; continuation voici la liste des modules compl&#233;mentaires, avec leurs respective description et leurs lien de t&#233;l&#233;chargement:</h3>
<hr />
<div>
<p>Voici la liste des modules compl&#233;mentaires &#224; t&#233;l&#233;charger!!!</p>
</div>
<p>Attention : Si votre navigateur est Internet Explorer, il peut arriver que le module t&#233;l&#233;charg&#233; se retrouve avec l'extension de fichier .zip au lieu de .nvda-addon. Dans ce cas, il vous faudra changer l'extension du fichier. Par exemple, si votre module a &#233;t&#233; t&#233;l&#233;charg&#233; sous le nom &quot;monModule.zip&quot;, vous devrez le renommer en &quot;monModule.nvda-addon&quot; avant de pouvoir l'installer dans NVDA.</p>
<h1 id="addonshelp">addonsHelp</h1>
<pre><code> Type: Extensions
 Cet addon offre un acc&#232;s rapide aux aides des modules compl&#233;mentaires install&#233;s.</code></pre>
<p>Il r&#233;unit tous les modules compl&#233;mentaires disposant d'une documentation dans un sous-menu du menu Aide de NVDA, nomm&#233; &quot;Aide des modules compl&#233;mentaires&quot;.</p>
<pre><code>  Langues: Anglais, Arabe, Fran&#231;ais et Espagnol.
Version: 1.0
Derni&#232;re mise &#224; jour: 18 Mai 2016
Auteurs: Zougane, R&#233;my, Abdel    </code></pre>
<p>Traduit en espagnol, par: R&#233;my Ruiz <a href="http://cyber25.free.fr/nvda-addons/addonsHelp-1.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire addonsHelp-1.0.nvda-addon par ici:[lien externe]</a></p>
<h1 id="apprenticlavier">ApprentiClavier</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire permet d&#39;utiliser le c&#233;l&#232;bre logiciel
Apprenti Clavier avec NVDA.
Langues: Fran&#231;ais.
Version: 2.2
Derni&#232;re mise &#224; jour: 2 F&#233;vrier 2015
Auteur: Paul de la liste scriptNVDA </code></pre>
<p><a href="https://cld.pt/dl/download/b1ed1613-27be-4573-865f-e4bce2725c1a/ApprentiClavier%20v2.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire ApprentiClavier v2.2.nvda-addon par ici:</a></p>
<h1 id="audacity">Audacity</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation de
l&#39;&#233;diteur audio Audacity avec NVDA. Il apporte les fonctions
suivantes :
un script pour annoncer la position du curseur audio,
un script pour annoncer le d&#233;but et fin de s&#233;lection,
un script pour connaitre l&#39;&#233;tat des boutons &quot;Lecture&quot; et &quot;Pause&quot;,
l&#39;annonce automatique de la position audio,
l&#39;annonce automatique de la s&#233;lection,
l&#39;utilisation possible de la barre d&#39;espace pour appuyer sur un
bouton.
Langues: Fran&#231;ais.
Version : 2.2
Derni&#232;re mise &#224; jour: 13 Juin 2015
Auteur : Paul de la liste scriptNVDA </code></pre>
<p><a href="https://cld.pt/dl/download/b3689cb1-79c6-4ac3-b0bc-1835b10f23a1/audacity%20v2.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire audacity v2.2.nvda-addon par ici:</a></p>
<h1 id="avira-configuration">Avira Configuration</h1>
<pre><code>Type: Extensions</code></pre>
<ul>
<li>Auteurs : Abdel, Corentin.</li>
<li>t&#233;l&#233;charger <a href="http://cyber25.free.fr/nvda-addons/Avira-configuration-1.0-dev.nvda-addon">version de d&#233;veloppement</a></li>
</ul>
<p>Cet addon devrait vous permettre d'am&#233;liorer l'accessibilit&#233; des options de configuration du logiciel Avira-Free-Antivirus.</p>
<p>Ces options de configuration sont accessibles &#224; partir de l'ic&#244;ne d'Avira figurant dans la zone de notification.</p>
<p>Par d&#233;faut, les items de l'arborescence ne sont pas du tout vocalis&#233;s sans la pr&#233;sence de l'addon.</p>
<p>Notes</p>
<ul>
<li>L'addon a &#233;t&#233; cr&#233;&#233; avec la version free d'Avira, il n'a pas &#233;t&#233; test&#233; sur les versions pro.</li>
<li>L'addon a &#233;t&#233; test&#233; sous Windows-XP, ainsi que Windows-10.</li>
<li>Avec Windows-10, il se peut que l'item du pare-feu provoque un plantage momentan&#233;, dans ce cas, refermer puis r&#233;ouvrir les options pour retrouver un comportement normal.</li>
</ul>
<p>Changements pour la version 1.0</p>
<ul>
<li>version initiale.</li>
</ul>
<h1 id="balloon-history">Balloon History</h1>
<pre><code>Type: Extensions
Historique des info-bulles: Appuyez sur Maj NVDA f11 pour obtenir
l&#39;historique des info-bulles
Info-bulles! C&#39;est trop souvent que nous manquons &#224; eux lorsque NVDA
parle d&#39;eux et nous avons maintenant avoir un moyen de consulter les
info-bulles pr&#233;c&#233;dent. Ce plugin vous indique combien de temp
l&#39;info-bulle a &#233;t&#233; cr&#233;&#233;, avec son texte.
Langues: Anglais, Fran&#231;ais Espagnol.
Auteur: Oriol Gomez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/6f16ae91-b4eb-4b8f-94fd-54461f514a15/balloonHistory.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire balloonHistory.nvda-addon par ici:</a></p>
<h1 id="baumextender">baumExtender</h1>
<pre><code>Type: Pilotes pour Terminaux Braille</code></pre>
<p>Pour les utilisateurs d'afficheurs Braille Baum, Andr&#233; propose un module compl&#233;mentaire qui en am&#233;liore l'utilisation.</p>
<p>Vous trouverez le module avec sa doc ici:<br />
<a href="https://andreabc.net/projects/NVDA_addons/BaumExtender/" class="uri">https://andreabc.net/projects/NVDA_addons/BaumExtender/</a></p>
<p>Bravo Andr&#233; pour tout ce travail!</p>
<h1 id="braillenotedriver">braillenoteDriver</h1>
<pre><code>Type: Pilotes pour Terminaux Braille
Pilote pour le Terminal Braille Braillenote Classic
Pilote natif pour le bloc-notes Braille Braillenote Classic.
Auteur: Rui Batista
Version : 0.2.
Langues: Anglais, Fran&#231;ais, Espagnol, Italien, et portugais.
Traduit en fran&#231;ais, espagnol, et italien par: R&#233;my Ruiz</code></pre>
<p><a href="https://cld.pt/dl/download/ccc3fb39-b14d-438f-a183-a7a9dcec56d3/braillenoteDriver-0.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire braillenoteDriver-0.2.nvda-addon par ici:</a></p>
<h1 id="cdburnerxp">CdBurnerXP</h1>
<pre><code>Type: Extensions
Dans la version actuelle, CdBurnerXP est suffisamment accessible
pour &#234;tre utilis&#233; sans module, sauf pour le lecteur audio disponible
dans la fen&#234;tre des compilations audios.
Le module permet cependant de simplifier son utilisation dans les
fen&#234;tres de compilation, gr&#226;ce &#224; des commandes permettant
notamment:\
d&#39;aller directement &#224; l&#39;arborescence, &#224; la zone de liste du dossier
ouvert, &#224; la zone de compilation, au lecteur audio s&#39;il est
affich&#233;;
d&#39;ajouter directement des dossiers ou fichiers &#224; la compilation,
sans passer par des boites de dialogues;
de savoir si le lecteur audio est affich&#233;, de l&#39;afficher si besoin,
d&#39;agir sur le bouton Marche/Arr&#234;t du lecteur, et de se d&#233;placer dans
la piste pendant la lecture.
Il est utilisable avec CdBurnerXP 4.5.4, Windows XP &#224; 8.1. Il a &#233;t&#233;
test&#233; avec NVDA 2014.3, mais il doit pouvoir fonctionner avec les
versions pr&#233;c&#233;dentes ou r&#233;centes.
Vous pouvez consulter les fiches de Daniel Poiraud concernant
CdBurnerXP: </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_1.htm">Graver des CD et DVD avec CdBurnerXP - Fiche #1,</a> <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_2.htm">Graver une compilation avec CdBurnerXP - Fiche #2.</a> Auteur: Daniel Poiraud<br />
Derni&#232;re mise &#224; jour: 26.09.2014<br />
<a href="https://cld.pt/dl/download/ca7f3418-1fc3-40a3-a06c-2b9982bc96e7/CdBurnerXP-v1.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire CdBurnerXP-v1.2.nvda-addon par ici:</a></p>
<h1 id="clip-contents-designer-ex-appendtext">Clip Contents Designer (EX AppendText)</h1>
<pre><code>Type: Extensions
AjouterTexte: Module pour l&#39;ajout de texte dans le presse-papiers
Ce module compl&#233;mentaire est utilis&#233; pour ajouter du texte dans le
presse-papiers, ce qui peut &#234;tre utile lorsque vous souhaitez
joindre des portions de texte ensemble pr&#234;t pour le collage. Le
contenu du presse-papiers peut aussi &#234;tre effac&#233;.    
Les commandes &#224; utiliser sont:    
NVDA+windows+c
Ajoute le texte s&#233;lectionn&#233;, les caract&#232;res braille Unicode qui
repr&#233;sentent les objets MathML ou la cha&#238;ne qui a &#233;t&#233; marqu&#233;e avec
le curseur de revue, dans le presse-papiers.
NVDA+windows+x
Efface le contenu du presse-papiers.
NVDA+windows+f9
Marque la position actuelle du curseur de revue comme le d&#233;but du
texte &#224; ajouter au presse-papiers. Si vous utilisez nvda+F9, le
texte
ne sera pas ajout&#233;.
Note : Les commandes ci-dessus peuvent &#234;tre chang&#233;s depuis le menu
NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de
commandes, dans la cat&#233;gorie Revue de texte.
Menu Pr&#233;f&#233;rences
Param&#232;tres Clip Contents Designer : Permet de d&#233;finir un s&#233;parateur
qui peut &#234;tre utilis&#233; pour trouver les segments de texte une fois
que tout le texte ajout&#233; est coll&#233;. Vous pouvez &#233;galement choisir si
le s&#233;parateur doit &#234;tre copi&#233; dans votre dossier de configuration
personnel de NVDA, afin qu&#39;il puisse &#234;tre import&#233; lors de la
r&#233;installation du module compl&#233;mentaire.
Note : Les commandes ci-dessus peuvent &#234;tre chang&#233;s depuis le menu
NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de
commandes, dans la cat&#233;gorie Configuration.
Langues: Anglais, Fran&#231;ais Espagnol, Italien et autres langues.
Version: 3.3
Derni&#232;re mise &#224; jour: 13 D&#233;cembre 2014
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/12f4d4c4-407f-4527-9ad1-0142406acafb/clipContentsDesigner-3.3.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire clipContentsDesigner-3.3.nvda-addon par ici:</a></p>
<h1 id="controlusageassistant">controlUsageAssistant</h1>
<pre><code>Type: Extensions
Control Usage Assistant - aide interactive sur l&#39;objet actif
Ce module permet de savoir comment interagir avec le contr&#244;le mis
en focus. Cliquez sur NVDA + H pour obtenir un bref
message d&#39;aide sur l&#39;interaction avec le contr&#244;le mis en focus,
comme pour les cases &#224; cocher, champs d&#39;&#233;dition et ainsi de suite.
Description : Permet de savoir comment interagir avec l&#39;&#233;l&#233;ment
actif, pratique pour un d&#233;butant sous Windows ou NVDA.
Appuyez sur NVDA+H pour obtenire l&#39;information.&quot;&quot;&quot;
Langues: Il y a 22 langues inclus le fran&#231;ais.
Version: 2.1
Derni&#232;re mise &#224; jour: 10 Mai 2013
Auteur: Joseph Lee </code></pre>
<p><a href="https://cld.pt/dl/download/ba152851-1955-4b71-8300-862e375d4af1/controlUsageAssistant-2.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire controlUsageAssistant-2.1.nvda-addon par ici:</a></p>
<h1 id="dragonnaturallyspeaking">DragonNaturallySpeaking</h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour le logiciel de dict&#233;e vocale Dragon
Naturally Speaking (version 10, 11 et 12.5). Ce module apporte les
scripts suivants:
1. Le script &quot;NVDA + maj + !&quot; pour lire le r&#233;sultat de la
reconnaissance vocale
2. la lecture automatique de ce r&#233;sultat quand il se pr&#233;sente dans
la bo&#238;te de r&#233;sultat
3. Le script &quot;control+pavNum plus&quot;(ordinateur de bureau), &quot;control+
=&quot; (ordinateur portable) pour allumer ou &#233;teindre le microphone
4. La lecture automatique de la bo&#238;te d&#39;information qui indique
entre autre l&#39;&#233;tat du microphone
5. Le script &quot;NVDA + maj + :&quot; pour lire cette boite d&#39;information
6. La lecture automatique du nouveau conseil du jour
7. Le script &quot;alt+control+1&quot; pour relire ce conseil du jour.
Pour une pr&#233;sentation de Dragon, vous pouvez consulter les fiches de
Daniel Poiraud ici : </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_dragon/index.htm">les fiches de Daniel Poiraud concernant Dragon</a><br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 1.0<br />
Derni&#232;re mise &#224; jour: 30 Septembre 2014<br />
<a href="https://cld.pt/dl/download/d0237056-f7e7-4cd8-8505-e28eea7062a3/DragonNaturallySpeaking%201.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire DragonNaturallySpeaking 1.0.nvda-addon par ici:</a></p>
<h1 id="dropbox">Dropbox</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire ajoute un raccourci permettant d&#39;annoncer
le statut ou la version de Dropbox, mais aussi d&#39;ouvrire le menu
contextuel de l&#39;ic&#244;ne Dropbox dans la zone de notification. Il rends
&#233;galement possible d&#39;utiliser les onglets de la bo&#238;te de dialogue
pr&#233;f&#233;rences avec Ctrl+tab / Ctrl+Maj+Tab et Ctrl+PagePr&#233;c/Suiv. Pour
conclure, ajoute &#233;chapp pour activer le bouton Annuler.
Raccourci : NVDA+Alt+D
Ctrl+Alt+T annonce l&#39;onglet actif.
Probl&#232;mes connus
Quand on change d&#39;onglet en utilisant les raccourcis ajout&#233;s, NVDA
sera incapable de savoir quand la fen&#234;tre sera ferm&#233;e. Lorsque vous
la fermerez, que ce soit en faisant &#233;chappe, en cliquand sur
OK/Annuler/le symbole de fermeture, NVDA vous fera croire que la
fen&#234;tre est toujours l&#224;, mais il n&#39;en est rien. Faites Alt+Tab et
tout devrait rentrer dans l&#39;ordre. Ce souci est connu dans NVDA, il
est probablement du &#224; Windows et ne peut donc pas &#234;tre corrig&#233;.
Langue: Anglais, Espagnol, Fran&#231;ais, Italien et 27 autres langues
ajout&#233;s dans la version 4.0
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 4.0 (version stable)
Derni&#232;re mise &#224; jour: 5 F&#233;vrier 2016
Auteur: Patrick ZAJDA, </code></pre>
<p><script type="text/javascript">
<!--
h='&#122;&#x61;&#106;&#100;&#x61;&#46;&#102;&#114;';a='&#64;';n='&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;&#32;&#40;&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#x61;&#116;&#32;&#122;&#x61;&#106;&#100;&#x61;&#32;&#100;&#x6f;&#116;&#32;&#102;&#114;&#x29;</noscript> Filaos et d'autres contributeurs <a href="https://cld.pt/dl/download/ca161d84-a9f8-4491-bfa0-6e390403beee/dropbox-4.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire dropbox-4.0.nvda-addon (version stable) par ici:</a></p>
<h1 id="eloquence-autolanguageswitching">eloquence-autoLanguageSwitching</h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Synth&#233;tiseur Eloquence
Le module EloquenceAutoLanguageSwitching installe le synth&#233;tiseur
Eti Eloquence pour NVDA.
Il s&#39;agit d&#39;une version am&#233;lior&#233;e du pilote prenant en compte le
changement automatique de langue dans les documents balis&#233;s &#224; cet
effet.
Ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le
synth&#233;tiseur. </code></pre>
<p><a href="https://cld.pt/dl/download/ec815d93-4754-4776-bd3c-0a87f288fc7b/eloquence-autoLanguageSwitching.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire eloquence-autoLanguageSwitching.nvda-addon par ici:</a></p>
<h1 id="emoticons">Emoticons</h1>
<pre><code>Type: Extensions
Avec ce module compl&#233;mentaire, les caract&#232;res de la frimousse seront
remplac&#233;s par leur description humaine plus conviviale. 86
frimousses sont d&#233;finies.
Par exemple : &quot;:)&quot; sera prononc&#233; comme &quot;Frimousse Sourire&quot;, ou &quot;:D&quot;
sera annonc&#233; comme &quot;Frimousse Rigole&quot;
Vous pouvez profiter des fonctionnalit&#233;s suivantes :
Ins&#233;rer une frimousse
Lorsque vous n&#39;&#234;tes pas s&#251;r des caract&#232;res pour une frimousse
particuli&#232;re, ce module compl&#233;mentaire vous permet de s&#233;lectionner
et ins&#233;rer dans votre texte comme dans une conversation. Appuyez sur
NVDA + I, ou &#224; partir du menu Pr&#233;f&#233;rences / Gestion des
frimousses / Ins&#233;rer une frimousse, pour ouvrir une bo&#238;te de
dialogue avec les frimousses disponibles. Lorsque vous appuyez sur
Accepter, les caract&#232;res pour la frimousse choisie sont copi&#233;s dans
le presse-papiers, pr&#234;ts &#224; &#234;tre coll&#233;s.
Personnaliser les frimousses
Depuis le menu NVDA, Pr&#233;f&#233;rences / Gestion des frimousses /
Personnaliser les frimousses, vous pouvez ouvrir une bo&#238;te de
dialogue pour ajouter ou modifier les frimousses disponibles. Cette
bo&#238;te de dialogue vous permet d&#39;enregistrer un dictionnaire de
parole avec vos frimousses personnalis&#233;es.
En appuyant sur le bouton &quot;Enregistrer et exporter le dictionnaire&quot;
un fichier de dictionnaire nomm&#233; emoticons.dic sera enregistr&#233; dans
votre dossier de configuration utilisateur, sous-dossier
speechDicts.
Param&#232;tres d&#39;activation
Vous pouvez choisir d&#39;activer ou non l&#39;annonce des frimousses lors
du d&#233;marrage de NVDA. Par d&#233;faut, elle est d&#233;sactiv&#233;e. Il est
&#233;galement possible d&#39;enregistrer votre choix pour ce param&#232;tre.
Raccourcis clavier :
NVDA+E: permet de basculer entre la lecture du texte comme il est
&#233;crit, ou avec les frimousses remplac&#233;es par leur description
humaine.
NVDA+I: affiche une bo&#238;te de dialogue pour choisir la frimousse que
vous souhaitez coller.
Auteurs : Chris Leo, Noelia Ruiz Mart&#237;nez, Mesar Hameed
Version : 4.3
Langues: 25 langues y compris le fran&#231;ais
Traduit en fran&#231;ais par: R&#233;my Ruiz.
Derni&#232;re mise &#224; jour: 28 Novembre 2015 </code></pre>
<p><a href="https://cld.pt/dl/download/8867ca0e-c879-4420-aa90-42d822fbbd1c/emoticons-4.3.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire emoticons-4.3.nvda-addon par ici:</a></p>
<h1 id="pilote-pour-les-terminaux-braille-eurobraille">Pilote pour les Terminaux Braille Eurobraille</h1>
<pre><code>Type: Pilote natif pour les terminaux Braille Eurobraille.
Auteur: Eurobraille </code></pre>
<p><a href="http://www.eurobraille.fr/">Site Eurobraille FR</a><br />
Version : 2014.05.10<br />
Langue: Anglais, Fran&#231;ais, Espagnol et Italien<br />
Traduit en espagnol par: R&#233;my Ruiz.<br />
<a href="https://cld.pt/dl/download/d8519255-6aad-4380-a180-2eb209688b7d/Erbnvda2014-05-10.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire Erbnvda2014-05-10.nvda-addon par ici:</a></p>
<h1 id="extendedwinamp">extendedWinamp</h1>
<pre><code>Type: Extensions
Le module compl&#233;mentaire nomm&#233;:
extendedWinamp-1.1.nvda-addon
Ce module ajoute des fonctionnalit&#233;s au module d&#39;application pour
Winamp d&#233;j&#224; disponible dans NVDA.
Langues: Anglais, Espagnol, Fran&#231;ais, Italien et 16 autres langues
ajout&#233;s dans la version 1.1.
Version: 1.1
Auteurs: Hrvoje Katic, et l&#39;&#233;quipe de NVDA-addon
Note: L&#39;auteur ne assume plu ce compl&#233;ment, seule l&#39;&#233;quipe
NVDA-addon.
Changements pour la version 1.1
Nouvelles langues: aragonais, arabe, n&#233;erlandais, allemand, finnois,
fran&#231;ais, galicien, hongrois, italien, japonais, cor&#233;en, n&#233;palais,
portugais (Br&#233;sil), russe,Slovaque, slov&#232;ne, espagnol, tamoul,
turc.
Changements pour la version 1.0
Version initiale
Commentaire par BlindHelp: Cette version apporte quelques messages
traduits en fran&#231;ais, qui, &#224; mon go&#251;t, ne sont pas
tellement compr&#233;hensibles. Pareil pour les messages traduit en
espagnol.
se module compl&#233;mentaire a &#233;t&#233; publi&#233; sur le site comunautaire des
modules compl&#233;mentaires NVDA </code></pre>
<p><a href="https://cld.pt/dl/download/898a68d2-bca0-4003-a82c-75563b7e1c5d/extendedWinamp-1.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire extendedWinamp-1.1.nvda-addon par ici:</a></p>
<h1 id="extendedwinamp-mod-remyruiz">extendedWinamp-mod-RemyRuiz</h1>
<pre><code>Type: Extensions
Le module compl&#233;mentaire nomm&#233;:
extendedWinamp-1.1-mod-RemyRuiz.nvda-addon
Ce module ajoute des fonctionnalit&#233;s au module d&#39;application pour
Winamp d&#233;j&#224; disponible dans NVDA.
Langues: Anglais, Espagnol, Fran&#231;ais, Italien et 16 autres langues
ajout&#233;s dans la version 1.1.
Version: 1.1
Auteurs: Hrvoje Katic, et l&#39;&#233;quipe de NVDA-addon
Note: L&#39;auteur ne assume plu ce compl&#233;ment, seule l&#39;&#233;quipe
NVDA-addon.
Changements pour la version 1.1
Nouvelles langues: aragonais, arabe, n&#233;erlandais, allemand, finnois,
fran&#231;ais, galicien, hongrois, italien, japonais, cor&#233;en, n&#233;palais,
portugais (Br&#233;sil), russe,Slovaque, slov&#232;ne, espagnol, tamoul,
turc.
Changements pour la version 1.0
Version initiale
Commentaire par BlindHelp: Cette m&#234;me version est identique &#224; la
pr&#233;c&#233;dente sauf qu&#39;il contient une meilleure traduction des messages
en fran&#231;ais et en espagnol pour une meilleure compr&#233;hension fait par
mes soins.
Pour ma part je recommande instamment de t&#233;l&#233;chargez et installer
cette version modifier
N&#39;oubliez pas SVP de d&#233;sinstaller au pr&#233;alable le module
compl&#233;mentaire avant d&#39;installer celui-ci, en lieu de faire une
actualisation du pr&#233;sent module compl&#233;mentaire!!!
se module compl&#233;mentaire a &#233;t&#233; publi&#233; dans le coffre des Modules
Compl&#233;mentaires pour NVDA </code></pre>
<p><a href="https://cld.pt/dl/download/d19f305b-a401-4391-af6d-9001739fcd68/extendedWinamp-1.1-mod-RemyRuiz.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire extendedWinamp-1.1-mod-RemyRuiz.nvda-addon par ici:</a><br />
Commandes:<br />
Touches &#224; utilis&#233;es lorsque le module a &#233;t&#233; install&#233; et le programme Winamp a &#233;t&#233; d&#233;marr&#233;, une fois que vous jouez une piste ou un album, n'oubliez pas que vous devez &#234;tre dans la fen&#234;tre principale du programme Winamp:<br />
- s active ou d&#233;sactive le mode al&#233;atoire (shuffle)<br />
- r active/d&#233;sactive le mode r&#233;p&#233;tition<br />
- F5 coupe le son<br />
- F6 change le volume &#224; 25%<br />
- F7 change le volume &#224; 50%<br />
-F8 change le volume &#224; 100%<br />
-Maj+Fl&#232;che gauche son plus &#224; gauche<br />
-Maj+Fl&#232;che droite son plus &#224; droite<br />
-Maj+Fl&#232;che haute son au centre<br />
- Control+Maj+t annonce la dur&#233;e de la piste<br />
- Control+Maj+e annonce le temps &#233;coul&#233;<br />
- Control+Maj+r annonce le temps restant<br />
- Maj+-r &#233;couter la fin de la piste (six derni&#232;res secondes par d&#233;faut)<br />
- Control+r d&#233;finir le temps de fin de piste (en secondes) &#224; utiliser lorsque l'on appel la commande &#233;couter la fin de la piste<br />
- Maj+j -d&#233;finir le temps de saut alternatif (en secondes)<br />
- Control+Fl&#232;che droite saut en avant alternatif (six secondes par d&#233;faut)<br />
- Control+Fl&#232;che gauche saut en arri&#232;re alternatif (six secondes par d&#233;faut)</p>
<h1 id="fakeclipboardanouncement">fakeClipboardAnouncement</h1>
<pre><code>Type: Extensions
SimulerAnnoncePresse-papiers
Description: Le module compl&#233;mentaire suivant annoncera les
commandes clavier Ctrl+a Ctrl+C Ctrl+V Ctrl+x Ctrl+Y Ctrl+Z lorsque
ils sont press&#233;s.
1.- Utilit&#233; du module compl&#233;mentaire:
Lors de l&#39;utilisation des raccourcis clavier pour utiliser le
presse-papiers sont annonc&#233;es par NVDA et est ensuite envoy&#233;e &#224;
l&#39;application.
Remarque : Se module compl&#233;mentaire ne fonctionne pas dans la
console Windows.
2.- Commandes:     
- -Control+C: copier le texte ou le fichier s&#233;lectionn&#233; dans le presse-papiers.
- Le message annoncer par NVDA est: &quot;Copier&quot;
- - Control+X: couper le texte ou le fichier s&#233;lectionn&#233; et le d&#233;placez dans le presse-papiers.
- Le message annoncer par NVDA est: &quot;Couper&quot;
- - Control+V: pour coller le contenu du presse-papiers.
- Le message annoncer par NVDA est: &quot;Coller&quot;
 - Control+A: s&#233;lectionner tout le texte ou tous les fichiers.
 Le message annoncer par NVDA est: &quot;S&#233;lectionner Tout&quot;
 - Control+Z: annuler la derni&#232;re action.
 Le message annoncer par NVDA est: &quot;Annuler&quot;
 - Control+Y: r&#233;tablir la derni&#232;re action.
 Le message annoncer par NVDA est: &quot;R&#233;tablir&quot;
     Langues: Anglais, Espagnol, Fran&#231;ais, Italien, slovaque et tch&#232;que.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 1.0
Auteur: Peter V&#225;gner et autres contributeurs de NVDA </code></pre>
<p><script type="text/javascript">
<!--
h='&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#46;&#x73;&#x6b;';a='&#64;';n='&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;&#32;&#40;&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;&#32;&#x61;&#116;&#32;&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#x73;&#x6b;&#x29;</noscript> <a href="https://cld.pt/dl/download/45a51544-c083-4a61-94a6-98106f6bac06/fakeClipboardAnouncement.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire fakeClipboardAnouncement.nvda-addon par ici:</a><br />
S'il vous pla&#238;t Merci de d&#233;sinstaller ce module compl&#233;mentaire si vous avez d&#233;j&#224; install&#233; le module compl&#233;mentaire &quot;NVDAExtensionGlobalPlugin&quot; car le module &quot;fakeClipboardAnouncement&quot; est inclut dans celui-ci.</p>
<h1 id="fen-code-reader">FEN Code Reader</h1>
<pre><code>Description: D&#233;crit une position de jeu d&#39;&#233;checs a partir de un code
FEN
Auteur : Javi Dominguez </code></pre>
<p><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Langues: Anglais, Espagnol et Fran&#231;ais.<br />
(Traduit en fran&#231;ais par R&#233;my Ruiz)<br />
Version: 1.0<br />
Derni&#232;re mise &#224; jour : 14 F&#233;vrier 2016<br />
<a href="https://dl.dropboxusercontent.com/u/7858951/fenCodeReader.NVDA-addon">T&#233;l&#233;charger le module compl&#233;mentaire fenCodeReader.NVDA-addon par ici: [lien externe]</a></p>
<h1 id="festivaltts-2.0-mod.nvda-addon">festivalTts-2.0-mod.nvda-addon</h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Festival Text to Speech
Synth&#233;tiseurs Vocaux Festival pour NVDA 2012.2 ou sup&#233;rieur
Le syst&#232;me de synth&#232;se vocale Festival
Version: 2.0
Auteur: NV Access Limited </code></pre>
<p><script type="text/javascript">
<!--
h='&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#46;&#x6f;&#114;&#x67;';a='&#64;';n='&#x61;&#100;&#x6d;&#x69;&#110;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+e+'<\/'+'a'+'>');
// -->
</script><noscript>&#x61;&#100;&#x6d;&#x69;&#110;&#32;&#x61;&#116;&#32;&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x6f;&#114;&#x67;</noscript><br />
et Olga Yakovleva<br />
<script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+e+'<\/'+'a'+'>');
// -->
</script><noscript>&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;</noscript><br />
Langues support&#233;s dans la version modifier: Anglais, Espagnol, Italien et Tch&#232;que.<br />
Contrairement &#224; la version d'origine qui contient l'Anglais puis le Tch&#232;que Avec la commande, NVDA + Control + S, vous choisissez dans la liste des synth&#233;tiseurs Festival.<br />
Avec la commande, NVDA + Control + V, vous trouverez une liste des voix disponibles et leurs langues.<br />
<a href="https://cld.pt/dl/download/2616a8ec-febe-4092-b3b7-3ebb24eb9d1e/festivalTts-2.0-mod.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire festivalTts-2.0-mod.nvda-addon par ici:</a><br />
<a href="http://www.nvda-project.org/wiki/ExtraVoices">Source de la page en anglais &#224; consulter pour les Voix Extra pour NVDA!</a></p>
<h1 id="file-reader">File Reader</h1>
<pre><code>Type: Extensions
Lit les fichiers sans &#234;tre vu
Description: Lit le fichier avec NVDA sans &#234;tre vu. Utilisez le menu
lecteur de documents pour commencer.
Il vous permet de lire avec les m&#233;moires tampons de texte invisible.
Il y a un menu ajout&#233; &#224; la barre de t&#226;ches syst&#232;me et il vous
annonce toutes les touches de raccourci que vous avez besoin de
savoir.
Langues: Anglais, Espagnol et Fran&#231;ais.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 1.1.    
Auteur: Oriol Gomez </code></pre>
<p><a href="https://cld.pt/dl/download/d1f6255e-ffe9-4eac-8f57-107dfaa70eb9/File%20Reader.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire File Reader.nvda-addon par ici:</a></p>
<h1 id="focus-highlight">Focus Highlight</h1>
<pre><code>Type: Extensions
En dessinant un rectangle color&#233;, ce module compl&#233;mentaire permet
aux utilisateurs malvoyants, &#233;ducateurs voyants ou aux d&#233;veloppeurs
de suivre l&#39;emplacement de l&#39;objet navigateur de NVDA et l&#39;objet mis
en focus ou le contr&#244;le.
Les couleurs suivantes sont utilis&#233;es par ce module compl&#233;mentaire :
Traits en escalier vert, pour indiquer l&#39;objet navigateur.
Rectangle mince rouge, pour indiquer l&#39;objet mis en focus ou le
contr&#244;le.
Rectangle &#233;pais rouge, pour indiquer lorsque l&#39;objet navigateur et
l&#39;objet mis en focus sont chevauchent.
Rectangle &#233;pais bleu avec fines barres obliques, pour indiquer &#224;
NVDA qui est en mode focus, c&#39;est-&#224;-dire les principaux types sont
pass&#233;s au contr&#244;le.
Pour d&#233;sactiver le suivi d&#39;objets, d&#233;sinstallez le module
compl&#233;mentaire.
Langues: Plusieurs langues inclus le fran&#231;ais.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 3.0
Auteurs : Takuya Nishimoto </code></pre>
<p><a href="https://cld.pt/dl/download/62902ab9-b570-4378-90e6-48b04d544d16/focusHighlight-3.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire focusHighlight-3.0.nvda-addon par ici:</a></p>
<h1 id="ifree-skype-recorder">iFree-Skype-Recorder</h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour le logiciel iFree Skype Recorder
Description: Ce module compl&#233;mentaire am&#233;liore l&#39;accessibilit&#233; du logiciel iFree Skype Recorder avec NVDA
Langues: Anglais, Espagnol, Fran&#231;ais et Arabe
Traduit en espagnol par R&#233;my Ruiz.
Version: 2.0
Auteurs: Mohammed, Yannick, R&#233;my, Abdellah ZINEDDINE, Abdel      
Derni&#232;re mise &#224; jour: 6 Juin 2016 </code></pre>
<p><a href="http://cyber25.free.fr/nvda-addons/iFree-Skype-Recorder-2.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire iFree-Skype-Recorder-2.0.nvda-addon par ici: [lien externe]</a> Voici le lien direct de t&#233;l&#233;chargement de la derni&#232;re version du logiciel <a href="http://www.ifree-recorder.com/iFreeRecorder.exe">iFreeRecorder</a> <a href="http://www.ifree-recorder.com/">iFreeRecorder page d&#8217;accueil en anglais</a><br />
Pour plus d'informations vous pouvez consulter la documentation pour la version 2.0 depuis le Gestionnaire des modules compl&#233;mentaires (dans G&#233;rer les modules compl&#233;mentaires)<br />
Chercher le nom du module compl&#233;mentaire nomm&#233;::<br />
Pour le logiciel iFree Skype Recorder<br />
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,<br />
puis la documentation s'ouvre.</p>
<h1 id="instant-translate-4.1-dev-mod-remy-ruiz">Instant Translate 4.1-dev-mod-Remy Ruiz</h1>
<pre><code>Type: Extensions
Je suis heureux de vous dire qu&#39;instantTranslate fonctionne &#224; nouveau !
Maintenant il utilise le Service de Traduction Yandex au lieu de Google.
Remarque&#160;: il pourrait y avoir quelques probl&#232;mes de qualit&#233; en raison du service de traduction.
S&#39;il vous pla&#238;t, v&#233;rifier son fonctionnement.
Merci.
Description: Ce module compl&#233;mentaire permet de traduire le texte
s&#233;lectionn&#233; et ou le texte copi&#233; dans le presse-papiers d&#39;une langue
&#224; une autre. Il utilise un service externe.
Langues: Anglais, Espagnol, Fran&#231;ais, et 23 autres langues ajout&#233;s
dans la version 4.1-dev.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 4.1-dev
Auteurs : Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto
Buffolino et d&#39;autres contributeurs de NVDA.
Note: la version d&#39;instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon
c&#39;est une version modifi&#233; par mes soins, il inclus la derni&#232;re mise
&#224; jour du fichier nvda.po puis la traduction du fichier manifest.ini
en fran&#231;ais.
Ce n&#39;est pas inclus dans le dossier de la langue en fran&#231;ais dans la
version Instant Translate 4.1-dev. 
J&#39;ai traduit  aussi les derniers changements du module compl&#233;mentaire dans la doc en fran&#231;ais.
 Cela est fait aussi pour la langue en espagnol. 
J&#39;oubliez il faut configurer la langue sible et destination.
puis d&#233;sactivez l&#8217;option automatique. </code></pre>
<p><a href="https://cld.pt/dl/download/fd9fec6b-11d7-4d60-b04c-093fd2bf93f7/Modules%20NVDA/instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon par ici:</a> Quelques notes a propos du module compl&#233;mentaire Instant Translate<br />
version 4.1-dev.</p>
<p>1.- Introduction:<br />
Ce module compl&#233;mentaire permet de traduire le texte s&#233;lectionn&#233; et ou le texte copi&#233; dans le presse-papiers d'une langue &#224; une autre. Il utilise un service externe.</p>
<p>2.- Configurer les langues:<br />
Pour configurer la langue source, destination et dans le cas d'une permutation, allez &#224; : Menu NVDA/Pr&#233;f&#233;rences/Param&#232;tres d'Instant Translate.</p>
<p>y a deux listes d&#233;roulantes appel&#233;es &quot;Langue source&quot; et &quot;Langue cible&quot; et une case &#224; cocher pour d&#233;cider si la traduction doit &#234;tre copi&#233;e dans le presse-papiers.</p>
<p>En outre, si vous avez s&#233;lectionn&#233; l'option automatique (le premier choix) dans la liste d&#233;roulante &quot;Langue source&quot;, Il y a aussi une liste d&#233;roulante appel&#233;e &quot;Langue d'alternance&quot; et une case &#224; cocher sur alternance automatique.</p>
<p>La signification des deux premi&#232;res listes d&#233;roulantes et de la case &#224; cocher pour la copie est claire, mais quelques mots au sujet du reste sont n&#233;cessaires.</p>
<p>Rappelez-vous toujours que les explications ci-dessous supposent la langue source, d&#233;finie sur l'option automatique.</p>
<p>La liste d&#233;roulante &quot;Langue d'alternance&quot; est utile lorsque vous permutez par script (voir ci-dessous) la langue source et la langue cible ; en effet, une langue cible d&#233;finie sur l'option automatique n'a aucun sens, donc le module compl&#233;mentaire lui affecte la valeur de la liste d&#233;roulante ci-dessus.</p>
<p>Alors, Imaginez cette situation : vous traduisez g&#233;n&#233;ralement vers l'Anglais (votre langue principale), mais parfois (par exemple, lorsque vous &#233;crivez un document), vous avez besoin de traduire vers l'Italien (votre seconde langue, supposons); vous pouvez d&#233;finir la zone de liste d&#233;roulante &quot;Langue d'alternance&quot; &#224; l'Italien, donc vous ferez la traduction de l'Anglais vers l'Italien sans acc&#233;der directement aux param&#232;tres du module compl&#233;mentaire. &#201;videmment, cette fonction a une utilit&#233; majeure ou mineure selon vos besoins plus fr&#233;quents.</p>
<p>Maintenant, la case &#224; cocher alternance automatique : elle appara&#238;t si et seulement si vous d&#233;finissez l'option automatique dans la liste d&#233;roulante &quot;Langue source&quot;, et est directement connect&#233;e avec la liste d&#233;roulante &quot;Langue d'alternance&quot;. Si vous l'activez, le module compl&#233;mentaire tente de permuter automatiquement depuis la configuration de votre source et destination &#224; une configuration o&#249; la destination devient la langue source, et la langue s&#233;lectionn&#233;e dans la liste d&#233;roulante &quot;Langue d'alternance&quot; est la nouvelle langue destination ; tr&#232;s utile si la langue source du texte que vous voulez traduire est la langue destination.</p>
<p>Un exemple simple : reprenons &#224; l'esprit la situation imagin&#233;e pr&#233;c&#233;demment ; Si vous traduisez un texte dans une langue diff&#233;rente de l'Anglais, il n'y a pas de probl&#232;me, vous obtenez la traduction correcte en Anglais. Mais si vous avez besoin de traduire un texte de l'Anglais, normalement vous obtenez une traduction en Anglais identique au texte original, et c'est un peu inutile. Gr&#226;ce &#224; la fonction alternance automatique, cependant, en supposant que vous voulez savoir comment votre texte sonne en Italien, le module compl&#233;mentaire commute automatiquement la langue cible &#224; l'Italien, donc elle retourne une traduction valide.</p>
<p>En tout cas, il s'agit d'une configuration temporaire ; si cette option n'a aucun effet (c'est exp&#233;rimental), essayez de permuter manuellement &#224; une configuration stable, en utilisant le geste d'alternance d&#233;crites ci-dessous. C'est exp&#233;rimental car dans certaines situations (avec des textes courts, typiquement), Google ne reconna&#238;t pas la v&#233;ritable langue source correctement, et vous devrez permuter manuellement les langues par script, afin de forcer la langue source &#224; la langue cible pr&#233;c&#233;dente (Anglais dans notre exemple).</p>
<p>3.- Utilisation:<br />
Vous pouvez utiliser ce module compl&#233;mentaire de deux fa&#231;ons :</p>
<ol style="list-style-type: decimal">
<li>S&#233;lectionnez du texte en utilisant les commandes de s&#233;lection (maj avec les touches fl&#233;ch&#233;es, par exemple) et appuyez sur la touche associ&#233;e pour traduire.</li>
</ol>
<p>Le r&#233;sultat de la traduction sera lu avec le synth&#233;tiseur que vous utilisez.</p>
<ol start="2" style="list-style-type: decimal">
<li>Vous pouvez &#233;galement traduire le texte depuis le presse-papiers.</li>
</ol>
<p>4.- Raccourcis clavier:</p>
<pre><code>  Toutes les commandes suivantes doivent &#234;tre frapp&#233;es apr&#232;s la
    touche modificatrice &quot;NVDA+Maj+t&quot;:</code></pre>
<ul>
<li>T: Traduit le texte s&#233;lectionn&#233;,</li>
<li>Maj+t: Traduit le texte depuis le presse-papiers,</li>
<li>S: Permute les langues source et cible,</li>
<li>A: Annonce la configuration courante,</li>
<li>C: Copie le dernier r&#233;sultat dans le presse-papiers,</li>
<li>I: Identifie la langue du texte s&#233;lectionn&#233;,</li>
<li>H: Annonce toutes les commandes disponibles pour l'utilisateur.</li>
</ul>
<h1 id="jumptoline">JumpToLine</h1>
<pre><code>Type: Extensions
Acc&#233;der &#224; une ligne d&#39;un texte avec NVDA+Maj+j
Le raccourci &quot;NVDA+Maj+j&quot; vous permet d&#39;acc&#233;der une ligne
particuli&#232;re du document par son num&#233;ro de ligne. Une boite de
dialogue vous demande d&#39;entrer le num&#233;ro de cette ligne, en
l&#39;initialisant par d&#233;ffaut avec le num&#233;ro de la ligne courante.
Comme son nom l&#39;indique, il vous permet de sauter &#224; n&#39;importe quelle
ligne dans n&#39;importe quel texte, y compris les sites Web.
Raccourci clavier: NVDA+Maj+J
Langues: Espagnol anglais, fran&#231;ais.
Version: 1.2
Auteur: Oriol Gomez (modifi&#233; par Paul de la liste scriptNVDA)
Traduit en fran&#231;ais et espagnol par: R&#233;my Ruiz
Derni&#232;re mise &#224; jour: 22 F&#233;vrier 2013 </code></pre>
<p><a href="https://cld.pt/dl/download/3d75cbbe-fdec-46b5-be04-d86184e7f0b4/jumpToLine-v1.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire jumpToLine-v1.2.nvda-addon par ici:</a></p>
<h1 id="listeiconeszonenotification">ListeIconesZoneNotification</h1>
<pre><code>Type: Extensions
Liste des icones de la zone de notification
Description: Affiche la liste des icones dans la zone de
notification avec NVDA+F11
Version: 1.0.
Author: Yannick Mayot, avec la participation de Daniel Poiraud
Langue: Fran&#231;ais. </code></pre>
<p><a href="https://cld.pt/dl/download/e039776c-3674-4443-a19f-9880641163a6/ListeIconesZoneNotification.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire ListeIconesZoneNotification.nvda-addon par ici:</a><br />
S'il vous pla&#238;t Merci de d&#233;sinstaller ce module compl&#233;mentaire si vous avez d&#233;j&#224; install&#233; le module compl&#233;mentaire &quot;NVDAExtensionGlobalPlugin&quot; car le module &quot;ListeIconesZoneNotification&quot; est inclut dans celui-ci.</p>
<h1 id="modifylockannouncement">modifyLockAnnouncement</h1>
<pre><code>Type: Extensions</code></pre>
<p>Changement de l'annonce des touches de verrouillage<br />
Description: Ce module compl&#233;mentaire permet d'offrir la possibilit&#233; de personnaliser l'annonce des touches verrouillage num&#233;rique, verrouillage majuscule, ainsi que la touche arr&#234;t<br />
Version : 1.0<br />
Langues: Anglais, Fran&#231;ais et Espagnol<br />
Traduit en espagnol par: R&#233;my Ruiz<br />
Auteurs : Pierre-Louis, Corentin, R&#233;my, Abdel<br />
Derni&#232;re mise &#224; jour: 6 Juin 2016<br />
<a href="http://cyber25.free.fr/nvda-addons/modifyLockAnnouncement.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire modifyLockAnnouncement.nvda-addon par ici: [lien externe]</a><br />
Pour plus d'informations vous pouvez consulter la documentation pour la version 1.0 depuis le Gestionnaire des modules compl&#233;mentaires (dans G&#233;rer les modules compl&#233;mentaires)<br />
Chercher le nom du module compl&#233;mentaire nomm&#233;::<br />
modifyLockAnnouncement<br />
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,<br />
puis la documentation s'ouvre.</p>
<h1 id="mp3directcut">Mp3DirectCut</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation de
l&#39;&#233;diteur de fichiers mp3 MP3DirectCut avec NVDA.      
Version : 2.2
Langues: Anglais, Fran&#231;ais, Espagnol et Arabe.
Traduit en espagnol par: R&#233;my Ruiz</code></pre>
<p>Auteurs : Abdel, R&#233;my RUIZ, Abdellah ZINEDDINE, Jean-Fran&#231;ois COLA<br />
Derni&#232;re mise &#224; jour: 31 Juillet 2016 <a href="http://cyber25.free.fr/nvda-addons/mp3DirectCut-2.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire mp3DirectCut-2.2.nvda-addon par ici:[lien externe]</a><br />
Pour plus d'informations vous pouvez consulter la documentation pour la version 2.2 depuis le Gestionnaire des modules compl&#233;mentaires (dans G&#233;rer les modules compl&#233;mentaires)<br />
Chercher le nom du module compl&#233;mentaire nomm&#233;::<br />
mp3DirectCut<br />
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,<br />
puis la documentation s'ouvre.</p>
<h1 id="nobeepsspeechmode">noBeepsSpeechMode</h1>
<pre><code>Type: Extensions
Ce module supprime les bips dans le mode parole quand on
presse NVDA+s. Vous n&#39;avez le choix qu&#39;entre d&#233;sactiv&#233; et activ&#233;.
Langues: Fran&#231;ais, Italien, Espagnol et 18 autres langues.
Version: 2.1
Auteur: Alberto Buffolino
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/615b9b7e-fe2c-43f6-aeb1-908c6c5f3e8f/noBeepsSpeechMode-2.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire noBeepsSpeechMode-2.1.nvda-addon par ici:</a></p>
<h1 id="nvdaextensionglobalplugin">NVDAExtensionGlobalPlugin</h1>
<pre><code>Type: Extensions
Extension des commandes de base de NVDA
Description: Ce module compl&#233;mentaire ajoute &#224; NVDA les
fonctionnalit&#233;s suivantes:
Affichage de la liste des ic&#244;nes de la zone de notification,
Affichage de la liste des fen&#234;tres des applications lanc&#233;es,
Aide &#224; la composition d&#39;un symbole complexe comme par exemple, un a
e li&#233;, un symbole puissance 2,
Annonce du nom du profil vocal),       
Extension des fonctionnalit&#233;s du buffer virtuel:
* nouvelles commandes de navigation au buffer virtuel (paragraphe,
division, ancre),
* nouveaux types d&#39;&#233;l&#233;ments pour la boite de dialogue NVDA+F7
(titre,rep&#232;re, cadre, bouton,etc),
* affichage de l&#39;&#233;tiquette des zone d&#39;&#233;dition (NVDA+f7),
* annonce du nombre d&#39;&#233;l&#233;ments trouv&#233;s (NVDA+f7),
* scripts pour annoncer les cellules d&#39;une ligne /colonne d&#39;un
tableau,
* script pour annoncer l&#39;adresse (URL) du document dans les
navigateurs FireFox et Internet Explorer,
Annonce du nom et num&#233;ro de version de l&#39;application focalis&#233;e,
Annonce de la fonction associ&#233;e aux commandes d&#39;&#233;dition du style
Copier, Coller, etc ,
Annonce du nom du dossier pr&#233;s&#233;lectionn&#233; dans les boites de dialogue
du style &quot;Ouvrir&quot;,&quot;Enregistrer&quot;, &quot;Enregistrer sous&quot;,etc,
Annonce du mot focalis&#233; lors d&#39;une suppression de mot,
Ouverture du journal courant ou ancien de NVDA,
Suppression de l&#39;annonce de la description des objets dans les
rubans Windows,
Scripts pour r&#233;&#233;couter les pr&#233;c&#233;dentes annonces vocales 
enregistr&#233;es.
Pr&#233;sentation du formatage du texte dans une boite de dialogue (d&#233;sactiv&#233; par d&#233;faut)
Toutes ces fonctionnalit&#233;s peuvent &#234;tre activ&#233;es ou
d&#233;sactiv&#233;es individuellement. Par d&#233;faut, la  plupart sont activ&#233;es.     
Ce Module a &#233;t&#233; d&#233;velopp&#233; avec la participation de Daniel Poiraud.</code></pre>
<p>Il n'est pas compatible avec les versions de NVDA inf&#233;rieures &#224; la 2016.2.<br />
Pour plus d'informations, <a href="http://www.nvda-fr.org/addons/NVDAExtensionGlobalPlugin.html">veuillez consulter la documentation du module par ici:</a><br />
Important!!!<br />
Avant d'installer ce module, supprimer toutes les installation du module compl&#233;mentaire Global Plugin &quot;liste des fen&#234;tres&quot; et le module compl&#233;mentaire &quot;fakeClipboardAnouncement&quot; car cette version les inclut.<br />
Ce module n'est pas compatible avec les versions de NVDA inf&#233;rieurs &#224; la version 2016.2.<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 4.3<br />
Derni&#232;re mise &#224; jour: 19 Juin 2016<br />
<a href="https://dl.dropboxusercontent.com/u/97346983/NVDAExtensionGlobalPlugin%20v4.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire NVDAExtensionGlobalPlugin v4.3.nvda-addon par ici: [lien externe]</a><br />
pour les personnes qui ont install&#233; une version pr&#233;c&#233;dente de NVDA, vous pouvez utiliser l'ancienne version du module compl&#233;mentaire:<br />
NVDAExtensionGlobalPlugin v4.0.1.nvda-addon<br />
Description: Ce module ajoute aux commandes globales de NVDA les scripts suivants:<br />
Un script pour pr&#233;senter la liste des ic&#244;nes de la zone de notification, avec la possibilit&#233; de cliquer sur l'un d'entre eux,<br />
Un script pour lister les fen&#234;tres des applications en cours, avec la possibilit&#233; de basculer vers l'une d'entre elles ou de la d&#233;truire,<br />
Un script pour afficher le dialogue des gestes de commandes de NVDA,<br />
Un script d'aide &#224; la composition de symboles complexes, comme par exemple un &quot;e&quot; dans l'&quot;o&quot;, un point d'interrogation renvers&#233;,...<br />
Un script pour annoncer le profil vocal en cours,<br />
Pour le tampon virtuel, la possibilit&#233; de naviguer de paragraphe en paragraphe, de division en division et d'ancre en ancre,<br />
Ajout au script NVDA+f7 de nouveaux types d'&#233;l&#233;ments (liste, case &#224; cocher, paragraphe, division, cadre,...) sous forme de liste plut&#244;t que de boutons radio,<br />
Un script pour connaitre le nom et la version de l'application sous le curseur,<br />
Annonce des fonctions r&#233;alis&#233;es par les commandes clavier &quot;control+c&quot;, &quot;control+v&quot;, &quot;control+a&quot;, control+x&quot;, &quot;control+z&quot; et &quot;control+y&quot;,<br />
Un script pour annoncer le dossier s&#233;lectionn&#233; pour les boites de dialogue du style &quot;Ouvrir, Enregistrer&quot;, &quot;Enregistrer sous&quot;<br />
Un script pour activer ou d&#233;sactiver l'annonce du num&#233;ro de ligne sans passer par le menu &quot;pr&#233;f&#233;rence / Mise en forme des documents&quot; de NVDA,<br />
Annonce du mot qui suit le mot supprim&#233; par la commande &quot;control+Suppr&quot;,<br />
Prise en compte des ic&#244;nes dont le texte est affich&#233; sur plusieurs lignes.<br />
Pour plus d'informations vous pouvez consulter la documentation pour la version 4.01 depuis le Gestionnaire des modules compl&#233;mentaires (dans G&#233;rer les modules compl&#233;mentaires)<br />
Chercher le nom du module compl&#233;mentaire nomm&#233;::<br />
Extension des commandes&#160; de base de NVDA<br />
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,<br />
puis la documentation s'ouvre.<br />
Important!!!<br />
Avant d'installer ce module, supprimer toutes les installation du module compl&#233;mentaire Global Plugin &quot;liste des fen&#234;tres&quot; et le module compl&#233;mentaire &quot;fakeClipboardAnouncement&quot; car cette version les inclut.<br />
Ce module n'est pas compatible avec les versions de NVDA inf&#233;rieurs &#224; la version 2014.1.<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 4.01<br />
Ancienne mise &#224; jour: 30 Novembre 2015<br />
<a href="https://cld.pt/dl/download/e6dae56c-c94a-4945-9589-053979f3c6ea/NVDAExtensionGlobalPlugin%20v4.0.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire NVDAExtensionGlobalPlugin v4.0.1.nvda-addon par ici:</a></p>
<h1 id="objsounds-kevangc-version">OBJSounds (KevanGC Version)</h1>
<pre><code>Type: Extensions
Obj Sounds c&#39;est la m&#234;me version mais modifier par KevanGC
Auteur: Tyler Spivey
Version: 0.20120928.01
Commentaire par BlindHelp:
Il peut &#233;galement &#234;tre personnalis&#233; sans trop de difficult&#233;, ont
peut mettre dans le dossiers correspondants les fichiers sons avec
leurs noms et le format appropri&#233;.
Se module compl&#233;mentaire , contrairement &#224; l&#39;original, a une fa&#231;on
de Activer et d&#233;sactiver les sons, avec NVDA + alt + o.
Ce que je n&#39;aime pas c&#39;est qu&#39;ils ont mis la touche alt; lorsque la
touche alt est enfonc&#233;e, le menu s&#39;ouvre.
Je le pr&#233;f&#232;re aussi parce que le son des oiseaux est plus faible et
moins envahissant. Par ailleurs, je pense qu&#39;il est &#233;gal aux
complement de l&#39;auteur original.
J&#39;esp&#232;re qu&#39;ils servent. </code></pre>
<p><a href="https://cld.pt/dl/download/01a7df33-9e82-4b67-bf95-af17ba54ee94/OBJSounds%20%28KevanGC%20Version%29.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire OBJSounds (KevanGC Version).nvda-addon par ici:</a></p>
<h1 id="objsounds">objsounds</h1>
<pre><code>Type: Extensions
Obj Sounds c&#39;est la version original fait par l&#39;auteur: Tyler
Spivey
Version: 0.20120928.01
Commentaire par BlindHelp:
il me semble sauf erreur de ma part que Le son est plus fort que la
version modifier par KevanGC
J&#39;esp&#232;re qu&#39;ils servent. </code></pre>
<p><a href="https://cld.pt/dl/download/9813eb79-af93-42d2-918d-23cac0382dc0/objsounds.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire objsounds.nvda-addon par ici:</a></p>
<h1 id="ocr">OCR</h1>
<pre><code>Type: Extensions
Description: Effectue une reconnaissance de caract&#232;res (OCR) pour
extraire le texte d&#39;un objet inaccessible.
Utilise le moteur d&#39;OCR Tesseract.
Pour ex&#233;cuter l&#39;OCR, placez-vous sur l&#39;objet et appuyez sur NVDA+r.
Vous pouvez d&#233;finir la langue de l&#39;OCR en allant dans le menu
Pr&#233;f&#233;rences du menu NVDA et s&#233;lectionnez R&#233;glage OCR.
Auteurs: NV Access Limited et autres colaborateurs.
Version: 0.20120529.01
Langues: Anglais, Fran&#231;ais, Italien, Espagnol et autres 7 langues.
Derni&#232;re mise &#224; jour: 29 Mai 2012</code></pre>
<p><a href="https://cld.pt/dl/download/52c168ff-6371-4640-a2f9-e6b8cd5aeae8/ocr_0.20120529.01.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire ocr_0.20120529.01.nvda-addon par ici:</a></p>
<h1 id="percentage-checker">percentage checker</h1>
<pre><code>Type: Extensions
Pourcent de texte (CTRL+NVDA+P)
Lire le pourcentage de texte actuel &#224; l&#39;aide du raccourci
CTRL+NVDA+P
Vous permet de v&#233;rifier de combien vous &#234;tes loin en lisant &#224;
travers d&#39;un texte + le nombre de mots de ce texte.
Raccourci: CTRL+NVDA+P
Langues: Allemand, Anglais, Espagnol, Fran&#231;ais
Version: 1.2
Auteur: Oriol Gomez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/a1bc0213-0f25-451e-b8f4-fed34d50a1c0/percentage%20checker.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire percentage checker.nvda-addon par ici:</a></p>
<h1 id="perky">Perky</h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour l&#39;application Perky
Version: 1.0
Auteur: Noelia Ruiz Mart&#237;nez
Langues: Anglais, Fran&#231;ais et Espagnol
Traduit en fran&#231;ais et espagnol par R&#233;my Ruiz
Utilisation du module compl&#233;mentaire Perky pour l&#39;application Perky Duck:</code></pre>
<p>Module compl&#233;mentaire Perky Duck:<br />
Ce module permet de conna&#238;tre les points en braille correspondant &#224; un caract&#232;re donn&#233; dans les documents de Perky Duck.<br />
1. Notifications automatiques</p>
<pre><code>- NVDA peut signaler les points correspondant au dernier caract&#232;re
&#233;crit (y compris l&#39;espace et la nouvelle ligne), sur les documents
en braille de Perky.
- Pour activer ces notifications, il suffit de basculer sur le mode
&#233;criture.

- Lorsque le curseur syst&#232;me est d&#233;plac&#233;, le mode &#233;criture sera
d&#233;sactiv&#233; automatiquement.

    2. Commandes

     2.1. Commandes clavier     

- NVDA+control+maj+b: Bascule entre activ&#233; et d&#233;sactiv&#233; le mode
d&#39;&#233;criture.
- NVDA+maj+control+n: Signale les points correspondant au
caract&#232;re pr&#233;c&#233;dent. Elle permet de r&#233;p&#233;ter l&#39;annonce du dernier
symbole &#233;crit sans d&#233;placer le curseur de revue. (Disponible
uniquement en mode &#233;criture). - 
- NVDA+control+maj+m: Signale les
points associ&#233;es au caract&#232;re sous le curseur de revue.

    2.2. Menu

Ce module compl&#233;mentaire ajoute au menu NVDA (NVDA+n) les options
suivantes:

- Param&#232;tres pour Perky, pr&#233;f&#233;rences sous menu: Contient les bo&#238;te
de dialogues standar pour associer les combinaison de points avec
les caract&#232;res.

- Aide pour Perky: Ouvre le guide du module compl&#233;mentaire Perky
dans la langue actuel de NVDA si disponible, ou en anglais par
d&#233;faut. </code></pre>
<p><a href="https://cld.pt/dl/download/ee04fd7f-cd20-4d89-aed6-b1fef48766ba/perky-1.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire perky-1.0.nvda-addon par ici:</a> <a href="http://www.duxburysystems.org/downloads/perky1102.msi">T&#233;l&#233;charger le programme gratuit Perky Duck par ici: [lien externe]</a></p>
<h1 id="placemarkers">placeMarkers</h1>
<pre><code>Type: Extensions
Ce module sert &#224; sauvegarder et rechercher des cha&#238;nes de caract&#232;res
ou des marqueurs sp&#233;cifiques sur des pages web ou des documents en
mode navigation.
Le module sauvegarde les textes et les marqueurs sp&#233;cifi&#233;s dans
des fichiers. Le nom des fichiers est bas&#233; sur le titre et l&#39;url du
document en cours.
Ce module est bas&#233; sur les modules SpecificSearch et
Bookmark&amp;Search, d&#233;velopp&#233;s par le m&#234;me auteur. Vous devrez les
d&#233;sinstaller avant d&#39;installer celui-ci, car ils poss&#232;dent des
raccourcis et des fonctionnalit&#233;s communs.
Touches de commandes :
control+maj+NVDA+s; Ouvre une bo&#238;te de dialogue qui vous permet
d&#39;enregistrer une cha&#238;ne de texte que vous voulez trouver dans le
document actuel. Par d&#233;faut, le texte pr&#233;c&#233;demment enregistr&#233; pour
ce fichier est affich&#233;. Supprimer ce texte et appuyez sur le bouton
OK si vous souhaitez supprimer le fichier texte correspondant &#224; la
recherche enregistr&#233;e, ou tapez un nouveau texte pour ajouter une
autre recherche.
Control+maj+NVDA + f; ouvre une bo&#238;te de dialogue avec un champ
d&#39;&#233;dition qui indique la derni&#232;re recherche enregistr&#233;e, dans ce
dialogue, vous pouvez &#233;galement s&#233;lectionner les recherches
pr&#233;c&#233;demment sauvegard&#233;es &#224; partir d&#39;une zone de liste d&#233;roulante et
choisir une action dans la liste d&#233;roulante suivante. S&#39;il n&#39;y a pas
de fichiers disponibles pour la recherche sp&#233;cifi&#233;e dans le document
actuel, NVDA vous pr&#233;viendra qu&#39;il ne trouve pas un fichier pour la
recherche sp&#233;cifi&#233;e.
Control+maj+NVDA + k; Enregistre la position actuelle comme signet
Control+maj+NVDA+Suppr; Supprime le signet correspondant &#224; cette
position
NVDA+k; Passe au signet suivant
Maj+NVDA+k; Passe au signet pr&#233;c&#233;dent
Control+maj+k; Copies au presse-papiers le nom du fichier, sans
extension, o&#249; la place des donn&#233;es de marqueurs seront sauv&#233;s
Sous-menu des marqueurs (NVDA+N)
En utilisant le sous-menu des marqueurs, dans le menu pr&#233;f&#233;rences,
vous pouvez acc&#233;der &#224; :
Dossier des recherches sp&#233;cifiques : Ouvre le dossier des recherches
sp&#233;cifiques pr&#233;c&#233;demment sauvegard&#233;es.
Dossier des marqueurs : Ouvre le dossier des marqueurs sauvegard&#233;s.
Copier le dossier des marqueurs; Vous pouvez sauvegarder une copie
du dossier des marqueurs.
Restorer le dossier des marqueurs; Vous pouvez restorer le dossier
des marqueurs &#224; partir d&#39;un dossier de marqueurs pr&#233;c&#233;demment
sauvegard&#233;.
Fichier de documentation, dans votre langue si elle est disponible
ou en Anglais par d&#233;faut.
Note: la position du marqueur est bas&#233; sur le nombre de caract&#232;res.
Dans les pages au contenu dynamique, il vaut mieux utiliser la
recherche de texte sp&#233;cifique pour marquer une position
particuli&#232;re.
Version: 6.1
Langues: Anglais, Fran&#231;ais, Italien, Espagnol et 25 autres
langues.
Auteurs : Noelia, Chris.
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/3a5e3142-4108-4770-9d00-e63c4156140b/placeMarkers-6.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire placeMarkers-6.1.nvda-addon par ici:</a></p>
<h1 id="poeditmadeeasy">poeditMadeEasy</h1>
<pre><code>Type: Extensions
Am&#233;lioration de l&#39;Acc&#232;s sur poedit.
Description: Ce module compl&#233;mentaire annonce les actions effectu&#233;
en appuyant sur les commandes des raccourci de poedit. Il indique
les diff&#233;rente cat&#233;gories de messages par un bip sp&#233;cifique.
&#201;galement en appuyant sur les gestes sp&#233;cifi&#233;s, vous pouvez
conna&#238;tre la source et le texte du message traduit en plus de
basculer entre activer/d&#233;sactiver le mode bip.
Auteur : Him Prasad Gautam
Version : 3.1
Langues: Anglais, Fran&#231;ais, Espagnol, Hindi, N&#233;palais et tamoul
Traduit en fran&#231;ais et espagnol par: R&#233;my Ruiz
Voila, les messages puis la documentation son maintenant traduite en
fran&#231;ais et espagnol !
C&#39;est pour le logiciel poedit qui sert a traduire les modules
compl&#233;mentaires et autres programmes utilisant le catalogue de
poedit.
Note: la version 3.1 du module compl&#233;mentaire poeditMadeEasy
proposer par l&#39;auteur ne contient-pas ces deux langues.
S&#39;il vous pla&#238;t, n&#39;oubliez pas de lire la documentation relative &#224;
son utilisation.
Vous pouvez consulter l&#39;aide du module compl&#233;mentaire:
Pour cela appuyer sur NVDA+N (Menu NVDA) puis aller dans le Menu
&quot;Aide&quot; puis chercher l&#39;&#233;l&#233;ment nomm&#233;:
&quot;Am&#233;lioration de l&#39;Acc&#232;s sur poedit. 3.1&quot;
Faire entr&#233;e
ou en allant dans le Menu &quot;Outils&quot;
puis &quot;Gestion des modules compl&#233;mentaires&quot;
Chercher le d&#233;but du nom de l&#39;&#233;l&#233;ment nomm&#233;:
Am&#233;lioration de l&#39;Acc&#232;s sur poedit.;
Faire TAB
puis appuyer sur le bouton &quot;Aide de ce module compl&#233;mentaire&quot;
L&#39;aide du module compl&#233;mentaire s&#39;ouvre en fran&#231;ais, une fois fini
la lecture, fermer la documentation par Alt+F4. </code></pre>
<p><a href="https://cld.pt/dl/download/20d363de-7c51-452c-b599-de92b8246cef/poeditMadeEasy.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire poeditMadeEasy.nvda-addon par ici:</a></p>
<h1 id="radiosure">RadioSure</h1>
<pre><code>Type: Extensions
RadioSure permet d&#39;&#233;couter et d&#39;enregistrer les radios sur internet.
Il comprend plus de 17 000 stations pr&#233;install&#233;es et il est possible
d&#39;en rajouter d&#39;autres. Il prend en charge les formats mp3, wma, ogg
vorbis, aac+. La recherche dans la liste des radios est rapide.
Effet de fondu encha&#238;n&#233; entre deux radios. Il enregistre les
chansons une par une (avec nom de l&#39;auteur et titre si la radio
fournit l&#39;information) ou en un seul fichiers en continu.
Possibilit&#233; d&#39;enregistrer 2 radios simultan&#233;ment.
Ce module compl&#233;mentaire apporte de nombreuses am&#233;liorations dans
l&#39;utilisation de RadioSure avec NVDA par l&#39;ajout d&#39;un certain nombre
de raccourcis clavier.
Pour plus d&#39;informations, </code></pre>
<p><a href="http://www.nvda-fr.org/addons/radioSure.html">veuillez consulter la documentation du module par ici:</a><br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 1.4<br />
Langues: Anglais, Fran&#231;ais et Espagnol<br />
Traduit en espagnol par R&#233;my Ruiz<br />
Derni&#232;re mise &#224; jour: 26 Juin 2014<br />
<a href="https://cld.pt/dl/download/7c77566c-12ef-47e0-a6da-7a25313db83b/radiosure%201.4.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire radiosure 1.4.nvda-addon par ici:</a></p>
<h1 id="read-feeds">Read Feeds</h1>
<pre><code>Type: Extensions
Description: Module compl&#233;mentaire pour utiliser NVDA comme un
lecteur de flux RSS.
Ce module compl&#233;mentaire fournit un moyen simple de lire les flux
aux formats Atom ou RSS &#224; l&#39;aide de NVDA. Les flux ne sont pas
actualis&#233;es automatiquement.
Ci-dessous lorsque nous mentionnons flux, nous voulons dire que les
deux signifient flux RSS et ATOM.
Installation ou Mise &#224; jour :
Si vous utilisiez une version ant&#233;rieure de ce module
compl&#233;mentaire, il y a un dossier RSS ou personalFeeds dans votre
dossier de configuration personnel de NVDA, lorsque vous installez
la version 6.0 ou ult&#233;rieure, une bo&#238;te de dialogue vous demandera
si vous souhaitez mettre &#224; jour ou installer. Choisissez mise &#224; jour
pour pr&#233;server vos flux enregistr&#233;s et pour continuer &#224; les utiliser
dans la nouvelle version install&#233;e de readFeeds.
Commandes :
Menu Read Feeds
Vous pouvez acc&#233;der au sous-menu Read Feeds depuis le menu NVDA,
NVDA+N, o&#249; les suivantes options du menu sont disponibles :
Liste de l&#39;article...
Affiche la liste de l&#39;article depuis votre flux actuelle.
S&#233;lectionnez l&#39;article que vous souhaitez lire, puis appuyez sur le
bouton Accepter pour ouvrir la page de l&#39;article correspondant dans
votre navigateur.
Adresse du flux temporaire...
contr&#244;le + NVDA + Maj + Entr&#233;e: Ouvre une bo&#238;te de dialogue pour
taper une nouvelle URL pour s&#233;lectionner un autre flux. L&#39;URL
actuelle sera montr&#233; dans cette bo&#238;te de dialogue.
Charger l&#39;adresse du flux depuis un fichier...
NVDA+contr&#244;le+entr&#233;e : Ouvre une bo&#238;te de dialogue pour s&#233;lectionner
un flux dans un fichier enregistr&#233; contenant l&#39;URL du flux.
Enregistrer l&#39;adresse actuelle du flux sur fichier...
NVDA+maj+entr&#233;e : ouvre une bo&#238;te de dialogue pour s&#233;lectionner le
fichier o&#249; l&#39;URL du flux actuelle sera enregistr&#233;. Si vous
enregistrez le fichier sp&#233;cial addressFile.txt, ce flux particulier
servira comme votre flux par d&#233;faut.
Actualiser le flux actuel : contr&#244;le+maj+NVDA+8 : Actualisez les
flux s&#233;lectionn&#233;. Ces flux ne seront pas actualis&#233;s automatiquement
lorsque commence &#224; d&#233;marrer le module compl&#233;mentaire Read Feeds.
Sauvegarde de votre dossier de flux personnelle...
ouvre une bo&#238;te de dialogue pour choisir un dossier o&#249; vous pouvez
enregistrer le r&#233;pertoire personalFeeds de vos flux. Par d&#233;faut, le
dossier s&#233;lectionn&#233; est le r&#233;pertoire de configuration de NVDA, qui
cr&#233;era le r&#233;pertoire personalFeeds.
Restaurer les flux personnels...
Ouvre une bo&#238;te de dialogue pour s&#233;lectionner un dossier qui
remplace vos flux dans le dossier personalFeeds.
Assurez-vous que vous chargez un dossier contenant les URLs des
flux.
Remarque : Si vous souhaitez supprimer un flux URL pr&#233;c&#233;demment
enregistr&#233;, Il suffit de supprimer le fichier correspondant.
Commandes clavier :
Ctrl+Maj+NVDA+Espace : Annonce l&#39;URL de l&#39;article actuel. En
appuyant deux fois ouvrira la page web.
Ctrl+Maj+NVDA+8 : Actualise le flux s&#233;lectionn&#233; et annonce son plus
r&#233;cent titre.
Ctrl+Maj+NVDA+I : Annonce le titre du flux actuel. En appuyant deux
fois copie le titre et le lien associ&#233;e dans le presse-papiers.
Ctrl+Maj+NVDA+U : Annonce le titre du flux pr&#233;c&#233;dent.
Ctrl+Maj+NVDA+O : Annonce le titre du flux suivant.
Notifications :
Lorsque le titre ou l&#39;URL ont &#233;t&#233; copi&#233;s. - Lorsqu&#39;il est Impossible
de se connecter/actualiser un flux, ou l&#39;URL ne correspond pas &#224; un
flux valide.
- NVDA affiche un message d&#39;erreur s&#39;Il n&#39;&#233;tait pas possible de
sauvegarder le dossier personalFeeds. - La bo&#238;te de dialogue affiche
Le titre de la Liste de l&#39;article le nom de flux s&#233;lectionn&#233; et le
nombre d&#39;&#233;l&#233;ments disponibles.
Version: 2.5
Langues: Anglais, Fran&#231;ais, Italien, Espagnol et 19 autres
langues.
Auteurs : Noelia Ruiz Mart&#237;nez, Mesar Hameed
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/beb18b7c-1663-4ca1-b8ae-e3e4924bee13/readFeeds-2.5.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire readFeeds-2.5.nvda-addon par ici:</a></p>
<h1 id="reportpasswords">reportPasswords</h1>
<pre><code>Type: Extensions
Voici un module tr&#232;s pratique qui permet &#224; nvda de vocaliser le mot de passe lors de la r&#233;daction.
On peut aussi activer ou d&#233;sactiver cette fonctionnalit&#233; selon le besoin, avec le raccourci : NVDA+Contr&#244;le+Maj+p.
Remarque : La commande ci-dessus peut &#234;tre chang&#233;e dans le Menu NVDA, sous-menu Pr&#233;f&#233;rences, dans le dialogue Gestes de commandes, cat&#233;gorie Parole.
Vous pourrez configurer ce module compl&#233;mentaire en allant dans le menu &quot;Pr&#233;f&#233;rences/Param&#232;tres ReportPasswords&quot;,
pour cocher ou d&#233;cocher la case &#224; cocher :
Report passwords
Ensuite faire tab, puis faire entr&#233;e sur le bouton :
OK
Si vous souhaitez conserver cette case &#224; cocher active, vous devez cliquer sur l&#39;&#233;l&#233;ment :
Sauvegarder la configuration
en allant dans le menu NVDA
Ces changements seront sauvegard&#233;s dans le fichier nvda.ini</code></pre>
<p>Cette case &#224; cocher n&#8217;est pas coch&#233;e par d&#233;faut.<br />
Version: 1.3-dev<br />
Langues: Anglais, Fran&#231;ais et Espagnol.<br />
J'ai oubli&#233;, la traduction en Fran&#231;ais et Espagnol n&#8217;est pas incluse dans le module compl&#233;mentaire d'origine fait par l'auteur.<br />
Auteur: Noelia Ruiz Mart&#237;nez<br />
Traduit en Fran&#231;ais et Espagnol par: R&#233;my Ruiz<br />
<a href="https://cld.pt/dl/download/fd9fec6b-11d7-4d60-b04c-093fd2bf93f7/Modules%20NVDA/reportPasswords-1.3-dev.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire reportPasswords-1.3-dev.nvda-addon par ici:</a></p>
<h1 id="savelog">SaveLog</h1>
<pre><code>Type: Extensions
Enregistrer le journal (log) (fichier du registre)
Description: Module compl&#233;mentaire pour g&#233;rer le fichier journal
(log); pr&#233;c&#233;dent et actuel de NVDA.
Version: 3.0
Langues: Anglais, Fran&#231;ais, Espagnol et Italien.
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p>J'ai oubli&#233;, la traduction en Fran&#231;ais et espagnol n&#8217;est pas incluse dans le module compl&#233;mentaire d'origine fait par l'auteur. <a href="https://cld.pt/dl/download/2a90b4de-21a1-4081-82b9-61bc76de7221/SaveLog-3.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire SaveLog-3.0.nvda-addon par ici:</a></p>
<h1 id="shortlink">ShortLink</h1>
<pre><code>Type: Extensions
R&#233;duire URL
Description: R&#233;duire URL: module compl&#233;mentaire pour utiliser Bitly
avec NVDA
Version: 2.0
Langues: Anglais, Fran&#231;ais, et Espagnol.
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/5777090e-fa96-454f-b481-942b840b50e4/ShortLink-2.0.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire ShortLink-2.0.nvda-addon par ici:</a></p>
<h1 id="specificsearch-mod">SpecificSearch mod</h1>
<pre><code>Type: Extensions
Recherche sp&#233;cifique mod
Description: Module compl&#233;mentaire pour rechercher le texte que vous
souhaitez rechercher dans des documents virtuels sp&#233;cifiques.
Version: 2.0
Langues: Anglais, Fran&#231;ais, et Espagnol.
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz
Maintenant le module compl&#233;mentaire Specific Search mod utilise les
touches: point et deux-pouints sur des sites Web avec aucune bo&#238;te
de dialogue
Une modif pour le module compl&#233;mentaire d&#233;velopp&#233; par Noelia Ruiz
Mart&#237;nez, avec quelques changements fait par Oriol G&#243;mez: il s&#39;agit
d&#39;un module compl&#233;mentaire pour rechercher du texte selon le titre
de la page.
Les modifications fait par Oriol G&#243;mez sont:
-Remplacement des raccourcis clavier pour (point et deux-points)
pour le rendre plus facile &#224; utiliser comme les touches de
navigation rapide, avec des filtres dynamiques pour s&#39;assurer que
vous &#234;tes en mode de navigation.
NVDA ne remplace pas le dernier texte rechercher pour une
recherche sp&#233;cifique. L&#39;autre module compl&#233;mentaire fait cela, et je
ne vois pas pourquoi. Il est plus commode d&#39;avoir NVDA Rechercher
son propre texte et d&#39;avoir une recherche sp&#233;cifique afin de
rechercher ce qu&#39;il veut sans remplacer le texte recherch&#233; de NVDA.
Enlev&#233; le texte %s non trouv&#233; de message dans la bo&#238;te de dialogue
et la remplac&#233; pour un appel au synth&#233;tiseur. </code></pre>
<p><a href="https://cld.pt/dl/download/12d2698c-e43b-4a81-9f6d-1aa3f122beb0/SpecificSearch%20mod.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire SpecificSearch mod.nvda-addon par ici:</a></p>
<h1 id="svox-pico-synthesizer">Svox-Pico-Synthesizer</h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Synth&#233;tiseur Svox Pico
Le module Svox-Pico installe le synth&#233;tiseur Open-Source Svox Pico
pour NVDA.
Auteur : Aleksey Sadovoy, Michael Curran
Version : 2011.2
Ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le
synth&#233;tiseur. </code></pre>
<p><a href="https://cld.pt/dl/download/06f983ab-9b31-4b82-87f8-1bbc7d4e3a99/Svox-Pico-Synthesizer.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire Svox-Pico-Synthesizer.nvda-addon par ici:</a></p>
<h1 id="switch_synth">switch_synth</h1>
<pre><code>Type: Extensions
Description: Basculer entre les synth&#233;tiseurs.
Raccourcis clavier:
NVDA+contr&#244;le+1 &#224; 4 du clavier alphanum&#233;rique ; s&#233;lectionner la
position,
NVDA+Ctrl+maj+s sauvegarder dans la position actuelle.
Version: 0.20130130.01
Auteur: Tyler Spivey </code></pre>
<p><a href="https://cld.pt/dl/download/c30f83cf-d221-4d60-a823-9f481955b923/switch_synth.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire switch_synth.nvda-addon par ici:</a></p>
<h1 id="tapin_radio">Tapin_Radio</h1>
<pre><code>Type: Extensions
TapinRadioStatusAnnouncer
Annonceur du Statut de TapinRadio
Description: Se module compl&#233;mentaire nous sert &#224; notifier le statut
de la chanson en cours de lecture que nous &#233;coutons dans TapinRadio
depuis n&#39;importe o&#249; dans le syst&#232;me
Appuyez sur: NVDA+maj+T
Pour afficher les informations de ce qui se joue,
et si vous appuyez sur cette m&#234;me commande deux fois rapidement, il
vous permet de maximiser la fen&#234;tre du programme.
Langues: Il prend en compte la langue du programme TapinRadio.
Version: 1.0
Auteur: Inconnu </code></pre>
<p><a href="https://cld.pt/dl/download/8e1f9fa5-dc10-4976-aba7-2752cc3aaf62/Tapin_Radio.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire Tapin_Radio.nvda-addon par ici:</a><br />
Remarque par BlindHelp: Le module TapinRadio utilise la m&#234;me commande que le module compl&#233;mentaire Instant Translate par d&#233;faut.<br />
Note : La commande ci-dessus peut &#234;tre chang&#233; depuis le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de commandes, dans la cat&#233;gorie Configuration.<br />
Gestes de commandes<br />
Dans ce dialogue, vous pouvez configurer les gestes de commandes<br />
(raccourcis clavier, boutons d'un afficheur braille etc) pour les commandes NVDA.<br />
Seules les commandes qui sont applicables imm&#233;diatement avant l'ouverture du dialogue sont affich&#233;es. Par exemple, si vous souhaitez personnaliser des commandes li&#233;es au mode navigation, vous devez ouvrir le dialogue des gestes de commandes lorsque vous &#234;tes en mode navigation. L'arborescence de ce dialogue r&#233;pertorie toutes les commandes NVDA applicables regroup&#233;es par cat&#233;gories.<br />
Vous pouvez les filtrer en entrant un ou plusieurs mots du nom de la commande dans la zone d'&#233;dition Filtrer par dans n'importe quel ordre. Tous les gestes associ&#233;s &#224; une commande sont &#233;num&#233;r&#233;s au niveau suivant la commande. Pour ajouter un geste &#224; une commande, s&#233;lectionnez la commande et appuyez sur le bouton &quot;Ajouter&quot;. Ensuite, effectuez le geste de commande que vous souhaitez associer, par exemple appuyez sur une touche du clavier ou un bouton sur l'afficheur braille. Parfois, un geste peut &#234;tre interpr&#233;t&#233; de plusieurs fa&#231;ons. Par exemple, si vous avez appuy&#233; sur une touche du clavier, vous voudrez peut-&#234;tre qu'elle soit sp&#233;cifique &#224; la configuration actuelle du clavier (par exemple,<br />
ordinateur de bureau ou ordinateur portable) ou vous voudrez peut-&#234;tre l'appliquer pour toutes les configurations. Dans ce cas, un menu appara&#238;t, vous permettant de s&#233;lectionner l'option d&#233;sir&#233;e. Pour supprimer un geste d'une commande, s&#233;lectionnez le geste et appuyez sur le bouton &quot;Supprimer&quot;. Lorsque vous avez termin&#233; vos modifications, appuyez sur le bouton &quot;OK&quot; pour les sauvegarder ou sur le bouton &quot;Annuler&quot; pour les ignorer.</p>
<h1 id="thunderbird">Thunderbird</h1>
<pre><code>Type: Extensions
Description du module compl&#233;mentaire Thunderbird Par Pierre-Louis:
J&#39;ai le plaisir de vous annoncer la sortie de la version 2.9.1 du
module compl&#233;mentaire Thunderbird pour NVDA d&#233;velopp&#233; par notre ami
Yannick.     
- Non compatible avec Windows XP.     
Encore plus de confort et d&#39;efficacit&#233; !&#160;
Jugez-en par vous-m&#234;me :
*: Lorsque l&#39;on presse la touche Puissance-2 dans la liste des
messages, le panneau de visualisation du texte du message est
automatiquement affich&#233; s&#39;il ne l&#39;est pas. Ceci garantit
l&#39;affichage du menu contextuel du module.
*: Le texte du message est filtr&#233; en mode lecture avec la barre
d&#39;espace : les en grands blocs d&#39;ent&#234;tes dans les citations de
messages sont remplac&#233;s par l&#39;expression:&#160; &quot;Nom de
l&#39;exp&#233;diteur a &#233;crit&quot;. NVDA annoncera &#233;galement &quot;lien cliquable&quot; &#224;
la place de la longue adresse du lien.
*: Lecture des citations dans leur ordre chronologique, du bas vers
le haut, via Majuscule+Espace.
Ceci permet de prendre une conversation en cours et d&#39;en lire son
historique dans le bon ordre.
*: Dans la liste des messages, un appui sur un chiffre du clavier
alphab&#233;tique &#233;nonce l&#39;ent&#234;te, deux appuis &#233;p&#232;le celui-ci et trois
appuis le copie dans le presse-papiers.
Exemple :
Si vous avez moins de 10&#160; colonnes :
1 du clavier&#160; alphanum&#233;rique renvoie&#160; l&#39;en t&#234;te&#160; exp&#233;diteur .
Alt+1 du clavier&#160; alphanum&#233;rique renvoie&#160; aussi l&#39;en t&#234;te
exp&#233;diteur
Si vous avez plus de 9 colonnes :
1 du pav&#233; alphanum&#233;rique renvoie&#160; l&#39;en t&#234;te&#160; exp&#233;diteur
Alt+1 du pav&#233; alphanum&#233;rique renvoie&#160; l&#39;ent&#234;te &#233;tiquette
Le module prend donc en compte l&#39;affichage maximale (18 ) de
colonne,
et la valeur renvoy&#233;e d&#233;pend &#233;galement de l&#39;ordre des colonnes .


*: Un appui sur 0&#160; &#233;nonce le nom et l&#39;adresse de l&#39;exp&#233;diteur du
message.
Deux appuis : affiche un menu contextuel qui reprend les noms du ou
des exp&#233;diteurs. Pour chacun d&#39;eux, un sous menu affiche le nom,
l&#39;adresse mail et le nom+l&#39;adresse mail. Un
appui avec Entr&#233;e sur un de ces &#233;l&#233;ments le copie dans
le presse-papiers. Ceci est tr&#232;s pratique pour extraire l&#39;adresse
personnelle d&#39;un exp&#233;diteur sur une liste de diffusion comme
YahooGroupes.
*: Lorsque vous ouvrez un message dans un nouvel onglet ou une
nouvelle fen&#234;tre, vous pouvez les quitter en pressant la touche
Echappe &#224; la place de Contr&#244;le+F4 ou Alt+F4.


Dans la fen&#234;tre de r&#233;daction d&#39;un message :
*: Signaler les fautes d&#39;orthographe : lorsque vous venez de
frapper un mot mal orthographi&#233;, NVDA peut vous le signaler via une
annonce vocale ou un son. Lorsqu&#39;une faute
d&#39;orthographe est signal&#233;e, repositionnez le curseur sur le mot,
pressez la touche Application et choisissez dans le menu un mot
propos&#233; en remplacement.
*: Dans le dialogue de correction orthographique, obtenu avec
Contr&#244;le+Majuscule+p :
NVDA+ 2appuis sur Tab : &#233;pelle le mot mal orthographi&#233;.


*: Les commandes de mise en forme du texte sont accessibles via le
menu contextuel Puissance-2.
*: A la cr&#233;ation d&#39;un nouveau message, NVDA passe sous silence le
tableau (il ne le dit plus )
&#160;&quot;r&#233;daction (sans sujet ) a &#233;t&#233; r&#233;duit avec simplement &quot;r&#233;daction&quot;
&#160;le document n&#39;est plus annonc&#233; si il n&#39;a pas le focus.
&#160;En un mot, quand on presse Contr&#244;le+n, NVDA annonce simplement
l&#39;essentiel.
&#160;*: Alt+1 annonce Exp&#233;diteur, Alt+2le nom de la pi&#232;ce jointe et
Alt+3 le champ Pour. Deux appuis place le focus sur un de ces
champs.
Alt+e place quant &#224; lui le focus sur le document &#160;


*: Contr&#244;le+b, Contr&#244;le+u et Contr&#244;le+i&#160; ont &#233;t&#233; vocalis&#233;s : un
appui donne l&#39;&#233;tat de l&#39;attribut gras, soulign&#233; ou italique&#160; et 2
appuis modifient son &#233;tat.


*: Onglet Fichiers enregistr&#233;s ouvert avec Contr&#244;le+J:
Le focus est directement plac&#233; sur le champ d&#39;&#233;dition de recherche,
raccourci&#160; contr&#244;le+k. Une tabulation suppl&#233;mentaire place le focus
sur la liste des pi&#232;ces jointes enregistr&#233;es.
Pressez la touche Application pour ouvrir le menu contextuel qui
vous facilitera l&#39;acc&#232;s au fichier.


Et enfin, le module est compatible avec Thunderbird 45.
Pour t&#233;l&#233;charger le module, rendez-vous sur la page ci-dessous puis
pressez deux tabulations :</code></pre>
<p><a href="http://www.rptools.org/Outils-DV/NVDA-Thunderbird.html">Page Web du module Thunderbird pour NVDA.</a><br />
Bonne d&#233;couverte ! Pierre-Louis</p>
<pre><code>Version&#160;: 2.9.1 - Non compatible avec Windows XP. 
Auteur&#160;: Yannick
Documentation : Pierre-Louis </code></pre>
<p><a href="http://www.rptools.org/Outils-DV/">Visitez son site Outils-DV Pour plus d'informations</a><br />
Derni&#232;re mise &#224; jour le 23 Juin 2016 <a href="http://www.rptools.org/?p=854">T&#233;l&#233;charger le module compl&#233;mentaire thunderbird-2.9.1.nvda-addon par ici: [lien externe]</a></p>
<h1 id="virtual-revision">Virtual Revision</h1>
<pre><code>Type: Extensions
R&#233;vision virtuelle
Ce module permet aux utilisateurs de NVDA de r&#233;visez le contenu
d&#39;une fen&#234;tre dans une zone de texte, de la m&#234;me mani&#232;re qu&#39;avec la
virtualisation de la fen&#234;tres de Jaws pour Windows. A notez
cependant que ceci n&#39;est qu&#39;une facilit&#233; pour les utilisateurs et
&quot;ne&quot; remplace pas l&#39;excellent support pour les modes de revue de
NVDA ou la navigation par objets.
Utilisation
Appuyez sur NVDA+contr&#244;le+w pour ouvrir la fen&#234;tre de
r&#233;vision virtuelle. Puis naviguez simplement dans la zone de texte
affich&#233;e comme vous feriez dans n&#39;importe quel texte. Vous pouvez
appuyer sur &#201;CHAP pour fermer la fen&#234;tre de r&#233;vision virtuelle.
Version: 2.0-dev
Auteurs : Rui Batista et l&#39;&#233;quipe de la communaut&#233; des modules
compl&#233;mentaires NVDA
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://cld.pt/dl/download/06e53354-8f4b-4805-8494-6c149a463d42/virtualRevision-2.0-dev.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire virtualRevision-2.0-dev.nvda-addon par ici:</a><br />
Quelques notes a propos du module compl&#233;mentaire virtualRevision version 2.0-dev</p>
<pre><code>1.- Fonctionnement du module compl&#233;mentaire virtualRevision-2.0-dev.nvda-addon:

Avec la commande : NVDA+Ctrl+W.

Une fen&#234;tre similaire au bloc-notes, s&#39;ouvre avec le texte
    d&#39;information qui se trouve sur l&#39;&#233;cran.

Nous pouvons passer &#224; travers elle, avec les commandes
    de lecture.

Nous pouvons s&#233;lectionner et copier des informations.

Pour fermer il faut Appuyez sur la touche Echap.

2.- Exemple:

Nous sommes all&#233;s &#224; ordinateur sous W7, ou poste de travail sous
    Windows XP, nous cherchons disque locale c),

Nous avons appuyez sur ALT + entr&#233;e, pour avoir les propri&#233;t&#233;s.

Avec la commande NVDA+B , nous pouvons lire toutes les
    informations, mais avec l&#39;&#233;cran virtuel, NVDA+Ctrl+W,</code></pre>
<p>nous pouvons lire les informations &#224; l'aide des touches, s&#233;lectionner... copier...</p>
<pre><code>Remarques par BlindHelp:
Ce compl&#233;ment pour moi est tr&#232;s fonctionnel...
J&#39;esp&#232;re que tr&#232;s bient&#244;t nous pourrons progresser &#224; travers les
fen&#234;tres avec le curseur de la souris...</code></pre>
<h1 id="vlc">VLC</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation du
lecteur multim&#233;dia VLC avec NVDA. Il apporte les fonctions suivantes :
script pour annoncer la dur&#233;e du m&#233;dia d&#233;j&#224; lue,
script pour annoncer la dur&#233;e du m&#233;dia restante &#224; lire,
script pour annoncer la dur&#233;e totale du m&#233;dia,
script pour annoncer la vitesse courante,
annonce automatique des changements d&#39;&#233;tats comme la mise en pause
ou coupure du son,
scripts pour la relance de la lecture.
La liste des commandes est obtenue par Control+NVDA+H
Pour plus d&#39;informations, </code></pre>
<p><a href="http://www.nvda-fr.org/addons/vlc.html">veuillez consulter l'aide du module par ici:</a><br />
Auteurs : Daniel Poiraud, PaulBer19<br />
Version : 2.3.1<br />
Langues: Anglais, Fran&#231;ais Espagnol.<br />
Traduit en espagnol par R&#233;my Ruiz<br />
Derni&#232;re mise &#224; jour: 25 Juin 2015<br />
<a href="https://cld.pt/dl/download/49615208-e473-4900-b470-524f3c7350b4/vlc%20v2.3.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire vlc v2.3.1.nvda-addon par ici:</a></p>
<h1 id="weather-plus">Weather Plus</h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire ajoute la temp&#233;rature locale et les
pr&#233;visions m&#233;t&#233;o &#224; 24 heures actuelles et les pr&#233;visions jusqu&#39;&#224; 9
jours suppl&#233;mentaires pour NVDA.
UTILISATION :
Appuyez sur NVDA + w pour la temp&#233;rature actuel et les conditions
m&#233;t&#233;o.
Appuyez sur NVDA + maj + W pour les pr&#233;visions &#224; 24 heures et les
pr&#233;visions jusqu&#39;&#224; 9 jours.
Appuyez sur NVDA + maj + contr&#244;le + w pour d&#233;finir une ville
temporaire.
Appuyez sur NVDA + alt + w pour conna&#238;tre la derni&#232;re mise &#224; jour du
bulletin m&#233;t&#233;o.
Appuyez sur Contr&#244;le + maj + w pour basculer entre Fahrenheit,
Celsius ou Kelvin.
Attention !
Lisez la documentation disponible dans le menu Pr&#233;f&#233;rences,
Param&#232;tres Weather Plus pour obtenir des instructions sur la fa&#231;on
de configurer le module compl&#233;mentaire Weather Plus
Nom de l&#39;auteur :&#160;Adriano Barbieri
Traduit et mis &#224; jour par Adriano Barbieri </code></pre>
<p><script type="text/javascript">
<!--
h='&#x79;&#x61;&#104;&#x6f;&#x6f;&#46;&#x69;&#116;';a='&#64;';n='&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;&#32;&#40;&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;&#32;&#x61;&#116;&#32;&#x79;&#x61;&#104;&#x6f;&#x6f;&#32;&#100;&#x6f;&#116;&#32;&#x69;&#116;&#x29;</noscript><br />
Localis&#233; en : Tch&#232;que, Anglais, Fran&#231;ais, Galicien, Allemand, Italien, Portugais-Br&#233;sil, Portugais-Portugal, Russe, Espagnol, Slovaque, Serbe, Croate, Allemand.<br />
Traducteurs : Es par Pablo Vargas, Fr par R&#233;my Ruiz, Ru par Alex Yeshanu, Cs par Vitek Jirasekovi(Tapin), Sk par Peter Halada, pt_Br par Adair Knaesel, Sr par Ga&#353;i&#263; Dejan, Gl par Ivan Novegil Cancelas, pt_Pt par &#194;ngelo Miguel Abrantes, hr par Gordan Radi&#263;<br />
Publi&#233; sous la GNU GPL (General Public License)<br />
Version&#160;: 3.9<br />
Derni&#232;re mise &#224; jour: 21 Ao&#251;t 2016<br />
<a href="http://www.nvda.it/system/files/plugin/weather_plus3.9.nvda-addon?download=1">T&#233;l&#233;charger le module compl&#233;mentaire Weather Plus3.9.nvda-addon par ici: [lien externe]</a> <a href="https://dl.dropboxusercontent.com/u/5251169/Weather%20Plus3.9.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire Weather Plus3.9.nvda-addon par ici: [lien externe] alternatif</a> <a href="http://www.nvda.it/weather-plus">Page Web en Italien du module compl&#233;mentaire Weather Plus:</a></p>
<h1 id="windows7magnifier">windows7magnifier</h1>
<pre><code>Type: Extensions
Loupe de Windows 7
Incorporation de la loupe de Windows 7 &#224; l&#39;interface graphique de
NVDA
Langue: Anglais, Fran&#231;ais, Espagnol et N&#233;palais.
Traduit en fran&#231;ais par R&#233;my Ruiz
Description: Ce module compl&#233;mentaire int&#232;gre des options de
configurati&#243;n a l&#39;interface graphique standard de NVDA.
Pour acc&#233;der, allez dans Pr&#233;f&#233;rences, Param&#232;tres de la loupe, dans
le menu de NVDA.
Raccourci clavier:
NVDA- + MAJ + g: activer ou d&#233;sactiver la loupe.
NVDA- + i: changer l&#39;inversion des couleurs.
NVDA- + signe plus: approcher.
NVDA + signe moins: &#233;loigner.
Auteur: Dominic Canare </code></pre>
<p><script type="text/javascript">
<!--
h='&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#100;&#x6f;&#x6d;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;&#32;&#40;&#100;&#x6f;&#x6d;&#32;&#x61;&#116;&#32;&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript><br />
Version: 1.1.1 <a href="https://cld.pt/dl/download/65087c90-330b-4059-9528-2ad1b6cc2076/windows7magnifier-1.1.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire windows7magnifier-1.1.1.nvda-addon par ici:</a></p>
<h1 id="windows-mail">Windows Mail</h1>
<pre><code>Type: Extensions
Ce module a &#233;t&#233; test&#233; avec Windows 7 et NVDA 2014.4 et suivants.
Depuis la version 1.2:
- la pr&#233;sence de pi&#232;ces jointes est indiqu&#233;e par un signal sonore, &#224;
condition que le volet de lecture soit affich&#233;,
- quand on se d&#233;place dans l&#39;arborescence par fl&#232;ches ou l&#39;initiale
des dossiers, le focus qui va automatiquement dans la liste des
messages, est ramen&#233; dans l&#39;arborescence. Il peut arriver que ce
retour ne se fasse pas, vous le saurez car dans ce cas, la ligne du
message s&#233;lectionn&#233; sera lue.
La liste des raccourcis-clavier est obtenue par NVDA +Control +H.
Elle est &#233;galement disponible dans ladocumentation, que vous
trouverez dans la boite de dialogue &quot;Gestionnaire de modules
compl&#233;mentaires&quot;. </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.1<br />
Derni&#232;re mise &#224; jour: 22 Janvier 2016<br />
<a href="https://cld.pt/dl/download/ae997fe4-91fb-420d-836c-cb4ea390d584/windowsmail_v2.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire windowsmail_v2.1.nvda-addon par ici:</a><br />
Derni&#232;re mise &#224; jour du module compl&#233;mentaire Windows Mail<br />
la vocalisation de la boite de dialogue de correction orthographique a &#233;t&#233; am&#233;lior&#233;e : on a d&#233;sormais en toutes circonstances, la lecture et l'&#233;pellation du mot mal orthographi&#233;, puis du mot propos&#233;.<br />
La commande Alt +O avec le module compl&#233;mentaire Windows Mail, permet de relire ces informations et d'obtenir le nombre de suggestions propos&#233;es.<br />
Les utilisateurs du correcteur orthographique ne manqueront pas de faire cette mise &#224; jour.<br />
Note: Suite a une correction fait par l'auteur le module compl&#233;mentaire Windows Mail est donc la 2.3 et non la 2.2.<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.3<br />
Derni&#232;re mise &#224; jour: 31 Janvier 2016<br />
<a href="https://cld.pt/dl/download/66c8068f-f23b-46f3-bbdf-72349f3a693d/windowsmail_v2.3.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire windowsmail_v2.3.nvda-addon par ici:</a></p>
<h1 id="winword-spanish">winword-spanish</h1>
<pre><code>Type: Extensions
Se module compl&#233;mentaire c&#39;est pour &#234;tre utiliser avec le programme
Microsoft Word dans une version hispanophone uniquement.
Description:Module compl&#233;mentaire en espagnol pour les commandes de
Word
C&#39;est un module compl&#233;mentaire pour verbaliser les commandes de
Word.
Commande: NVDA+control+h, ouvre la liste des commandes configurer.
Auteur: Angelo Miguel Abrantes, corriger par Manuel Eduardo Cort&#233;z
Vallejo, et modifier et compil&#233; par Tjaguar
Version: 1.2 </code></pre>
<p><a href="https://cld.pt/dl/download/b8c86a42-7e0a-48d4-8033-cc16f30a209d/winword-spanish1.2.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire pour Microsoft Word uniquement en espagnol par ici:</a></p>
<h1 id="wlm">WLM</h1>
<pre><code>Type: Extensions
Le module propos&#233; est utilisable avec Windows 7 &#224; 10, Windows Live
Mail 2009 &#224; 2012, NVDA 2015.4.
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation de WLM
2009 et 2012. Il comporte d&#233;sormais la possibilit&#233; d&#39;entrer les
adresses dans la fen&#234;tre de r&#233;daction en utilisant la fen&#234;tre
d&#39;autocompl&#233;tion, qui est inaccessible avec NVDA ou Jaws. On ne
vocalise que les adresses &#233;lectroniques, pas le nom associ&#233;.
Quelques commandes ont &#233;t&#233; ajout&#233;es pour la fen&#234;tre de r&#233;daction,
par exemple pour l&#39;ouverture de la boite de dialogue pour la
s&#233;lection des contacts, et le d&#233;placement du focus dans la zone de
r&#233;daction
Une documentation est d&#233;sormais disponible dans la boite de dialogue
&quot;Gestionnaire de modules compl&#233;mentaires&quot;. Vous pourrez y trouver la
liste des commandes, et la pr&#233;sentation des manipulations pour
entrer des adresses. </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Live Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.3<br />
Derni&#232;re mise &#224; jour: 10 Janvier 2016<br />
<a href="https://cld.pt/dl/download/d21d91c9-677f-40d9-9eb4-b7898e9af1b1/wlmail_v2.3.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire wlmail_v2.3.nvda-addon par ici:</a><br />
Derni&#232;re mise &#224; jour du module compl&#233;mentaire WLM<br />
la vocalisation de la boite de dialogue de correction orthographique a &#233;t&#233; am&#233;lior&#233;e : on a d&#233;sormais en toutes circonstances, la lecture et l'&#233;pellation du mot mal orthographi&#233;, puis du mot propos&#233;.<br />
La commande Alt +A avec le module compl&#233;mentaire WLM, permet de relire ces informations et d'obtenir le nombre de suggestions propos&#233;es.<br />
Les utilisateurs du correcteur orthographique ne manqueront pas de faire cette mise &#224; jour. <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Live Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.4<br />
Derni&#232;re mise &#224; jour: 28 Janvier 2016<br />
<a href="https://cld.pt/dl/download/8e1c9856-a5bb-426d-b50e-8ab40131027a/wlmail_v2.4.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire wlmail_v2.4.nvda-addon par ici:</a></p>
<h1 id="word">Word</h1>
<pre><code>Type: Extensions
pour les personnes qui ont install&#233; une version pr&#233;c&#233;dente de NVDA,
vous pouvez utiliser l&#39;ancienne version du module compl&#233;mentaire:
word 2.4.nvda-addon
pour les personnes qui ont install&#233; la version de NVDA 2016.1 , vous
pouvez utiliser la nouvelle version 3.1 du module compl&#233;mentaire,
voir ci-dessous sa description.
Description de l&#39;ancienne version 2.4 du module compl&#233;mentaire
pour&#160;&#160; Microsoft Word.
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation du
traitement de texte MSWord avec NVDA. Il apporte les fonctions
suivantes :
la commande clavier &quot;NVDA+alt+F5&quot; pour obtenir la liste de divers
objets Word (commentaires, modifications, signets,...),
la commande clavier &quot;NVDA+alt+F6&quot; pour connaitre suivant le cas: le
num&#233;ro de ligne et de page de la position du curseur syst&#232;me, le
d&#233;but et la fin de la s&#233;lection, ou le num&#233;ro de ligne et colonne de
la cellule courante d&#39;un tableau
la commande clavier &quot;NVDA+alt+c&quot;frapp&#233;e deux fois pour ins&#233;rer un
commentaire ,
la commande clavier &quot;NVDA+alt+n&quot; pour lire la note de bas de page ou
la note de fin &#224; la position du curseur,
la commande clavier &quot;NVDA+alt+r&quot; pour lire la modification de texte
&#224; la position du curseur,
ajout dans les scripts de base &quot;Control+Fl&#232;che bas&quot; et
&quot;control+fl&#232;che haut &quot; ( D&#233;placement de paragraphe en paragraphe),
le saut des paragraphes vides (configurable),
les scripts pour se d&#233;placer dans un tableau ou lire ses &#233;l&#233;ments
(ligne, colonne, cellule), - l&#39;annonce des changements de niveau de
titre (commande clavier &quot;maj +alt +fl&#232;che droite&quot; ou &quot;maj + alt+
fl&#232;che gauche&quot;.
la possibilit&#233; de naviguer plus rapidement dans le document, - le
d&#233;placement de phrase en phrase (commandes clavier &quot;alt+ fl&#232;che bas&quot;
et &quot;alt+ Fl&#232;che haut&quot;).
Pour plus d&#39;informations, </code></pre>
<p><a href="http://www.nvda-fr.org/addons/word.html">veuillez consulter l'aide du module par ici:</a><br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 2.4<br />
Ancienne mise &#224; jour: 18 Juin 2015<br />
<a href="https://cld.pt/dl/download/eb058fda-7613-45f4-84b0-e596f9e716c6/word%202.4.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire word 2.4.nvda-addon par ici:</a><br />
Nouvelle mise &#224;&#160; jour du module compl&#233;mentaire pour&#160;&#160; Microsoft Word.<br />
Compatibilit&#233;: Cette version du module n'est pas compatible avec les versions ant&#233;rieures &#224; NVDA 2016.1. Elle a &#233;tait test&#233; avec les version 2016.1 de NVDA, Microsoft Word 2003 , 2007 et 2013 , sous Windows XP , Windows 7, Windows 8.1 et Windows 10.<br />
pour les personnes qui ont install&#233; une version pr&#233;c&#233;dente de NVDA, vous pouvez utiliser l'ancienne version du module compl&#233;mentaire:<br />
word 2.4.nvda-addon<br />
Voir ci-dessus sa description.<br />
Description de la nouvelle version 3.1 du module compl&#233;mentaire pour&#160;&#160; Microsoft Word.<br />
Son principal objectif est d'&#234;tre conforme &#224; NVDA 2016.1 et les changements principaux sont:<br />
ajout de l'annonce de la colonne pour la commande clavier &quot;alt + &#233;ffacement &quot;,<br />
suppression des scripts de d&#233;placement rapide propre au module<br />
(doublon avec le mode de navigation de NVDA),<br />
suppression des scripts pour annoncer au second appui le titre des lignes ou colonnes (utilisation maintenant de l'option incluse dans NVDA),,<br />
changement de commande clavier: &quot;nvda+control+f6&quot; en &quot;alt+effacement&quot; et nvda + numpad effacement&quot;,<br />
indication de la position par rapport au bord gauche et sup&#233;rieur (commande &quot;alt + effacement&quot;&quot;, &quot;alt + numpad effacement&quot;),<br />
ajout de la recherche des objets dans la page courante (commande nvda+alt+f5).<br />
Pour rappel:<br />
Ce module compl&#232;te les scripts int&#233;gr&#233;s dans la version de base de NVDA et apporte:<br />
la commande clavier &quot;NVDA+alt+F5&quot; pour obtenir la liste de divers objets Word (commentaires, modifications, signets,...),<br />
la commande clavier &quot;Alt+effacement&quot; pour connaitre suivant le cas:<br />
le num&#233;ro de ligne, colonne et de page de la position du curseur syst&#232;me,&#160; le d&#233;but&#160; et la fin de la s&#233;lection, ou le num&#233;ro de ligne et colonne de la cellule courante d'un tableau(avec indication &#233;ventuelle de la position par rapport&#160; au bord gauche&#160; et sup&#233;rieur),<br />
la&#160; commande clavier &quot;NVDA+majuscule+alt+ c&quot; pour ins&#233;rer un commentaire&#160; &#224; la position du curseur,,<br />
la commande clavier &quot;NVDA+alt+n&quot; pour lire la note de bas de page ou de fin &#224; la position du curseur,<br />
la commande clavier &quot;NVDA+alt+r&quot; pour lire la modification de texte &#224; la position du curseur,<br />
ajout dans les scripts de base&#160; de d&#233;placement de paragraphe en paragraphe (&quot;Control+Fl&#232;che bas ou haut&quot;), la possibilit&#233; configurable&#160; de sauter&#160; les paragraphes vides,<br />
les scripts pour se d&#233;placer dans un tableau ou lire ses &#233;l&#233;ments (ligne, colonne, cellule),<br />
l'annonce des changements de niveau de titre lors de l'utilisation des commandes clavier &quot;majuscule + alt +fl&#232;che&#160; droite ou gauche&quot; de Word,<br />
compl&#232;te le mode &quot;navigation&quot; de NVDA par de nouvelles commandes propre &#224; Microsoft Word,<br />
le d&#233;placement de phrase en phrase (commandes clavier &quot;alt+ fl&#232;che bas ou haut&quot; .<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 3.1<br />
Derni&#232;re mise &#224; jour: 10 Avril 2016<br />
<a href="https://cld.pt/dl/download/6e5e90cf-8a3f-4127-a75b-fd8306618520/word%203.1.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire word 3.1.nvda-addon par ici:</a></p>
<h1 id="word-count">Word-Count</h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire word count Comptage de mots
Version: 1.0
Auteur: Oriol G&#243;mez
Langues: Anglais, Fran&#231;ais et Espagnol
Traduit en fran&#231;ais par R&#233;my Ruiz
Description: comptage de mots lorsque vous s&#233;lectionnez du texte et
vous appuyez sur NVDA + maj + W </code></pre>
<p><a href="https://cld.pt/dl/download/4d82774d-cb09-4481-98da-3d65bf3173af/word-count.nvda-addon?download=true">T&#233;l&#233;charger le module compl&#233;mentaire word-count.nvda-addon par ici:</a></p>
<hr />
<p>Vous pouvez aussi t&#233;l&#233;charger l'ensemble des Modules compl&#233;mentaires pour NVDA en archive zip via MEO Cloud <a href="https://cld.pt/dl/zipdir/fd9fec6b-11d7-4d60-b04c-093fd2bf93f7/Modules%20NVDA.zip?download=true">Pour cela cliquez par ici:</a><br />
Nom du fichier &#224; t&#233;l&#233;charger:<br />
Modules NVDA.zip<br />
Je vous souhaite un bon t&#233;l&#233;chargement!</p>
<hr />
<h4 id="references_des_liens_externes">4. R&#233;f&#233;rences des liens externes:</h4>
<hr />
<div>
<p>Voici quelques liens externes ou trouver des modules compl&#233;mentaires que peut-&#234;tre ils ne sont pas list&#233; ici:</p>
</div>
<p><a href="http://www.nvda-fr.org/addons/">Page de t&#233;l&#233;chargement pour les Modules Compl&#233;mentaires dans le site francophone</a> <a href="http://www.accessibiliteprogrammes.fr/modulesNVDA.php">Page de t&#233;l&#233;chargement pour les Modules Compl&#233;mentaires dans le site Accessibilit&#233;-Programmes de notre ami Corentin</a> <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Visitez la page d&#233;di&#233; aux Modules Compl&#233;mentaires dans le site AVH Angoul&#234;me</a> <a href="http://addons.nvda-project.org/">Page principal du site comunautaire des modules compl&#233;mentaires NVDA pour t&#233;l&#233;charger les AddOns pour NVDA</a> <a href="http://jeff.tdrealms.com/NVDA.htm">Page de Jeff en anglais qui rassemble aussi des modules compl&#233;mentaires &#224; t&#233;l&#233;charger pour NVDA</a></p>
<hr />
<h1 id="sp&#233;cial-merci-&#224;">Sp&#233;cial Merci &#224; :</h1>
<p>A mes amis Patrick Zajda, Michel Such et Bachir Benanou ;<br />
Merci de m'avoir donner leurs conseils bien averti de la fa&#231;on de Comment traduire un module compl&#233;mentaire pour NVDA<br />
et Merci d'avoir rep&#233;r&#233; tous les points faibles dans la traductions de ceux-ci en fran&#231;ais y compris leurs pages Web d&#233;dier qui se trouve sur<br />
le site comunautaire des modules compl&#233;mentaires NVDA... et de les avoir corriger ...<br />
Encore un grand Merci &#224; eux !<br />
Voila un clin d'&#339;il !</p>
<hr />
<p>Je vous remercie pour votre visite dans le coffre des Modules Compl&#233;mentaires de NVDA!!!<br />
Et si vous le souhaitez vous pouvez laisser votre commentaire! <a href="http://blindhelp.blogspot.fr/2013/02/le-coffre-des-modules-complementaires.html">Pour cela cliquez par ici!</a><br />
Et si vous le souhaitez vous pouvez aussi visiter le blog de BlindHelp!<br />
<a href="http://blindhelp.blogspot.fr/">Pour cela cliquez par la!</a><br />
Sur ce, je vous dit &#224; tr&#232;s bient&#244;t, donc!!!<br />
@+<br />
BlindHelp !!!</p>
<hr />
</div>
<p>Derni&#232;re mise &#224; jour : 22/08/2016</p>
</div>
</body>
</html>
