<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title>Le coffre des Modules Compl&#233;mentaires pour NVDA</title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="../style.css" type="text/css" />
</head>
<body>
<div id="header">
<h1 class="title">Le coffre des Modules Compl&#233;mentaires pour NVDA</h1>
</div>
<audio autoplay="autoplay" preload="auto">
<source src="https://blindhelp.github.io/sweep.wav" type="audio/wav" />
</audio>
<footer>
Derni&#232;re mise &#224; jour le Lundi 21 Janvier 2019
</footer>
<hr />
<h1 id="le-coffre-des-modules-compl&#233;mentaires-pour-nvda">Le coffre des Modules Compl&#233;mentaires pour NVDA</h1>
<p><br />
Coucou mes amis du blog de BlindHelp!!!<br />
Bienvenue sur le coffre des Modules Compl&#233;mentaires pour NVDA!!!</p>
<p>Ici vous retrouvez la plus part des modules compl&#233;mentaires regrouper par mes soins pour NVDA!!!</p>
<div>
<a href="#vous_pouvez_consulter_la_liste">Vous pouvez consultez la liste</a> puis les t&#233;l&#233;chargez! En tout cas je vous donne les plus utile pour moi!!! Il se peut que certain modules compl&#233;mentaires ils ne sont pas list&#233;; peut-&#234;tre parsque j'ai jug&#233; qu'ils ne sont pas tr&#232;s utile; ou parsque je n'avez aucunne id&#233;e de leurs existences!!! Donc si vous ne trouvez pas votre module complementaire ad&#233;quat list&#233; plus bas, mille merci de consulter la section
<div>
<p><a href="#references_des_liens_externes">R&#233;f&#233;rences des liens externes</a>, afin de trouvez votre bonheur!!! Et si vous souhaitez que un module compl&#233;mentaire figure ici! faites-le savoire SVP!!!pour cela envoyez-moi un courriel en cliquant sur l'adresse qui se trouve en bas: <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;&#32;&#40;&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Merci par avance pour votre contribution!!!<br />
N'oubliez pas surtout avant d'installer un module compl&#233;mentaire, que vous devez d'abord installer le lecteur d'&#233;cran en opensource nomm&#233;: NVDA.</p>
<p><br />
Vous pouvez obtenir la derni&#232;re version de NVDA <a href="http://www.nvda-project.org/">depuis la page du site officiel en anglais d&#233;dier &#224; le lecteur d'&#233;cran en opensources NVDA:</a><br />
et une fois t&#233;l&#233;chargez le fichier, validez sur le .exe puis suivre le programme d'installation qui est enti&#232;rement vocaliser.</p>
<p><br />
Vous pouvez aussi t&#233;l&#233;charger la derni&#232;re version de NVDA <a href="http://www.nvda-fr.org/">depuis la page francophone d&#233;dier &#224; le lecteur d'&#233;cran en opensources nomm&#233; NVDA:</a><br />
N'oubliez pas de consulter cette page pour voir la derni&#232;re version de NVDA en date!!!</p>
<p><br />
Donc, maintenant vous pouvez consulter puis t&#233;l&#233;charger les modules compl&#233;mentaires depuis les liens directes, list&#233; plus bas!!!</p>
<p><br />
Il inclus les modules compl&#232;mentaires donner par notre ami Michel Such qui c&#232;de le poste &#224; partir du 15/08/2018, &#224; une partie de l'&#233;quipe en charge du site <a href="https://www.progaccess33.net/">ProgAccess</a>, Corentin pour toute la partie codage et maintien &#224; jour du site, et Pascal pour la partie graphique, donc vous pouvez consulter <a href="https://www.nvda-fr.org/addons.php">la page francophone d&#233;dier &#224; les modules compl&#233;mentaires par ici:</a> C'est donc d&#232;s l'heure une toute nouvelle &#233;quipe qui va apporter un coup de jeune au site, tout en gardant l'intuitivit&#233; et la simplicit&#233; &#224; laquelle Michel Such a toujours su faire preuve. N'oubliez pas de consulter cette page pour voir les nouveaut&#233;s!!!</p>
<p><br />
Mille merci &#224; lui et la nouvelle &#233;quipe pour leurs partage!!!</p>
<p><br />
Le coffre des Modules Compl&#233;mentaires pour NVDA inclus aussi des modules compl&#233;mentaires fait par des autres membres de la liste de N-V-D-A en espagnol ainsi que des gars de la liste de NVDA en anglais, etc, etc...</p>
<hr />
<h3 id="quest-ce-quun-module-compl&#233;mentaire">Qu'est-ce qu'un Module Compl&#233;mentaire ?</h3>
<p><a href="https://www.nvaccess.org/">NVDA</a> est un lecteur d'&#233;cran tr&#232;s souple et extensible. Les modules compl&#233;mentaires pour NVDA sont des scripts additionnels qui peuvent &#234;tre t&#233;l&#233;charg&#233;s et int&#233;gr&#233;s &#224; votre copie de NVDA afin d'am&#233;liorer ou d'ajouter des fonctionnalit&#233;s. Ces modules compl&#233;mentaires peuvent inclure des fonctionnalit&#233;s et des commandes suppl&#233;mentaires qui peuvent &#234;tre utilis&#233;es partout, am&#233;liorant le support d'un programme ou ajoutant un support pour un nouveau terminaux braille ou un synth&#233;tiseur vocal.</p>
<hr />
<h2 id="comment-installer-les-modules-complementaires-pour-nvda">1. Comment installer les modules complementaires pour NVDA?</h2>
<p>Instructions pour l'installation<br />
Vous pouvez installer un module compl&#233;mentaire en proc&#233;dant comme suit.</p>
<ol style="list-style-type: decimal">
<li>Ouvrir le menu de NVDA, pour cela appuyez sur les touches: &quot;NVDA+N&quot;</li>
<li>Aller sur &quot;Outils&quot;</li>
<li>Ensuite aller sur &quot;Gestion des modules compl&#233;mentaires&quot; Il s'ouvre une bo&#238;te de dialogue donc vous devez choisir &quot;Installer&quot;, donc vous devez Appuyez sur tab jusqu'&#224; ce que vous obtenez ce bouton, ensuite appuyez sur espace ou entr&#233;e pour l'activer</li>
<li>et dans cette nouvelle bo&#238;te de dialogue parcourez votre disque dure pour trouver le module compl&#233;mentaire que vous souhaitez installer Dans cette bo&#238;te de dialogue, il y &#224; le bouton Ouvrir afin d'ouvrir le module compl&#233;mentaire, que ont souhaite installer.</li>
<li>Apr&#232;s avoir cliquer sur le bouton &quot;Ouvrir&quot; une bo&#238;te de dialogue d'avertissement vous demandera de confirmer l'installation. Cliquez sur Oui ;</li>
<li>Une fois fini l'installation il faut Tabulez jusqu'au bouton &quot;Fermer&quot;</li>
<li>et appuyez sur espace ou Entr&#233;e.</li>
<li>Red&#233;marrez NVDA lorsque c'est demand&#233;. en tout cas c'est une bonne id&#233;e de red&#233;marrer en particulier si vous installer d'autres voix</li>
</ol>
<hr />
<h2 id="note-importante-&#224;-propos-de-linstallation-des-modules-compl&#233;mentaires-pour-nvda"><strong>2. Note importante &#224;-propos de l'installation des modules compl&#233;mentaires pour NVDA</strong></h2>
<p>Les modules compl&#233;mentaires peuvent &#234;tre ajout&#233;s &#224; une version installable ou &#224; une version portable de NVDA.</p>
<p>Notez bien que les modules compl&#233;mentaires peuvent avoir acc&#232;s &#224; vos donn&#233;es, n'installez donc que des modules compl&#233;mentaires provenant de source s&#251;re.</p>
<p>Pour installer les modules compl&#233;mentaires pour NVDA, ont peut le fair directement si nous avons installer au pr&#233;alable la version 2012.3 ou plus r&#233;cente de NVDA, pour cela il suffit de valider sur le fichier avec l'extension .nvda-addon, pour installer les module compl&#233;mentaire directement depuis l'explorateur ou &#224; la fin du t&#233;l&#233;chargement depuis votre navigateur. S'il s'agit de l'actualisation d'un module compl&#233;mentaire d&#233;j&#224; installer, je conseil fortement plut&#244;t de supprimer l'ancienne version du module compl&#233;mentaire; et installer la nouvelle version de celui-ci, que de faire l'actualisation directement du module compl&#233;mentaire concerner. Pour moi cette proc&#233;dure est plus fiable et prope.</p>
<hr />
<h2 id="comment-d&#233;sinstaller-un-module-compl&#233;mentaire">3. Comment D&#233;sinstaller un Module Compl&#233;mentaire ?</h2>
<p>Pour d&#233;sinstaller un module compl&#233;mentaire, proc&#233;dez comme suit :</p>
<ol style="list-style-type: decimal">
<li>Ouvrez le menu de NVDA, avec NVDA+N;</li>
<li>Descendez jusqu'au sous-menu Outils et appuyez sur entr&#233;e ou fl&#232;che droite pour l'ouvrir;</li>
<li>Trouvez l'&#233;l&#233;ment &quot;G&#233;rer les modules compl&#233;mentaires&quot; et appuyez sur Entr&#233;e ;</li>
<li>Le dialogue s'ouvre sur une liste d&#233;roulante contenant tous les modules install&#233;s, faites-la d&#233;filer jusqu'&#224; trouver le module que vous d&#233;sirez d&#233;sinstaller ;</li>
<li>Cliquez sur le bouton &quot;Supprimer&quot; ;</li>
<li>Apr&#232;s avoir cliqu&#233; sur le bouton, un dialogue d'avertissement vous demandera de confirmer la d&#233;sinstallation. Cliquez sur Oui ;</li>
<li>Faites ceci jusqu'&#224; ce que vous ayez d&#233;sinstall&#233; tous les modules compl&#233;mentaires d&#233;sir&#233;s ;</li>
<li>Pour finir, Tabulez jusqu'au bouton &quot;Fermer&quot; et appuyez sur Entr&#233;e. Red&#233;marrez NVDA lorsque demand&#233;.</li>
</ol>
<hr />
<h2 id="comment-d&#233;sactiver-un-module-compl&#233;mentaire">4. Comment d&#233;sactiver un Module Compl&#233;mentaire ?</h2>
<p>Pour d&#233;sactiver un module compl&#233;mentaire, proc&#233;dez comme suit :</p>
<ol style="list-style-type: decimal">
<li>Ouvrez le menu de NVDA, avec NVDA+N;</li>
<li>Descendez jusqu'au sous-menu Outils et appuyez sur entr&#233;e ou fl&#232;che droite pour l'ouvrir; 3 Trouvez l'&#233;l&#233;ment &quot;G&#233;rer les modules compl&#233;mentaires&quot; et appuyez sur Entr&#233;e ;</li>
<li>Le dialogue s'ouvre sur une liste d&#233;roulante contenant tous les modules install&#233;s, faites-la d&#233;filer jusqu'&#224; trouver le module que vous d&#233;sirez d&#233;sactiver ;</li>
<li>Cliquez sur le bouton &quot;D&#233;sactiver&quot; ;</li>
<li>Faites ceci jusqu'&#224; ce que vous ayez d&#233;sactiv&#233; tous les modules compl&#233;mentaires d&#233;sir&#233;s ;</li>
<li>Pour finir, Tabulez jusqu'au bouton &quot;Fermer&quot; et appuyez sur Entr&#233;e. Red&#233;marrez NVDA lorsque demand&#233;.</li>
</ol>
<p>L'installation d'une nouvelle version de NVDA ne supprime pas les modules compl&#233;mentaires d&#233;j&#224; install&#233;s. Ceux-ci restent fonctionnels dans la mesure o&#249; ils sont compatibles avec cette nouvelle version.</p>
<p>Pour en savoir plus sur la gestion des modules compl&#233;mentaires, rendez-vous au chapitre <a href="https://blindhelp.github.io/userGuide.html#AddonsManager">Gestionnaire de modules compl&#233;mentaires du guide de l'utilisateur</a></p>
<hr />
<h3 id="vous_pouvez_consulter_la_liste">5. &#224; continuation voici la liste des modules compl&#233;mentaires, avec leurs respective description et leurs lien de t&#233;l&#233;chargement:</h3>
<hr />
<div>
<p>Voici la liste des modules compl&#233;mentaires &#224; t&#233;l&#233;charger!!!</p>
</div>
<p>Attention : Si votre navigateur est Internet Explorer, il peut arriver que le module t&#233;l&#233;charg&#233; se retrouve avec l'extension de fichier .zip au lieu de .nvda-addon. Dans ce cas, il vous faudra changer l'extension du fichier. Par exemple, si votre module a &#233;t&#233; t&#233;l&#233;charg&#233; sous le nom &quot;monModule.zip&quot;, vous devrez le renommer en &quot;monModule.nvda-addon&quot; avant de pouvoir l'installer dans NVDA.</p>
<h2 id="modules-compl&#233;mentaires">Modules compl&#233;mentaires <a id="Modules compl&#233;mentaires"></a></h2>
<ul>
<li><a href="#AccessolutionsNvdaPro-2018.10.02.nvda-addon">AccesSolutionsNVDAPro</a></li>
<li><a href="#addonsHelp-1.0.nvda-addon">addonsHelp</a></li>
<li><a href="#applicationDictionary-1.2-dev.nvda-addon">applicationDictionary</a></li>
<li><a href="#ApprentiClavier%20v2.2.1.nvda-addon">ApprentiClavier</a></li>
<li><a href="#audacityAccessEnhancement-1.0.2.nvda-addon">audacityAccessEnhancement</a></li>
<li><a href="#Avira-configuration-1.0-dev.nvda-addon">Avira Configuration</a></li>
<li><a href="#balloonHistory.nvda-addon">Balloon History</a></li>
<li><a href="#BrailleExtender-v17.12.28.1.nvda-addon">BrailleExtender</a></li>
<li><a href="#braillenoteDriver-0.2.nvda-addon">braillenoteDriver</a></li>
<li><a href="#calibre-1.1.nvda-addon">Calibre</a></li>
<li><a href="#CdBurnerXP-v1.2.nvda-addon">CdBurnerXP</a></li>
<li><a href="#nvdastore-1.0.3.nvda-addon">Cecitek NVDAStore renomm&#233; simplement NVDAStore</a></li>
<li><a href="#clipContentsDesigner-8.7.nvda-addon">Clip Contents Designer (EX AppendText)</a></li>
<li><a href="#clipspeak-1.0.nvda-addon">Clipspeak</a></li>
<li><a href="#clock-19.01.1.nvda-addon">Clock</a></li>
<li><a href="#cloudOCR-0.1.nvda-addon">Cloud OCR</a></li>
<li><a href="#controlUsageAssistant-2.4.nvda-addon">controlUsageAssistant</a></li>
<li><a href="#dayOfTheWeek-6.2.1.nvda-addon">Day of the week</a></li>
<li><a href="#DragonNaturallySpeaking%201.0.nvda-addon">DragonNaturallySpeaking</a></li>
<li><a href="#dropbox-4.3.nvda-addon">Dropbox</a></li>
<li><a href="#eclipseEnhance-0.2.nvda-addon">Eclipse Enhance</a></li>
<li><a href="#eloquence-autoLanguageSwitching.nvda-addon">eloquence-autoLanguageSwitching</a></li>
<li><a href="#emoticons-9.0.nvda-addon">Emoticons</a></li>
<li><a href="#eMule-3.18.nvda-addon">eMule</a></li>
<li><a href="#Erbnvda2017-06-20.nvda-addon">Pilote pour les Terminaux Braille (Eurobraille)</a></li>
<li><a href="#extendedWinamp-1.1.nvda-addon">extendedWinamp</a></li>
<li><a href="#extendedWinamp-1.1-mod-RemyRuiz.nvda-addon">extendedWinamp-mod-RemyRuiz</a></li>
<li><a href="#extendedWinamp-1.1-2017-03-24.nvda-addon">extendedWinamp-2017-03-24</a></li>
<li><a href="#fakeClipboardAnouncement.nvda-addon">fakeClipboardAnouncement</a></li>
<li><a href="#fenCodeReader.NVDA-addon">FEN Code Reader</a></li>
<li><a href="#festivalTts-2.0-mod.nvda-addon">festivalTts-2.0-mod.nvda-addon</a></li>
<li><a href="#File%20Reader.nvda-addon">File Reader</a></li>
<li><a href="#firefox%20v1.2.nvda-addon">Firefox</a></li>
<li><a href="#focusHighlight-5.5.nvda-addon">Focus Highlight</a></li>
<li><a href="#iFree-Skype-Recorder-2.0.nvda-addon">iFree-Skype-Recorder</a></li>
<li><a href="#Instant%20Translate%204.1-dev-mod-Remy%20Ruiz">Instant Translate 4.1-dev-mod-Remy Ruiz</a></li>
<li><a href="#jumpToLine-v1.2.nvda-addon">JumpToLine</a></li>
<li><a href="#ListeIconesZoneNotification.nvda-addon">ListeIconesZoneNotification</a></li>
<li><a href="#modifyLockAnnouncement.nvda-addon">modifyLockAnnouncement</a></li>
<li><a href="#mp3DirectCut-4.2.nvda-addon">Mp3DirectCut</a></li>
<li><a href="#noBeepsSpeechMode-2.3.nvda-addon">noBeepsSpeechMode</a></li>
<li><a href="#NotepadPlusPlus-1.2-dev.nvda-addon">NotepadPlusPlus</a></li>
<li><a href="#NVDAExtensionGlobalPlugin_7.4.3.nvda-addon">NVDAExtensionGlobalPlugin</a></li>
<li><a href="#OBJSounds%20(KevanGC%20Version).nvda-addon">OBJSounds (KevanGC Version)</a></li>
<li><a href="#objsounds.nvda-addon">objsounds</a></li>
<li><a href="#ocr_0.20120529.01.nvda-addon">OCR</a></li>
<li><a href="#outlookExtended-1.0-dev.nvda-addon">Outlook Extended</a></li>
<li><a href="#partialLines-0.1.nvda-addon">Partial Lines</a></li>
<li><a href="#percentage%20checker.nvda-addon">percentage checker</a></li>
<li><a href="#perky-1.0.nvda-addon">Perky</a></li>
<li><a href="#placeMarkers-12.2.1.nvda-addon">placeMarkers</a></li>
<li><a href="#poeditMadeEasy-3.1.nvda-addon">poeditMadeEasy</a></li>
<li><a href="#QTranslate-1.0-dev.nvda-addon">QTranslate</a></li>
<li><a href="#radiosure%201.4.nvda-addon">RadioSure</a></li>
<li><a href="#readFeeds-6.2.nvda-addon">Read Feeds</a></li>
<li><a href="#reportPasswords-1.3-dev.nvda-addon">reportPasswords</a></li>
<li><a href="#reportSymbols-4.5.nvda-addon">Report Symbols</a></li>
<li><a href="#savelog-4.0.nvda-addon">SaveLog</a></li>
<li><a href="#ShortLink-2.0.nvda-addon">ShortLink</a></li>
<li><a href="#SpecificSearch%20mod.nvda-addon">SpecificSearch mod</a></li>
<li><a href="#Svox-Pico-Synthesizer.nvda-addon">Svox-Pico-Synthesizer</a></li>
<li><a href="#switchSynth-1.02.nvda-addon">switch_synth</a></li>
<li><a href="#TapinRadioStatusAnnouncer-2.0.nvda-addon">Tapin_Radio</a></li>
<li><a href="#thunderBird-2.9.6.1,%202019-01-02.nvda-addon">Thunderbird</a></li>
<li><a href="#toneMaster-1.3.nvda-addon">toneMaster</a></li>
<li><a href="#trainingKeyboardCommands-1.2-dev.nvda-addon">Training Keyboard Commands</a></li>
<li><a href="#translate-2018.12.2.1.nvda-addon">Translate</a></li>
<li><a href="#virtualRevision-2.4.nvda-addon">Virtual Review</a></li>
<li><a href="#VLCAccessEnhancement-1.1.nvda-addon">VLCAccessEnhancement</a></li>
<li><a href="#Weather%20Plus4.8.nvda-addon">Weather Plus</a></li>
<li><a href="#windows7magnifier-1.1.1.nvda-addon">windows7magnifier</a></li>
<li><a href="#windowsmail_v2.3.nvda-addon">Windows Mail</a></li>
<li><a href="#winExplore_v1.2.nvda-addon">winExplore</a></li>
<li><a href="#winword-spanish1.2.nvda-addon">winword-spanish</a></li>
<li><a href="#wlmail_v2.4.nvda-addon">Windows Live Mail</a></li>
<li><a href="#word%203.1.nvda-addon">Word</a></li>
<li><a href="#word-count.nvda-addon">Word-Count</a></li>
</ul>
<hr />
<h1 id="accessolutionsnvdapro">AccesSolutionsNVDAPro <a id="AccessolutionsNvdaPro-2018.10.02.nvda-addon"></a></h1>
<p>Type: Extensions<br />
Ce module apporte des fonctionnalit&#233;s et des am&#233;liorations au lecteur d'&#233;cran NVDA, rendant son utilisation plus confortable tout en facilitant la transition depuis d'autres lecteurs d'&#233;cran.<br />
Langues: Fran&#231;ais.<br />
Auteur : <a href="http://www.accessolutions.fr/">AccesSolutions</a><br />
Version : 2018.10.02<br />
Derni&#232;re mise &#224; jour: 2 Octobre 2018<br />
<a href="https://blindhelp.github.io/AccessolutionsNvdaPro-2018.10.02.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire AccessolutionsNvdaPro-2018.10.02.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="addonshelp">addonsHelp <a id="addonsHelp-1.0.nvda-addon"></a></h1>
<pre><code> Type: Extensions
 Cet addon offre un acc&#232;s rapide aux aides des modules compl&#233;mentaires install&#233;s.</code></pre>
<p>Il r&#233;unit tous les modules compl&#233;mentaires disposant d'une documentation dans un sous-menu du menu Aide de NVDA, nomm&#233; &quot;Aide des modules compl&#233;mentaires&quot;.</p>
<pre><code>  Langues: Anglais, Arabe, Fran&#231;ais et Espagnol.
Version: 1.0
Derni&#232;re mise &#224; jour: 18 Mai 2016
Auteurs: Zougane, R&#233;my, Abdel    </code></pre>
<p>Traduit en espagnol, par: R&#233;my Ruiz <a href="http://cyber25.free.fr/nvda-addons/addonsHelp-1.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire addonsHelp-1.0.nvda-addon par ici:[lien externe]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="applicationdictionary">applicationDictionary <a id="applicationDictionary-1.2-dev.nvda-addon"></a></h1>
<p>Type: Extensions<br />
permet la cr&#233;ation de dictionnaires sp&#233;cifiques &#224; l'application.<br />
Utilisez le raccourci NVDA+Maj+P pour acc&#233;der au dictionnaire de l'application en cours.</p>
<p>Pour d'autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.</p>
<p>Auteur : <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#46;&#108;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#x39;&#x35;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#32;&#76;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#32;&#76;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#32;&#40;&#114;&#x69;&#x63;&#x61;&#114;&#100;&#x6f;&#46;&#108;&#x65;&#x6f;&#110;&#x61;&#114;&#x63;&#122;&#x79;&#x6b;&#x39;&#x35;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
<a href="https://github.com/RickLeon/applicationDictionary">Consultez la page du r&#233;f&#233;rentiel (repository) sur JitHub</a><br />
Ce module compl&#233;mentaire est mis &#224; jour avec les nouvelles sources puis retraduit en fran&#231;ais et en espagnol par R&#233;my Ruiz et d'autres contributeurs.<br />
Mais la nouvelle mise &#224; jour des traductions pour les langues Espagnol, Fran&#231;ais, Portugais-Br&#233;sil, et Portugais-Portugal ne sont pas encore int&#233;gr&#233;es dans les sourrces qui se trouvent sur le r&#233;f&#233;rentiel (repository.<br />
Derni&#232;re mise &#224; jour: 12 Juin 2018<br />
Langues: Anglais, Espagnol, Fran&#231;ais, Portugais-Br&#233;sil, et Portugais-Portugal<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz<br />
Traduit en espagnol par: Iv&#225;n Novegil Cancelas et R&#233;my Ruiz<br />
Version: 1.2-dev (version de d&#233;veloppement non officielle)<br />
[T&#233;l&#233;charger le module compl&#233;mentaire applicationDictionary-1.2-dev.nvda-addon <a href="https://blindhelp.github.io/applicationDictionary-1.2-dev.nvda-addon">via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="apprenticlavier">ApprentiClavier <a id="ApprentiClavier v2.2.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire permet d&#39;utiliser le c&#233;l&#232;bre logiciel
Apprenti Clavier avec NVDA.
Langues: Fran&#231;ais.
Version: 2.2.1
Derni&#232;re mise &#224; jour: 22 Ao&#251;t 2016
Auteur: Paul de la liste scriptNVDA </code></pre>
<p><a href="https://blindhelp.github.io/ApprentiClavier%20v2.2.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire ApprentiClavier v2.2.1.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="audacityaccessenhancement">audacityAccessEnhancement<a id="audacityAccessEnhancement-1.0.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Ce module am&#233;liore l'accessiblit&#233; du logiciel Audacity en apportant:</p>
<ul>
<li>un script pour connaitre la position audio,</li>
<li>un script pour connaitre le d&#233;but et la fin de la s&#233;lection,</li>
<li>un script pour l'&#233;tat des boutons &quot;Pause&quot;, &quot;Lecture&quot; et &quot;Enregistrement&quot;,</li>
<li>l'annonce automatique des changements de la position audio,</li>
<li>l'annonce automatique des changements de la s&#233;lection (d&#233;sactivable),</li>
<li>l'utilisation possible de la barre d'espace pour appuyer sur un bouton,</li>
<li>le support vocal pour les zones d'&#233;dition d&#233;finissant un temps ou une dur&#233;e dans la Barre d'outils S&#233;lection Audacity,</li>
<li>un script pour lire le niveau courant des vu-m&#232;tres de cr&#232;te en lecture ou enregistrement,</li>
<li>un script pour lire le niveau courant des potentiom&#232;tres de lecture ou d'enregistrement,</li>
<li>un script pour lire la vitesse de lecture,</li>
<li>un script pour afficher le manuel utilisateur du module,</li>
<li>un script pour afficher le guide d'audacity &#233;crit par David Bailes.</li>
</ul>
<p>Cette version du module a &#233;t&#233; test&#233;e avec NVDA 2018.3.2 et audacity v2.3.0.</p>
<p>Les pr&#233;c&#233;dentes versions d'Audacity ne sont pas support&#233;es.</p>
<pre><code>Langues: Fran&#231;ais.
Version : 1.0.2
Derni&#232;re mise &#224; jour: 3 Janvier 2019
Petite mise &#224; jour du module pour corrections de bugs et documentation.
Auteur : Paul de la liste scriptNVDA 

Pour ceux qui utilisent Audacity, voici la version du module compl&#233;mentaire NVDA qui est compatible avec sa derni&#232;re version 2.3.
Le nom du module a chang&#233; pour &#233;viter toute confusion avec d&#39;autres modules.
Sinon, il n&#39;y a pas de nouvelle fonctionnalit&#233;, mis &#224; part une petite am&#233;lioration de l&#39;accessibilit&#233; des zones d&#39;&#233;dition de temps de la boite de dialogue &quot;Enregistrement temporis&#233;&quot; et l&#39;ajout du guide d&#39;introduction &#224;&#160; Audacity en fran&#231;ais.

Cette version du module n&#39;est pas compatible avec les pr&#233;c&#233;dentes versions d&#39;Audacity.</code></pre>
<p><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/audacity/audacityAccessEnhancement-1.0.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire audacityAccessEnhancement-1.0.2.nvda-addon par ici: [lien externe]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="avira-configuration">Avira Configuration <a id="Avira-configuration-1.0-dev.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<ul>
<li>Auteurs : Abdel, Corentin.</li>
<li>t&#233;l&#233;charger <a href="http://cyber25.free.fr/nvda-addons/Avira-configuration-1.0-dev.nvda-addon">version de d&#233;veloppement</a></li>
</ul>
<p>Cet addon devrait vous permettre d'am&#233;liorer l'accessibilit&#233; des options de configuration du logiciel Avira-Free-Antivirus.</p>
<p>Ces options de configuration sont accessibles &#224; partir de l'ic&#244;ne d'Avira figurant dans la zone de notification.</p>
<p>Par d&#233;faut, les items de l'arborescence ne sont pas du tout vocalis&#233;s sans la pr&#233;sence de l'addon.</p>
<p>Notes</p>
<ul>
<li>L'addon a &#233;t&#233; cr&#233;&#233; avec la version free d'Avira, il n'a pas &#233;t&#233; test&#233; sur les versions pro.</li>
<li>L'addon a &#233;t&#233; test&#233; sous Windows-XP, ainsi que Windows-10.</li>
<li>Avec Windows-10, il se peut que l'item du pare-feu provoque un plantage momentan&#233;, dans ce cas, refermer puis r&#233;ouvrir les options pour retrouver un comportement normal.</li>
</ul>
<p>Changements pour la version 1.0</p>
<ul>
<li>version initiale.</li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="balloon-history">Balloon History <a id="balloonHistory.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Historique des info-bulles: Appuyez sur Maj NVDA f11 pour obtenir
l&#39;historique des info-bulles
Info-bulles! C&#39;est trop souvent que nous manquons &#224; eux lorsque NVDA
parle d&#39;eux et nous avons maintenant avoir un moyen de consulter les
info-bulles pr&#233;c&#233;dent. Ce plugin vous indique combien de temp
l&#39;info-bulle a &#233;t&#233; cr&#233;&#233;, avec son texte.
Langues: Anglais, Fran&#231;ais Espagnol.
Auteur: Oriol Gomez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://blindhelp.github.io/balloonHistory.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire balloonHistory.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="brailleextender">BrailleExtender <a id="BrailleExtender-v17.12.28.1.nvda-addon"></a></h1>
<pre><code>Type: Pilotes pour Terminaux Braille
Ce module se propose d&#8217;&#233;tendre le support de certains afficheurs braille. Actuellement les appareils Baum, Brailliant et Focus.             </code></pre>
<p>&#9888; ATTENTION&#160;! Ce module remplace BaumExtender que vous ne devriez plus utiliser. Pensez donc &#224; d&#233;sinstaller ce dernier avant toute installation de BrailleExtender.<br />
<a href="https://andreabc.net/projects/NVDA_addons/BrailleExtender/">Ce module &#233;voluant fr&#233;quemment, veuillez consulter le site qui lui est consacr&#233; pour conna&#238;tre ses derni&#232;res &#233;volutions.</a><br />
Utiliser cette m&#234;me page pour sont t&#233;l&#233;chargement. Merci.</p>
<p>Bravo Andr&#233; pour tout ce travail!</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="braillenotedriver">braillenoteDriver <a id="braillenoteDriver-0.2.nvda-addon"></a></h1>
<pre><code>Type: Pilotes pour Terminaux Braille
Pilote pour le Terminal Braille Braillenote Classic
Pilote natif pour le bloc-notes Braille Braillenote Classic.
Auteur: Rui Batista
Version : 0.2.
Langues: Anglais, Fran&#231;ais, Espagnol, Italien, et portugais.
Traduit en fran&#231;ais, espagnol, et italien par: R&#233;my Ruiz</code></pre>
<p><a href="https://blindhelp.github.io/braillenoteDriver-0.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire braillenoteDriver-0.2.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="calibre">Calibre <a id="calibre-1.1.nvda-addon"></a></h1>
<p>Type: Extensions<br />
Auteur : <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#xed;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#xed;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
<a href="https://github.com/javidominguez/calibre">Jeter un coup d'&#339;il au r&#233;f&#233;rentiel de l'auteur du module compl&#233;mentaire Calibre sur GitHub</a><br />
Version stable : 1.1<br />
Version de d&#233;veloppement : dev20181101<br />
Langues : Anglais et Espagnol (traduit par l'auteur) (inclus le chinois) dans la version de d&#233;veloppement.<br />
Derni&#232;re mise &#224; jour: Ier Novembre 2018</p>
<ul>
<li>Auteur: Javi Dominguez</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=cae">version stable</a><br />
</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=cae-dev">version de d&#233;veloppement</a></li>
</ul>
<p>Un module compl&#233;mentaire NVDA avec quelques am&#233;liorations d'accessibilit&#233; &#224; l'interface du gestionnaire de livres num&#233;riques Calibre</p>
<ul>
<li>F10 Am&#232;ne le focus &#224; la barre d'outils. Ensuite, vous pouvez naviguer avec les touches standard (tab et fl&#232;ches) ; entrer pour activer l'&#233;l&#233;ment et la touche applications pour afficher le menu contextuel ; ECHAP pour quitter la barre d'outils.</li>
<li>F12 Rechercher le livre courant dans Google</li>
<li>NVDA+Alt+Fin Dit le nombre total de livres dans la vue de biblioth&#232;que courante et le nombre de livres s&#233;lectionn&#233;s</li>
<li>NVDA++Contr&#244;le+H Ouvre le menu contextuel pour param&#233;trer la colonne en cours</li>
<li>I sur un livre dans la vue de la biblioth&#232;que lit les infos sur le livre.</li>
</ul>
<p>Ces commandes au clavier peuvent &#234;tre personnalis&#233;es &#224; partir du dialogue Gestes de commandes &gt; Pr&#233;f&#233;rences de NVDA lorsque Calibre est ouvert. Vous pouvez &#233;galement d&#233;finir dans les pr&#233;f&#233;rences la mani&#232;re dont NVDA annonce les en-t&#234;tes de tableau dans la biblioth&#232;que (lignes et colonnes, seulement les colonnes ou aucun).</p>
<p>Jeter un coup d'&#339;il &#224; la <a href="https://manual.calibre-ebook.com/gui.html">documentation de Calibre</a> pour en savoir plus sur les raccourcis clavier.</p>
<p>Couvert par la licence GNU General Public License. Voir le <a href="https://github.com/javidominguez/Calibre/blob/master/COPYING.txt">fichier COPYING.txt</a> pour plus de d&#233;tails.</p>
<p><a href="https://addons.nvda-project.org/files/get.php?file=cae">T&#233;l&#233;charger le module compl&#233;mentaire calibre-1.1.nvda-addon par ici:</a></p>
<p><a href="https://addons.nvda-project.org/files/get.php?file=cae-dev">T&#233;l&#233;charger le module compl&#233;mentaire calibre-dev20181101.nvda-addon par ici:</a></p>
<p>Quelques configurations utiles pour Calibre</p>
<p>Note: Il est probable que cette proc&#233;dure il soit diff&#233;rente dans les nouvelles versions de Calibre.</p>
<p>Pr&#233;f&#233;rences &gt; Interface &gt; Apparence &gt; Interface principale</p>
<p>En d&#233;sactivant les animations le programme fonctionnera plus fluide, on le remarquera dans les ordinateurs moins puissants</p>
<p>En d&#233;sactivant afficher l'&#233;cran de bienvenu celui-ci se chargera un peu plus vite</p>
<p>Pr&#233;f&#233;rences &gt; Interface &gt; Apparence &gt; D&#233;tails du livre</p>
<p>Ici, vous pouvez s&#233;lectionner les m&#233;tadonn&#233;es qui s'afficheront dans la vue d&#233;taill&#233;e du livre en appuyant sur I dans la liste</p>
<p>Pr&#233;f&#233;rences &gt; Interface &gt; Comportement</p>
<p>Dans la liste Utiliser la visionneuse interne pour : (Alt+U), vous pouvez s&#233;lectionner les formats que vous souhaitez afficher dans la visionneuse interne Calibre. Comme cette visionneuse n'est pas accessible, nous pouvons d&#233;cocher ici le format que nous voulons ouvrir dans une application externe lorsque nous appuyons sur V dans un livre ou menu &gt; Visualiser.</p>
<p>Liens utiles &#224; consulter pour Calibre :</p>
<p>Il a en fait des raccourcis clavier pour la plupart des choses, mais ils ne sont pas aussi &#233;vidents &#224; trouver qu'ils pourraient l'&#234;tre. <a href="https://www.shortcutworld.com/en/win/Calibre.html">Voici une page en anglais avec les raccourcis clavier :</a><br />
<a href="https://manual.calibre-ebook.com/fr/gui.html#keyboard-shortcuts">puis la page officielle en fran&#231;ais de Calibre avec les raccourcis clavier par ici</a></p>
<p>Et voici pour vous le <a href="http://manual.calibre-ebook.com/">manuel officiel toujours en anglais:</a><br />
<a href="https://manual.calibre-ebook.com/fr/index.html">puis la page en fran&#231;ais du manuel officiel de l&#8217;Utilisateur calibre par l&#224;!</a><br />
<a href="http://tutocalibre.free.fr/">puis un autre tutoriel pour Calibre toujours En fran&#231;ais qui regorge de forte informations utiles par ici!</a></p>
<p>Et pour t&#233;l&#233;charger le programme Calibre pour Windows <a href="https://calibre-ebook.com/download_windows">c'est par l&#224;! (page officielle en anglais)</a><br />
<a href="https://calibre-ebook.com/fr/download_windows">puis la page officielle en fran&#231;ais par ici!</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="cdburnerxp">CdBurnerXP <a id="CdBurnerXP-v1.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Dans la version actuelle, CdBurnerXP est suffisamment accessible
pour &#234;tre utilis&#233; sans module, sauf pour le lecteur audio disponible
dans la fen&#234;tre des compilations audios.
Le module permet cependant de simplifier son utilisation dans les
fen&#234;tres de compilation, gr&#226;ce &#224; des commandes permettant
notamment:\
d&#39;aller directement &#224; l&#39;arborescence, &#224; la zone de liste du dossier
ouvert, &#224; la zone de compilation, au lecteur audio s&#39;il est
affich&#233;;
d&#39;ajouter directement des dossiers ou fichiers &#224; la compilation,
sans passer par des boites de dialogues;
de savoir si le lecteur audio est affich&#233;, de l&#39;afficher si besoin,
d&#39;agir sur le bouton Marche/Arr&#234;t du lecteur, et de se d&#233;placer dans
la piste pendant la lecture.
Il est utilisable avec CdBurnerXP 4.5.4, Windows XP &#224; 8.1. Il a &#233;t&#233;
test&#233; avec NVDA 2014.3, mais il doit pouvoir fonctionner avec les
versions pr&#233;c&#233;dentes ou r&#233;centes.
Vous pouvez consulter les fiches de Daniel Poiraud concernant
CdBurnerXP: </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_1.htm">Graver des CD et DVD avec CdBurnerXP - Fiche #1,</a><br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/logiciels_divers/cdburnerxp_2.htm">Graver une compilation avec CdBurnerXP - Fiche #2.</a><br />
Auteur: Daniel Poiraud<br />
Derni&#232;re mise &#224; jour: 26.09.2014<br />
<a href="https://blindhelp.github.io/CdBurnerXP-v1.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire CdBurnerXP-v1.2.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="cecitek-nvdastore-renomm&#233;-simplement-nvdastore">Cecitek NVDAStore renomm&#233; simplement NVDAStore <a id="nvdastore-1.0.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Installer et mettre &#224; jour des modules compl&#233;mentaires directement depuis NVDA. Gr&#226;ce au NVDAStore, vous pouvez parcourir, t&#233;l&#233;charger et mettre &#224; jour tous vos modules compl&#233;mentaires pr&#233;f&#233;r&#233;s directement depuis NVDA lui-m&#234;me. Ce module remplace le module Cecitek, lequel sera uniquement li&#233; au site du m&#234;me nom.

Gr&#226;ce &#224; ce module, installer et mettre &#224; jour vos modules compl&#233;mentaires n&#39;aura jamais &#233;t&#233; aussi simple.</code></pre>
<p>Estampill&#233;e en version 1.0.3, elle apporte les fonctionnalit&#233;s suivantes:</p>
<ul>
<li>Possibilit&#233; de mettre &#224; jour tous les modules compl&#233;mentaires d'un seul coup en appuyant sur NVDA+Shift+control+U ;</li>
<li>Pour les d&#233;tenteurs d'un compte sur Cecitek.fr, vous pouvez vous identifier afin de, par la suite, pouvoir noter vos modules compl&#233;mentaires install&#233;s et de les commenter ;</li>
<li>Quelques ajustements mineurs concernant la gestion des mises &#224; jour;</li>
<li>Le raccourci permettant de conna&#238;tre le titre du dernier &#233;pisode publi&#233; sur Cecitek.fr a &#233;t&#233; supprim&#233;, il sera pr&#233;sent dans un autre module compl&#233;mentaire d&#233;di&#233; au podcast lui-m&#234;me.</li>
</ul>
<p><a href="http://www.cecitek.fr/index.php?module=nvda&amp;action=detail&amp;id=69">Pour plus d'informations, veuillez consulter la page de Cecitek consacr&#233;e au NVDAStore</a><br />
Auteur : Yannick Plassiard<br />
Version : 1.0.3<br />
Derni&#232;re mise &#224; jour: 20 Avril 2018<br />
<a href="http://www.cecitek.fr/index.php?module=nvda&amp;action=download&amp;id=69&amp;id_version=195">T&#233;l&#233;charger le module NVDAStore par ici</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="clip-contents-designer-ex-appendtext">Clip Contents Designer (EX AppendText) <a id="clipContentsDesigner-8.7.nvda-addon"></a></h1>
<pre><code>Type: Extensions
N&#233;cessite NVDA 2018.3 ou ult&#233;rieur.
AjouterTexte: Module pour l&#39;ajout de texte dans le presse-papiers
Ce module compl&#233;mentaire est utilis&#233; pour ajouter du texte dans le presse-papiers, ce qui peut &#234;tre utile lorsque vous souhaitez relier des portions de texte ensemble pr&#234;t pour le collage. Le contenu du presse-papiers peut aussi &#234;tre vid&#233;.
Commandes clavier
    NVDA+windows+c
Ajoute le texte s&#233;lectionn&#233;, les caract&#232;res braille Unicode qui repr&#233;sentent les objets MathML ou la cha&#238;ne qui a &#233;t&#233; marqu&#233;e avec le curseur de revue, dans le presse-papiers.
NVDA+windows+x
Vide le contenu du presse-papiers.
NVDA+windows+f9
Marque la position actuelle du curseur de revue comme le d&#233;but du texte &#224; ajouter au presse-papiers. Si vous utilisez nvda+F9, le texte ne sera pas ajout&#233;.
Non affect&#233; 
Copie dans (ou coupe depuis) le presse-papiers, avec la possibilit&#233; de demander une confirmation pr&#233;alable.
Note : Les commandes ci-dessus peuvent &#234;tre chang&#233;s depuis le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de commandes, dans la cat&#233;gorie Revue de texte.
Menu Pr&#233;f&#233;rences
Param&#232;tres Clip Contents Designer : Permet de d&#233;finir un s&#233;parateur qui peut &#234;tre utilis&#233; pour trouver les segments de texte une fois que tout le texte ajout&#233; est coll&#233;.</code></pre>
<p>Vous pouvez &#233;galement choisir si l&#8217;ajout de texte sera ajout&#233; &#224; la fin ou ajout&#233; au d&#233;but, si les actions disponibles (ajouter, vider le presse-papiers, &#233;muler copier et &#233;muler couper) doivent &#234;tre effectu&#233;es imm&#233;diatement ou apr&#232;s confirmation, et si des confirmations seront demand&#233;es juste si le texte est contenu dans le presse-papiers.<br />
Notes :<br />
La commande ci-dessus peut &#234;tre chang&#233; depuis le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de commandes, dans la cat&#233;gorie Configuration.<br />
Les confirmations ne seront pas demand&#233;es lorsqu'une bo&#238;te de message de NVDA est toujours ouverte. Dans ces cas, les actions seront effectu&#233;es imm&#233;diatement<br />
Langues: Anglais, Fran&#231;ais Espagnol, Italien et autres langues.<br />
Version: 8.7<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
Auteur: Noelia Ruiz Mart&#237;nez<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz<br />
<a href="http://addons.nvda-project.org/files/get.php?file=ccd">T&#233;l&#233;charger le module compl&#233;mentaire clipContentsDesigner-8.7.nvda-addon par ici:</a></p>
<p>&#201;galement a &#233;t&#233; publi&#233;e La version 7.2 compatible &#224; partir de NVDA 2018.1.1 &#224; 2017.3. <a href="https://github.com/nvdaes/clipContentsDesigner/releases/download/7.2/clipContentsDesigner-7.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire clipContentsDesigner-7.2.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="clipspeak">Clipspeak <a id="clipspeak-1.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Module compl&#233;mentaire pour verbaliser les informations du presse-papiers.&quot;&quot;&quot;</p>
<p>Pour d'autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.</p>
<p>Diff&#233;rence entre le module compl&#233;mentaire Clipspeak et le module compl&#233;mentaire fakeClipboardAnouncement:</p>
<p>Avec le module compl&#233;mentaire fakeClipboardAnouncement NVDA vous dit couper, copier ou coller en appuyant sur Contr&#244;le+X, Contr&#244;le+C et Contr&#244;le+V respectivement, mais vous ne savez pas si l'action a effectivement eu lieu ou non, m&#234;me si l'action n'a pas &#233;t&#233; fait celle-ci est annonc&#233;.<br />
De l&#224; vient le nom, fakeClipboardAnouncement, dont la traduction litt&#233;rale en fran&#231;ais est Faux Annonce du Presse-papiers.<br />
Au lieu de cela, le module compl&#233;mentaire Clipspeak v&#233;rifie que l'action est en cours avant de le dire.</p>
<p>Interf&#233;rence entre le module compl&#233;mentaire Clipspeak et le module compl&#233;mentaire Clip Contents Designer:</p>
<p>Gardez &#224; l'esprit que, avec ou sans traduction, ce module compl&#233;mentaire peut &#234;tre interf&#233;r&#233; par Clip Contents Designer sur certaines touches. Pour le r&#233;soudre, nous pouvons aller dans Pr&#233;f&#233;rences&gt; Gestes de commandes et supprimer les touches ctrl+C et ctrl+X dans la section &quot;Revue de texte&quot; (elles sont dans:<br />
&quot;Copier dans le presse-papiers, avec la possibilit&#233; de demander une confirmation pr&#233;alable&quot;<br />
et:<br />
&quot;Couper &#224; partir du presse-papiers, avec la possibilit&#233; de demander une confirmation pr&#233;alable&quot;).</p>
<p>Interf&#233;rence entre le module compl&#233;mentaire Clipspeak et le module compl&#233;mentaire fakeClipboardAnouncement:</p>
<p>Remarque Tr&#232;s Importante ; Si vous avez install&#233; le module compl&#233;mentaire fakeClipboardAnouncement s&#233;par&#233;ment, vous devez le d&#233;sinstaller avant d'installer le module compl&#233;mentaire Clipspeak.</p>
<p>Interf&#233;rence entre le module compl&#233;mentaire Clipspeak et le module compl&#233;mentaire NVDAExtensionGlobalPlugin:</p>
<p>Note : Si vous avez install&#233; le module compl&#233;mentaire NVDAExtensionGlobalPlugin fait par Paul de la liste scriptNVDA, vous aurez la fonctionnalit&#233;:<br />
Annonce de la fonction associ&#233;e aux commandes d'&#233;dition du style &quot;copier&quot;, &quot;Coller&quot;<br />
Cette fonctionnalit&#233; est install&#233;e par d&#233;faut.<br />
Les fonctions d&#233;clench&#233;es par les raccourcis &quot;control+v&quot;, &quot;control+c&quot;, &quot;control+x&quot;, &quot;control+z&quot; n'&#233;tant pas vocalis&#233;es par NVDA, le module s'en charge.<br />
Aucun controle sur le r&#233;sultat de la fonction n'est fait. Mais pour les raccourcis &quot;control+c&quot;, &quot;control+x&quot;, l'absence de s&#233;lection de texte est signal&#233;e dans les arborescences et les listes.<br />
Si Le module fakeClipboardAnnouncement est install&#233; (qui r&#233;alise la m&#234;me fonction), il faut le d&#233;sinstaller.</p>
<p>Vous devez aussi d&#233;sinstaller cette fonctionnalit&#233; au pr&#233;alable dans le module compl&#233;mentaire NVDAExtensionGlobalPlugin avant d'installer le module compl&#233;mentaire Clipspeak.<br />
Donc pour ce faire, aller dans le Menu NVDA (NVDA+n)<br />
puis Pr&#233;f&#233;rences<br />
puis Param&#232;tres du Module d'extension des commandes de Base de NVDA sous-menu<br />
puis Installation des fonctionnalit&#233;s...<br />
Rechercher l'&#233;l&#233;ment:<br />
Annonce de la fonction associ&#233;e aux commandes d'&#233;dition Installer<br />
Cette fonctionnalit&#233; est install&#233;e par d&#233;faut.<br />
Faire une fll&#232;che gauche pour avoir:<br />
Annonce de la fonction associ&#233;e aux commandes d'&#233;dition Ne pas installer<br />
Puis tab jusq'au bouton:<br />
OK</p>
<p>Relancez NVDA pour que les modifications prennent effet.</p>
<p>Une fois d&#233;sinstall&#233;e cette fonctionnalit&#233; dans le module compl&#233;mentaire NVDAExtensionGlobalPlugin et ensuite avoir install&#233;e le module compl&#233;mentaire Clipspeak, celui-ci permet &#224; NVDA d'annoncer automatiquement les op&#233;rations du presse-papiers (telles que couper, copier et coller), ainsi que d'autres op&#233;rations courantes .</p>
<p>Auteur : <script type="text/javascript">
<!--
h='&#100;&#x63;&#112;&#x65;&#110;&#100;&#108;&#x65;&#116;&#x6f;&#110;&#46;&#112;&#108;&#x75;&#x73;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#100;&#x61;&#x6d;&#x69;&#x65;&#110;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x47;&#x61;&#114;&#x77;&#x6f;&#x6f;&#100;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x47;&#x61;&#114;&#x77;&#x6f;&#x6f;&#100;&#32;&#40;&#100;&#x61;&#x6d;&#x69;&#x65;&#110;&#32;&#x61;&#116;&#32;&#100;&#x63;&#112;&#x65;&#110;&#100;&#108;&#x65;&#116;&#x6f;&#110;&#32;&#100;&#x6f;&#116;&#32;&#112;&#108;&#x75;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
<a href="https://github.com/blunderboy/NVDAAddon-Clipspeak">Consultez la page du r&#233;f&#233;rentiel (repository) sur JitHub</a><br />
Ce module compl&#233;mentaire est mis &#224; jour avec les nouvelles sources puis retraduit en fran&#231;ais et en espagnol par R&#233;my Ruiz et d'autres contributeurs.<br />
Mais la nouvelle mise &#224; jour des traductions pour certainnes langues ne sont pas encore int&#233;gr&#233;es dans les sourrces qui se trouvent sur le r&#233;f&#233;rentiel (repository.<br />
Le module compl&#233;mentaire a &#233;t&#233; modifi&#233; pour initialiser le syst&#232;me de traduction et ajouter une premi&#232;re traduction en espagnol (merci &#224; Iv&#225;n Novegil Cancelas).<br />
J'ai &#233;t&#233; inspir&#233; &#224; faire de m&#234;me, mais pour initialiser le syst&#232;me de traduction et ajouter une premi&#232;re traduction en fran&#231;ais.</p>
<p>Derni&#232;re mise &#224; jour: 16 Mai 2018<br />
Langues: Anglais, Espagnol et Fran&#231;ais<br />
Traduit en fran&#231;ais par: Michel Such et R&#233;my Ruiz<br />
Traduit en espagnol par: Iv&#225;n Novegil Cancelas, Juan C. Buno et R&#233;my Ruiz<br />
Version: 1.0 (version stable non officielle)<br />
<a href="https://blindhelp.github.io/clipspeak-1.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire clipspeak-1.0.nvda-addon [via BlindHelp.github.io]</a></p>
<p>&#192; savoir que actuellement le module compl&#233;mentaire Clipspeak existe en anglais et celui-ci est sur la page des:<br />
<a href="https://addons.nvda-project.org/dev.fr.html">Modules compl&#233;mentaires en d&#233;veloppement</a><br />
Mais il est actuellement en version stable.<br />
pr&#233;cis&#233;ment sur la page d&#233;di&#233;e audit module compl&#233;mentaire: <a href="https://addons.nvda-project.org/addons/clipspeak.fr.html">Clipspeak</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="clock">Clock <a id="clock-19.01.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire est compatible avec les versions de NVDA allant de 2014.3 &#224; 2019.1.
(Y compris les versions de NVDA ant&#233;rieures &#224; 2018.2).
Avec les versions de NVDA ant&#233;rieures &#224; 2018.2, le sous-menu Configuration du module compl&#233;mentaire est disponible dans le menu Outils.
Ce module compl&#233;mentaire active les fonctions avanc&#233;es de l&#39;horloge, de minuterie d&#39;alarme et du calendrier pour NVDA.</code></pre>
<p>Au lieu de toujours obtenir la date et l'heure depuis Windows, vous pouvez personnaliser comment les dates et les heures doivent &#234;tre annonc&#233;es et affich&#233;es en braille par NVDA.</p>
<p>En outre, vous pouvez obtenir le jour actuel, le num&#233;ro de la semaine, ainsi que les jours restants avant la fin de l'ann&#233;e en cours, et vous pouvez &#233;galement d&#233;finir une annonce automatique de l'heure sur un intervalle sp&#233;cifi&#233;.</p>
<p>Il existe &#233;galement des fonctionnalit&#233;s pour le chronom&#232;tre et minuterie d'alarme int&#233;gr&#233;s au module compl&#233;mentaire qui vous permettent de chronom&#233;trer vos t&#226;ches, telles que la copie de fichiers, l'installation de programmes ou la pr&#233;paration de repas.</p>
<p>Note:<br />
Si vous installez le module compl&#233;mentaire en tant que mise &#224; jour, lors du processus d'installation, l'assistant d&#233;tecte si l'ancienne configuration est compatible avec la nouvelle et vous propose de la corriger avant l'installation. Il vous suffira alors de valider le bouton OK pour confirmer cela.</p>
<ul>
<li>NVDA+F12, pour obtenir l'heure actuelle;<br />
</li>
<li>NVDA+F12 press&#233; deux fois rapidement, pour obtenir la date actuelle;<br />
</li>
<li>NVDA+F12 press&#233; trois fois rapidement, pour annoncer le jour actuel, le num&#233;ro de la semaine, l'ann&#233;e en cours et les jours qui restent avant la fin de l'ann&#233;e.<br />
</li>
<li>Contr&#244;le+F12, donne le temps restant et &#233;coul&#233; avant la prochaine alarme;<br />
</li>
<li><p>Contr&#244;le+F12 press&#233; deux fois rapidement, annule la prochaine alarme.</p>
<p>Pour d'autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.</p></li>
</ul>
<p>Auteurs: Hrvoje Kati&#263;, <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;&#32;&#40;&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Abdel,<br />
<script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#98;&#100;&#x65;&#108;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#98;&#100;&#x65;&#108;&#32;&#40;&#x61;&#98;&#100;&#x65;&#108;&#x6b;&#114;&#x69;&#x6d;&#46;&#98;&#x65;&#110;&#x73;&#x61;&#x69;&#100;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
et contributeurs de NVDA.</p>
<p><a href="https://github.com/hkatic/clock">Consultez la page du r&#233;f&#233;rentiel (repository) sur JitHub</a></p>
<p>Il suffit de mentionner qu'appVeyor g&#233;n&#232;re automatiquement un nouveau fichiers pot avec la commande scons &#224; chaque fois que un nouveau commit est publi&#233;, ce qui est fantastique. Ainsi, le dernier fichier pot sera toujours sur le lien suivant ainsi que l'addon:</p>
<p>Note: Actuellement sur la page d'appVeyor il se trouve seulement le dernier module compl&#233;mentaire en date, il n'y a pas le fichier pot.</p>
<p><a href="https://ci.appveyor.com/project/HrvojeKati/clock/build/artifacts" class="uri">https://ci.appveyor.com/project/HrvojeKati/clock/build/artifacts</a></p>
<h1 id="version-19.01.1">Version 19.01.1</h1>
<ul>
<li>Cr&#233;ation de la version stable 19.01.1.</li>
</ul>
<p>Bravo Hrvoje et Abdel! &#128522;</p>
<p>Ce module compl&#233;mentaire Clock-19.01.1 est mis &#224; jour avec les nouvelles sources puis retraduit en fran&#231;ais et en espagnol par R&#233;my Ruiz et d'autres contributeurs.<br />
Langues support&#233;s: Allemand, Anglais, Arabe, Bulgare, Chinois Traditionnel, Croate, Fran&#231;ais, Espagnol, Italien, Persan, Polonais, Portugais-Br&#233;sil, Portugais-Portugal, Roumain, Russe, Serbe, Slovaque et Turc<br />
Traduit en fran&#231;ais par: Michel Such, Abdel et R&#233;my Ruiz<br />
Traduit en espagnol par: Iv&#225;n Novegil Cancelas, Juan C. Buno, Jos&#233; Manuel Delicado Alcolea et R&#233;my Ruiz<br />
Version: Clock-19.01.1<br />
Derni&#232;re mise &#224; jour: 6 Janvier 2019</p>
<h1 id="t&#233;lecharger-le-module-compl&#233;mentaire-horloge-et-calendrier-pour-nvda-clock-via-les-liens-du-site-communautaire-nvda">T&#233;lecharger le module compl&#233;mentaire horloge et calendrier pour NVDA (Clock) via les liens du site communautaire NVDA</h1>
<ul>
<li><p>T&#233;l&#233;charger <a href="http://addons.nvda-project.org/files/get.php?file=cac">version stable</a>;</p></li>
<li><p>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=cac-dev">version de d&#233;veloppement</a>.</p></li>
</ul>
<h1 id="consulter-la-documentation-du-module-compl&#233;mentaire-horloge-et-calendrier-pour-nvda-clock">Consulter la documentation du module compl&#233;mentaire horloge et calendrier pour NVDA (Clock)</h1>
<p><a href="https://addons.nvda-project.org/addons/clock.fr.html">via la page du site communautaire NVDA</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="cloud-ocr">Cloud OCR <a id="cloudOCR-0.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Auteur: Christopher Toth
Version actuelle: 0.1</code></pre>
<p><a href="https://github.com/ctoth/cloudOCR/releases/download/v0.1/cloudOCR-0.1.nvda-addon">T&#233;l&#233;charger:</a> <a href="https://github.com/ctoth/cloudOCR">Code source sur GitHub:</a></p>
<pre><code>Ce module compl&#233;mentaire est utilis&#233; pour effectuer une reconnaissance optique de caract&#232;res en ligne(OCR) de l&#39;objet s&#233;lectionn&#233; &#224; l&#39;aide de l&#39;API ocr.space.</code></pre>
<h1 id="mode-dutilisation">Mode d'utilisation</h1>
<ul>
<li>Placez le navigateur d&#8217;objets NVDA dans la fen&#234;tre ou l&#8217;objet que vous souhaitez reconna&#238;tre.</li>
<li>Appuyez sur NVDA + Maj + r. Vous entendrez 3 bips ascendants.</li>
<li><p>Lorsque la reconnaissance est termin&#233;e, vous entendrez un bip. Utilisez les commandes de r&#233;vision de texte NVDA pour lire le contenu.</p>
<p>Note: Utilisez les touches 7 et 9 du pav&#233; num&#233;rique pour lire par lignes ou leurs &#233;quivalents dans la disposition du clavier portable. Les fl&#232;ches ne fonctionnent pas.</p></li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="controlusageassistant">controlUsageAssistant <a id="controlUsageAssistant-2.4.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Control Usage Assistant - aide interactive sur l&#39;objet actif
Ce module permet de savoir comment interagir avec le contr&#244;le mis
en focus. Cliquez sur NVDA + H pour obtenir un bref
message d&#39;aide sur l&#39;interaction avec le contr&#244;le mis en focus,
comme pour les cases &#224; cocher, champs d&#39;&#233;dition et ainsi de suite.
Description : Permet de savoir comment interagir avec l&#39;&#233;l&#233;ment
actif, pratique pour un d&#233;butant sous Windows ou NVDA.
Appuyez sur NVDA+H pour obtenire l&#39;information.&quot;&quot;&quot;
Langues: Il y a 22 langues inclus le fran&#231;ais.
Version: 2.4
Derni&#232;re mise &#224; jour: 31 Janvier 2017
Auteur: Joseph Lee </code></pre>
<p><a href="https://addons.nvda-project.org/files/get.php?file=cua">T&#233;l&#233;charger le module compl&#233;mentaire controlUsageAssistant-2.4.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="day-of-the-week">Day of the week <a id="dayOfTheWeek-6.2.1.nvda-addon"></a></h1>
<p>Type: Extensions</p>
<ul>
<li>Auteurs : Abdel, Noelia.</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=dw">version stable</a><br />
</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=dw-dev">version de d&#233;veloppement</a></li>
</ul>
<p>Ce module compl&#233;mentaire vous permet de trouver un jour de la semaine correspondant &#224; une date choisie.</p>
<p>Il ajoute un sous-menu dans le menu Pr&#233;f&#233;rences NVDA nomm&#233; &quot;Jour de la semaine&quot;, contenant 2 &#233;l&#233;ments :</p>
<ul>
<li>Le premier nomm&#233; &quot;Trouver un jour&quot;, ouvre une bo&#238;te de dialogue compos&#233;e de 3 contr&#244;les :
<ul>
<li>Une zone de liste pour choisir ou tapez votre date ;</li>
<li>Un bouton &quot;OK&quot; pour afficher une bo&#238;te de messages contenant votre jour ;</li>
<li>Un bouton &quot;Annuler&quot; pour fermer la bo&#238;te de dialogue.</li>
</ul></li>
<li>Le deuxi&#232;me nomm&#233; &quot;Param&#232;tres du module compl&#233;mentaire dayOfTheWeek&quot; ouvre les param&#232;tres du module compl&#233;mentaire pour sp&#233;cifier si vous souhaitez annoncer les &#233;tiquettes pour les champs de date ou non, il se compose des &#233;l&#233;ments suivants :
<ul>
<li>Activer l'accessibilit&#233; du s&#233;lecteur de date ;</li>
<li>Niveau des annonces d'&#233;tiquettes, vous aurez alors 3 choix :
<ul>
<li>Long (c'est le choix par d&#233;faut) ;</li>
<li>Court (pour les annonces courts) ;</li>
<li>D&#233;sactiver (d&#233;sactiver les annonces d'&#233;tiquettes).</li>
</ul></li>
<li>Activer les annonces de la valeur actuelle du champ de la date uniquement lorsque vous vous d&#233;placez verticalement ;</li>
<li>Un bouton &quot;OK&quot; pour sauvegarder votre configuration ;</li>
<li>Un bouton &quot;Annuler&quot; pour annuler et fermer la bo&#238;te de dialogue.</li>
</ul></li>
</ul>
<h2 id="notes">Notes</h2>
<ul>
<li>Vous pouvez fermer cette bo&#238;te de dialogue en appuyant sur &#201;chap.</li>
<li>Vous pouvez assigner un raccourci pour ouvrir la bo&#238;te de dialogue dans le menu &quot;Gestes de Commandes&quot; et, plus pr&#233;cis&#233;ment, dans la cat&#233;gorie &quot;Jour de la semaine&quot;.</li>
<li>Si vous utilisez NVDA 2018.2 ou une version ult&#233;rieure, vous ne trouverez qu'un seul &#233;l&#233;ment dans le menu Outil pour rechercher votre jour, les param&#232;tres du module compl&#233;mentaire se trouvent dans le panneau Param&#232;tres NVDA.</li>
</ul>
<p>Version : 6.2.1<br />
Langues: 26 langues y compris le fran&#231;ais<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz.<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
<a href="https://addons.nvda-project.org/files/get.php?file=dw">T&#233;l&#233;charger le module compl&#233;mentaire dayOfTheWeek-6.2.1.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="dragonnaturallyspeaking">DragonNaturallySpeaking <a id="DragonNaturallySpeaking 1.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour le logiciel de dict&#233;e vocale Dragon
Naturally Speaking (version 10, 11 et 12.5). Ce module apporte les
scripts suivants:
1. Le script &quot;NVDA + maj + !&quot; pour lire le r&#233;sultat de la
reconnaissance vocale
2. la lecture automatique de ce r&#233;sultat quand il se pr&#233;sente dans
la bo&#238;te de r&#233;sultat
3. Le script &quot;control+pavNum plus&quot;(ordinateur de bureau), &quot;control+
=&quot; (ordinateur portable) pour allumer ou &#233;teindre le microphone
4. La lecture automatique de la bo&#238;te d&#39;information qui indique
entre autre l&#39;&#233;tat du microphone
5. Le script &quot;NVDA + maj + :&quot; pour lire cette boite d&#39;information
6. La lecture automatique du nouveau conseil du jour
7. Le script &quot;alt+control+1&quot; pour relire ce conseil du jour.
Pour une pr&#233;sentation de Dragon, vous pouvez consulter les fiches de
Daniel Poiraud ici : </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_dragon/index.htm">les fiches de Daniel Poiraud concernant Dragon</a><br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 1.0<br />
Derni&#232;re mise &#224; jour: 30 Septembre 2014<br />
<a href="https://blindhelp.github.io/DragonNaturallySpeaking%201.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire DragonNaturallySpeaking 1.0.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="dropbox">Dropbox <a id="dropbox-4.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire ajoute un raccourci permettant d&#39;annoncer le statut ou la version de Dropbox, mais aussi d&#39;ouvrire le menu contextuel de l&#39;ic&#244;ne Dropbox dans la zone de notification.  Il rends &#233;galement possible d&#39;utiliser les onglets de la bo&#238;te de dialogue pr&#233;f&#233;rences avec Ctrl+tab / Ctrl+Maj+Tab et Ctrl+PagePr&#233;c/Suiv.  Pour conclure, ajoute &#233;chapp pour activer le bouton Annuler.</code></pre>
<ul>
<li>Raccourci : NVDA+Alt+D<br />
</li>
<li>Ctrl+Alt+T annonce l'onglet actif.<br />
Probl&#232;mes connus<br />
</li>
<li>Si vous changez entre les onglets en utilisant les raccourcis, lorsque vous fermerez la fen&#234;tre des pr&#233;f&#233;rences, NVDA ne pourra pas savoir que les fen&#234;tres n'existent plus.<br />
Ce souci est connu dans NVDA, il est probablement du &#224; Windows et ne peut donc pas &#234;tre corrig&#233;.<br />
Langue: Anglais, Espagnol, Fran&#231;ais, Italien et 27 autres langues<br />
ajout&#233;s dans la version 4.3<br />
Ce module compl&#233;mentaire est mis &#224; jour avec les nouvelles sources puis retraduit en fran&#231;ais et en espagnol par R&#233;my Ruiz.<br />
Version: 4.3 (version stable non officielle)<br />
Derni&#232;re mise &#224; jour: 15 Mars 2018<br />
Auteur: Patrick ZAJDA,<br />
<script type="text/javascript">
<!--
h='&#122;&#x61;&#106;&#100;&#x61;&#46;&#102;&#114;';a='&#64;';n='&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#90;&#x41;&#74;&#68;&#x41;&#32;&#40;&#112;&#x61;&#116;&#114;&#x69;&#x63;&#x6b;&#32;&#x61;&#116;&#32;&#122;&#x61;&#106;&#100;&#x61;&#32;&#100;&#x6f;&#116;&#32;&#102;&#114;&#x29;</noscript><br />
Filaos et d'autres contributeurs<br />
<a href="https://blindhelp.github.io/dropbox-4.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire dropbox-4.3.nvda-addon (version stable) [via BlindHelp.github.io]</a></li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="eclipse-enhance">Eclipse Enhance <a id="eclipseEnhance-0.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions

Vous trouverez ci-dessous la documentation du module compl&#233;mentaire Eclipse Enhance traduite de l&#39;anglais vers le fran&#231;ais:</code></pre>
<h1 id="eclipse-enhance-1">Eclipse Enhance</h1>
<p>Ce module compl&#233;mentaire pour NVDA offre un support am&#233;lior&#233; tout en travaillant dans l'environnement de d&#233;veloppement Eclipse.</p>
<h2 id="fonctionnalit&#233;s-du-module-compl&#233;mentaire">Fonctionnalit&#233;s du module compl&#233;mentaire:</h2>
<h3 id="fonctionnalit&#233;s-principales">Fonctionnalit&#233;s principales:</h3>
<ul>
<li>Joue des sons diff&#233;rents pendant que vous utilisez le raccourci Eclipse <strong>CTRL+. (point)</strong> pour d&#233;terminer si une erreur ou un avertissement est s&#233;lectionn&#233;.</li>
<li>Joue des sons diff&#233;rents lorsque vous appuyez sur <strong>CTRL+S</strong> pour indiquer si le fichier enregistr&#233; contient des erreurs / avertissements.</li>
<li>Annonce le basculement des points de rupture, (breakpoints) en appuyant sur <strong>CTRL+MAJ+B</strong>.</li>
</ul>
<h3 id="fonctionnalit&#233;s-suppl&#233;mentaires-du-braille">Fonctionnalit&#233;s suppl&#233;mentaires du Braille:</h3>
<ul>
<li>Affiche des messages en braille si vous enregistrez un fichier qui contient des erreurs et / ou des avertissements.</li>
<li>Corrige un probl&#232;me qui emp&#234;che d'utiliser la touche retour arri&#232;re de l'afficheur braille pour aller &#224; la ligne pr&#233;c&#233;dente.</li>
</ul>
<h3 id="fonctionnalit&#233;s-vocales-suppl&#233;mentaires">Fonctionnalit&#233;s vocales suppl&#233;mentaires:</h3>
<ul>
<li>Annonce la ligne courante pendant que vous vous d&#233;placez avec les touches de d&#233;bogage.</li>
<li>Annonce la ligne courante lorsque vous appuyez sur CTRL+. (point) et le curseur se d&#233;place.</li>
<li>Annonce la ligne courante lorsque vous appuyez sur CTRL+MAJ+fl&#232;ches haut et bas pour aller &#224; la m&#233;thode pr&#233;c&#233;dente ou suivante.</li>
<li>Annonce la ligne courante lorsque vous appuyez sur CTRL+MAJ+P apr&#232;s avoir s&#233;lectionn&#233; une parenth&#232;se: ce raccourci saute &#224; la parenth&#232;se correspondante de fermeture ou d'ouverture.</li>
</ul>
<h2 id="configuration-declipse">Configuration d'Eclipse</h2>
<p>Afin de profiter de toutes les fonctionnalit&#233;s de ce module compl&#233;mentaire, vous devez configurer Eclipse pour mettre en &#233;vidence les erreurs et les avertissements au lieu de les souligner. Pour ce faire, proc&#233;dez comme suit:</p>
<ul>
<li>Ouvrir l'environnement Eclipse</li>
<li>Ouvrir le Menu Window (ALT-W)</li>
<li>Choisir l'&#233;l&#233;ment &quot;Preferences&quot;</li>
<li>Tab jusqu'&#224; la vue en arborescence</li>
<li>Acc&#233;dez jusqu'&#224; General, puis Editors, Text Editors, Annotations</li>
<li>Appuyez sur TAB pour aller &#224; la liste des annotations.</li>
</ul>
<p>Pour chaque annotation, vous pouvez choisir:</p>
<ul>
<li>Trois cases &#224; cocher (Vertical ruler, Overview ruler et Text As)</li>
<li>Une liste d&#233;roulante qui indique comment l'annotation est pr&#233;sent&#233;e dans le texte (Disponible lorsque vous avez coch&#233; la case Text As).</li>
</ul>
<p>D&#233;finir les annotations comme suit:</p>
<ul>
<li><strong>Breakpoints</strong>: Case &#224; cocher Text As coch&#233;e, puis TAB et choisissez &quot;highlighted&quot; &#224; partir de la liste d&#233;roulante.</li>
<li><strong>Errors</strong>: Case &#224; cocher Text As coch&#233;e, tpuis TAB et choisissez &quot;highlighted&quot; &#224; partir de la liste d&#233;roulante.</li>
<li><strong>Info</strong>: Case &#224; cocher Text As non coch&#233;e.</li>
<li><strong>Matching tags</strong>: Case &#224; cocher Text As non coch&#233;e.</li>
<li><strong>Occurrences</strong>: Case &#224; cocher Text As non coch&#233;e.</li>
<li><strong>Search Results</strong>: Case &#224; cocher Text As non coch&#233;e.</li>
<li><strong>Warnings</strong>: Case &#224; cocher Text As coch&#233;e, tpuis TAB et choisissez &quot;highlighted&quot; &#224; partir de la liste d&#233;roulante.</li>
</ul>
<h2 id="droits-de-reproduction-des-sons">Droits de reproduction des sons</h2>
<p>Les sons sont utilis&#233;s pour indiquer les avertissements et les erreurs, ceux-ci sont couverts par la licence Creative Commons.</p>
<ul>
<li><a href="https://www.freesound.org/people/Autistic%20Lucario/sounds/142608/">Visitez cette page pour le son d'erreur</a></li>
<li><a href="https://www.freesound.org/people/ecfike/sounds/135125/">Visitez cette page pour le son d'avertissement</a></li>
</ul>
<h2 id="auteurs">Auteurs:</h2>
<ul>
<li><p>Alberto Zanella</p></li>
<li><p>Alessandro Albano</p></li>
</ul>
<p>Version: 0.2<br />
Derni&#232;re mise &#224; jour: 12 Octobre 2018</p>
<p><a href="https://github-production-release-asset-2e65be.s3.amazonaws.com/92582336/dd6cb708-878a-11e7-9690-853e621e425c?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20181016%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20181016T115358Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=1ba436bb8a50bbb47c6689dd80faa5f92438e9d0b47345c6a1b6d6d8f9b2feae&amp;X-Amz-SignedHeaders=host&amp;actor_id=0&amp;response-content-disposition=attachment%3B%20filename%3DeclipseEnhance-0.2.nvda-addon&amp;response-content-type=application%2Foctet-stream">T&#233;l&#233;charger le module compl&#233;mentaire eclipseEnhance-0.2.nvda-addon en cliquant ici: [lien externe]</a></p>
<p><a href="https://github.com/albzan/eclipse-nvda">Code Source du module compl&#233;mentaire sur GitHub:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="eloquence-autolanguageswitching">eloquence-autoLanguageSwitching <a id="eloquence-autoLanguageSwitching.nvda-addon"></a></h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Synth&#233;tiseur Eloquence
Le module EloquenceAutoLanguageSwitching installe le synth&#233;tiseur
Eti Eloquence pour NVDA.
Il s&#39;agit d&#39;une version am&#233;lior&#233;e du pilote prenant en compte le
changement automatique de langue dans les documents balis&#233;s &#224; cet
effet.
Ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le
synth&#233;tiseur. </code></pre>
<p><a href="https://blindhelp.github.io/eloquence-autoLanguageSwitching.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire eloquence-autoLanguageSwitching.nvda-addon [via BlindHelp.github.io]</a></p>
<pre><code>Et la derni&#232;re version compatible avec la prochaine version de NVDA 2019.1.</code></pre>
<p><a href="https://www.nvda-fr.org/voix/%C3%89loquence-2018.11.17.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire &#201;loquence-2018.11.17.nvda-addon [lien externe]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="emoticons">Emoticons <a id="emoticons-9.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
N&#233;cessite NVDA 2018.3 ou ult&#233;rieur.
En utilisant ce module compl&#233;mentaire, la verbalisation du texte contenant les caract&#232;res de la frimousse seront remplac&#233;s par leur description humaine plus conviviale.               
Par exemple : la s&#233;quence &quot;:)&quot; sera prononc&#233; comme &quot;Frimousse Sourire&quot;, ou par exemple NVDA Reconna&#238;tra la signification de chaque emoji.                   
Vous pouvez profiter des fonctionnalit&#233;s suivantes :                    
Ins&#233;rer une frimousse                    
Parfois, une image vaut 1000 mots : utilisez le nouvel emoji pour animer vos messages instantan&#233;s pour indiquer &#224; vos contacts ce que vous ressentez.                     
Lorsque vous n&#39;&#234;tes pas s&#251;r des caract&#232;res pour une frimousse particuli&#232;re, ce module compl&#233;mentaire vous permet de s&#233;lectionner et ins&#233;rer dans votre texte comme dans une conversation.                    
Appuyer sur NVDA+I, ou &#224; partir du menu Outils -&gt; Ins&#233;rer une frimousse, pour ouvrir un dialogue avec les frimousses ou emoji fournis.                      
Ce dialogue vous permet de choisir une frimousse et d&#39;afficher les frimousses qui vous int&#233;ressent :                   </code></pre>
<ul>
<li>Un champ &#233;ditable vous permet de filtrer la recherche de la frimousse souhait&#233;e parmi les frimousses disponibles.</li>
<li>Gr&#226;ce &#224; un ensemble de boutons radio, vous pouvez choisir d'afficher uniquement la cat&#233;gorie emoji (alt+E) ou afficher uniquement la cat&#233;gorie frimousse standard (alt+s) ou afficher toutes les frimousses disponibles (alt+A).</li>
<li><p>Dans la liste des frimousses (alt+L) sont affich&#233;s respectivement sur trois colonnes : le nom de la frimousse, le type de frimousse (frimousse standard ou emoji), le caract&#232;re correspondant.</p>
Lorsque vous appuyez sur OK, les caract&#232;res pour la frimousse choisie sont copi&#233;s dans le presse-papiers, pr&#234;ts &#224; &#234;tre coll&#233;s.<br />
Dictionnaire des frimousses<br />
Le module compl&#233;mentaire emoticons permet d'avoir diff&#233;rents dictionnaires de parole en utilisant des profils de configuration.<br />
Cela signifie que vous pouvez cr&#233;er ou modifier un dictionnaire de parole sp&#233;cifique pour chaque profil personnalis&#233;.<br />
&#192; partir du Menu NVDA, Pr&#233;f&#233;rences -&gt; Dictionnaires de prononciation -&gt; Dictionnaire des frimousses, vous pouvez ouvrir un dialogue pour ajouter ou modifier les frimousses disponibles.<br />
En sauvegardant vos personnalisations, les nouveaux param&#232;tres de lecture des frimousses ne s'appliqueront qu'au profil que vous &#234;tes en train d'&#233;diter.<br />
Par exemple, vous pouvez souhaiter que NVDA ne annonce des frimousses personnalis&#233;es que dans le programme XxChat, mais pas dans les autres programmes de conversation: vous pouvez cr&#233;er un profil pour l'application XxChat et lui attribuer un dictionnaire de parole &#224; partir du menu Dictionnaires de prononciation, option du Dictionnaires des frimousses. Voir ci-dessous pour les Param&#232;tres des Frimousses par rapport aux profils de configuration.<br />
Vous pouvez &#233;galement exporter chaque dictionnaire de parole personnalis&#233; en appuyant sur le bouton &quot;Enregistrer et exporter le dictionnaire&quot;: de cette fa&#231;on, vos dictionnaires de parole seront enregistr&#233;s dans votre dossier de configuration utilisateur, sous-dossier speechDicts/emoticons.<br />
Le nom exact et l'emplacement du fichier de dictionnaire seront bas&#233;s sur le profil de configuration d'&#233;dition, qui sera affich&#233; dans le titre du dialogue Dictionnaire des frimousses.<br />
Param&#232;tres des Frimousses<br />
&#192; partir du menu Pr&#233;f&#233;rences -&gt; Param&#232;tres -&gt; Frimousses ouvre un panneau pour configurer l'activation de vos dictionnaires de parole pour chaque profil.<br />
Dans le panneau Param&#232;tres des Frimousses, vous pouvez choisir si le dictionnaire de parole doit ou non &#234;tre activ&#233; automatiquement lorsque NVDA bascule sur le profil que vous &#234;tes en train d'&#233;diter. Par d&#233;faut, il est d&#233;sactiv&#233; dans la configuration normale de NVDA et dans tous vos nouveaux profils.<br />
Si vous souhaitez garder propres vos dossiers de configuration, vous pouvez &#233;galement choisir dans ce dialogue si les dictionnaires non utilis&#233;s (associ&#233;s &#224; des profils non existants) seront supprim&#233;s du module compl&#233;mentaire lorsqu'il est d&#233;charg&#233;.<br />
Raccourcis clavier :<br />
Voici les raccourcis clavier par d&#233;faut, vous pouvez les modifier ou ajouter un nouveau raccourci pour ouvrir le panneau Param&#232;tres des Frimousses ou le dialogue Dictionnaire des frimousses :<br />
</li>
<li>NVDA+E : en activant/d&#233;sactivant l'annonce des frimousses, permet de basculer entre la lecture du texte comme il est &#233;crit, ou avec les frimousses remplac&#233;es par leur description humaine.</li>
<li>NVDA+I : affiche un dialogue pour choisir la frimousse que vous souhaitez copier.</li>
<li><p>Note : Sous Windows 10, il est &#233;galement possible d&#8217;utiliser le panneau emoji int&#233;gr&#233;.</p></li>
</ul>
<p>Remarque complementaires by BlindHelp:<br />
Note : Sous Windows 10, il est &#233;galement possible d'utiliser le panneau emoji int&#233;gr&#233;.</p>
<p>Comment fait-ont ?<br />
Placez le focus dans n&#8217;importe quelle zone de texte, appuyez sur Windows+point-virgule et utilisez les fl&#232;ches et la touche de tabulation pour taper l'emoji d&#233;sir&#233;.</p>
<p>A vous les smileys Lol ou les petits coeurs sur vos conversations priv&#233;es ou dans vos posts Facebook.</p>
<p>Auteurs : Chris Leo, Noelia Ruiz Mart&#237;nez, Mesar Hameed, Francisco Javier Estrada Mart&#237;nez<br />
Version : 9.0<br />
Compatible avec NVDA 2018.3 ou version ult&#233;rieure (requis).<br />
Langues: 30 langues y compris le fran&#231;ais<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz.<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
<a href="http://addons.nvda-project.org/files/get.php?file=emo">T&#233;l&#233;charger le module compl&#233;mentaire emoticons-9.0.nvda-addon par ici:</a></p>
<p>&#201;galement a &#233;t&#233; publi&#233;e La version 6.5 compatible &#224; partir de NVDA 2018.1.1 &#224; 2017.3. <a href="https://github.com/nvdaes/emoticons/releases/download/6.5/emoticons-6.5.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire emoticons-6.5.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="emule">eMule <a id="eMule-3.18.nvda-addon"></a></h1>
<p>Type: Extensions</p>
<ul>
<li>Autheurs : Noelia, Chris, Alberto.</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=em">version stable</a><br />
</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=em-dev">version de d&#233;veloppement</a></li>
</ul>
<p>Ce module compl&#233;mentaire rend Emule plus accessible avec NVDA en ajoutant des raccourcis clavier pour avoir des informations ou activer des fen&#234;tres particuli&#232;res.</p>
<p>Bas&#233; sur le module eMuleNVDASupport du m&#234;me autheur. D&#233;sinstallez d'abord eMuleNVDASupport qui cr&#233;erait des conflits de raccourcis clavier.</p>
<p>Test&#233; avec <a href="http://www.emule-project.net">eMule</a> 0.50a.</p>
<p>Touches de raccourcis</p>
<ul>
<li>control+maj+h : am&#232;ne la souris et le focus sur la barre d'outils principale.</li>
<li>control+maj+t : Lit la fen&#234;tre en cours.</li>
<li>control+maj+n : D&#233;place le focus sur le champ Nom de la fen&#234;tre Rechercher.</li>
<li>control+maj+p : Dans la fen&#234;tre de recherche, d&#233;place le focus et la souris &#224; la liste des param&#232;tres de recherche, ou modifie les options des champs.</li>
<li>control+maj+b : D&#233;place le focus &#224; la liste des r&#233;sultats dans la fen&#234;tre de recherche. Utilisable par exemple dans la fen&#234;tre de recherche, les Transferts de t&#233;l&#233;chargements, etc.</li>
<li>Ctrl + Maj + o : D&#233;place le focus aux zones d'&#233;dition en lecture seule dans la fen&#234;tre courante. Par exemple, les messages IRC re&#231;us, Serveurs disponibles, etc.</li>
<li>contr&#244;le + NVDA + f : Si le curseur est situ&#233; dans une zone d'&#233;dition en lecture seule, ouvre un dialogue de Recherche afin d'utiliser les commandes pour la recherche de texte disponible dans NVDA.</li>
<li>Ctrl + Maj + L : D&#233;place l'objet de navigation et la souris aux en-t&#234;tes de la liste actuelle.</li>
<li>Ctrl + Maj + Q : Lit le premier objet dans la barre d'&#233;tat, fournit des informations sur l'activit&#233; r&#233;cente.</li>
<li>Ctrl + Maj + W : Lit le second objet de la barre d'&#233;tat, contient des informations sur les fichiers et les utilisateurs sur le serveur actuel.</li>
<li>Ctrl + Maj + E: Lit le troisi&#232;me objet de la barre d'&#233;tat; utile pour conna&#238;tre la vitesse d'Envoi / T&#233;l&#233;chargement.</li>
<li>Ctrl + Maj + r: Affiche Le quatri&#232;me objet de la barre d'&#233;tat, les rapports sur la connexion de r&#233;seau eD2K et Kad.</li>
</ul>
<p>Gestion des colonnes.</p>
<p>Lorsque vous &#234;tes dans une liste, vous pouvez d&#233;placer le curseur entre les lignes et les colonnes en utilisant Alt + Ctrl + Fl&#232;ches. Dans ce module les touches de raccourci suivantes sont &#233;galement disponibles :</p>
<ul>
<li>NVDA + control +1-0 : Lit les 10 premi&#232;res colonnes.</li>
<li>NVDA + maj +1-0 : Lit colonnes 11 &#224; 20.</li>
<li>NVDA + Maj + C : Copie le contenu de la derni&#232;re colonne lue dans le presse-papiers.</li>
</ul>
<p>Version : 3.18<br />
Langues: 26 langues y compris le fran&#231;ais<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz.<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
<a href="https://addons.nvda-project.org/files/get.php?file=em">T&#233;l&#233;charger le module compl&#233;mentaire eMule-3.18.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="pilote-pour-les-terminaux-braille-eurobraille">Pilote pour les Terminaux Braille (Eurobraille) <a id="Erbnvda2017-06-20.nvda-addon"></a></h1>
<p>Type: Pilote natif pour les terminaux Braille Eurobraille.<br />
Auteurs: Eurobraille, Michel Such<br />
<a href="http://www.eurobraille.fr/">Site Eurobraille FR</a><br />
Version : 2017.06.20<br />
Langue: Anglais, Fran&#231;ais, Espagnol et Italien<br />
Traduit en fran&#231;ais par: Michel Such.<br />
Traduit en espagnol par: R&#233;my Ruiz.<br />
<a href="https://blindhelp.github.io/Erbnvda2017-06-20.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire Erbnvda2017-06-20.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="extendedwinamp">extendedWinamp <a id="extendedWinamp-1.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Le module compl&#233;mentaire nomm&#233;:
extendedWinamp-1.1.nvda-addon
Ce module ajoute des fonctionnalit&#233;s au module d&#39;application pour
Winamp d&#233;j&#224; disponible dans NVDA.
Langues: Anglais, Espagnol, Fran&#231;ais, Italien et 16 autres langues
ajout&#233;s dans la version 1.1.
Version: 1.1
Auteurs: Hrvoje Katic, et l&#39;&#233;quipe de NVDA-addon
Note: L&#39;auteur ne assume plu ce compl&#233;ment, seule l&#39;&#233;quipe
NVDA-addon.
Changements pour la version 1.1
Nouvelles langues: aragonais, arabe, n&#233;erlandais, allemand, finnois,
fran&#231;ais, galicien, hongrois, italien, japonais, cor&#233;en, n&#233;palais,
portugais (Br&#233;sil), russe,Slovaque, slov&#232;ne, espagnol, tamoul,
turc.
Changements pour la version 1.0
Version initiale
Commentaire par BlindHelp: Cette version apporte quelques messages
traduits en fran&#231;ais, qui, &#224; mon go&#251;t, ne sont pas
tellement compr&#233;hensibles. Pareil pour les messages traduit en
espagnol.
se module compl&#233;mentaire a &#233;t&#233; publi&#233; sur le site comunautaire des
modules compl&#233;mentaires NVDA </code></pre>
<p><a href="https://blindhelp.github.io/extendedWinamp-1.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire extendedWinamp-1.1.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="extendedwinamp-mod-remyruiz">extendedWinamp-mod-RemyRuiz <a id="extendedWinamp-1.1-mod-RemyRuiz.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Le module compl&#233;mentaire nomm&#233;:
extendedWinamp-1.1-mod-RemyRuiz.nvda-addon
Ce module ajoute des fonctionnalit&#233;s au module d&#39;application pour
Winamp d&#233;j&#224; disponible dans NVDA.
Langues: Anglais, Espagnol, Fran&#231;ais, Italien et 16 autres langues
ajout&#233;s dans la version 1.1.
Version: 1.1
Auteurs: Hrvoje Katic, et l&#39;&#233;quipe de NVDA-addon
Note: L&#39;auteur ne assume plu ce compl&#233;ment, seule l&#39;&#233;quipe
NVDA-addon.
Changements pour la version 1.1
Nouvelles langues: aragonais, arabe, n&#233;erlandais, allemand, finnois,
fran&#231;ais, galicien, hongrois, italien, japonais, cor&#233;en, n&#233;palais,
portugais (Br&#233;sil), russe,Slovaque, slov&#232;ne, espagnol, tamoul,
turc.
Changements pour la version 1.0
Version initiale
Commentaire par BlindHelp: Cette m&#234;me version est identique &#224; la
pr&#233;c&#233;dente sauf qu&#39;il contient une meilleure traduction des messages
en fran&#231;ais et en espagnol pour une meilleure compr&#233;hension fait par
mes soins.
Pour ma part je recommande instamment de t&#233;l&#233;chargez et installer
cette version modifier
N&#39;oubliez pas SVP de d&#233;sinstaller au pr&#233;alable le module
compl&#233;mentaire avant d&#39;installer celui-ci, en lieu de faire une
actualisation du pr&#233;sent module compl&#233;mentaire!!!
se module compl&#233;mentaire a &#233;t&#233; publi&#233; dans le coffre des Modules
Compl&#233;mentaires pour NVDA </code></pre>
<p><a href="https://blindhelp.github.io/extendedWinamp-1.1-mod-RemyRuiz.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire extendedWinamp-1.1-mod-RemyRuiz.nvda-addon [via BlindHelp.github.io]</a><br />
Commandes:<br />
Touches &#224; utilis&#233;es lorsque le module a &#233;t&#233; install&#233; et le programme Winamp a &#233;t&#233; d&#233;marr&#233;, une fois que vous jouez une piste ou un album, n'oubliez pas que vous devez &#234;tre dans la fen&#234;tre principale du programme Winamp:</p>
<ul>
<li>s active ou d&#233;sactive le mode al&#233;atoire (shuffle)<br />
</li>
<li>r active/d&#233;sactive le mode r&#233;p&#233;tition<br />
</li>
<li>F5 coupe le son<br />
</li>
<li>F6 change le volume &#224; 25%<br />
</li>
<li>F7 change le volume &#224; 50%<br />
</li>
<li>F8 change le volume &#224; 100%<br />
</li>
<li>Maj+Fl&#232;che gauche son plus &#224; gauche<br />
</li>
<li>Maj+Fl&#232;che droite son plus &#224; droite<br />
</li>
<li>Maj+Fl&#232;che haute son au centre<br />
</li>
<li>Control+Maj+t annonce la dur&#233;e de la piste<br />
</li>
<li>Control+Maj+e annonce le temps &#233;coul&#233;<br />
</li>
<li>Control+Maj+r annonce le temps restant<br />
</li>
<li>Maj+-r &#233;couter la fin de la piste (six derni&#232;res secondes par d&#233;faut)<br />
</li>
<li>Control+r d&#233;finir le temps de fin de piste (en secondes) &#224; utiliser lorsque l'on appel la commande &#233;couter la fin de la piste<br />
</li>
<li>Maj+j -d&#233;finir le temps de saut alternatif (en secondes)<br />
</li>
<li>Control+Fl&#232;che droite saut en avant alternatif (six secondes par d&#233;faut)<br />
</li>
<li>Control+Fl&#232;che gauche saut en arri&#232;re alternatif (six secondes par d&#233;faut)</li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="extendedwinamp-1.1-2017-03-24">extendedWinamp-1.1-2017-03-24 <a id="extendedWinamp-1.1-2017-03-24.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Le module compl&#233;mentaire nomm&#233;:
extendedWinamp-1.1.nvda-addon
Ce module ajoute des fonctionnalit&#233;s au module d&#39;application pour
Winamp d&#233;j&#224; disponible dans NVDA.
Langues: Anglais, Espagnol, Fran&#231;ais, Italien et 16 autres langues
ajout&#233;s dans la version 1.1.
Version: 1.1
Auteurs: Hrvoje Katic, et l&#39;&#233;quipe de NVDA-addon
Note: L&#39;auteur ne assume plu ce compl&#233;ment, seule l&#39;&#233;quipe
NVDA-addon.
Changements pour la version 1.1
Nouvelles langues: aragonais, arabe, n&#233;erlandais, allemand, finnois,
fran&#231;ais, galicien, hongrois, italien, japonais, cor&#233;en, n&#233;palais,
portugais (Br&#233;sil), russe,Slovaque, slov&#232;ne, espagnol, tamoul,
turc.
Changements pour la version 1.0
Version initiale</code></pre>
<h1 id="t&#233;l&#233;chargez-le-nouveau-module-compl&#233;mentaire-compatible-winamp-5.8-build-3660">T&#233;l&#233;chargez le nouveau module compl&#233;mentaire compatible Winamp 5.8 Build 3660</h1>
<p>Commentaire par BlindHelp:<br />
Avec l'ancien module compl&#233;mentaires Winamp (extendedWinamp-1.1.nvda-addon),<br />
quand on va dans l'&#233;diteur de playlist, la liste des morceaux n'est pas annonc&#233; lorsque vous vous d&#233;placez en haut et en bas de la liste.</p>
<p>C'est comme &#231;a depuis qu'une chose dans le module compl&#233;mentaire utilis&#233; a &#233;tait modifi&#233; dans NVDA.<br />
Maintenant, je vois qu'il n'a pas &#233;t&#233; mis &#224; jour dans la version sur la page des modules compl&#233;mentaires NVDA, voici donc &#224; nouveau le module compl&#233;mentaire avec le fichier winamp.py mis &#224; jour et l'&#233;diteur de playlist (playlist editor) lequel devrait fonctionner correctement avec celui-ci.</p>
<p>Note: il n'y a rien de nouveau &#224; traduire dans cette mise &#224; jour, il suffit d'avoir ajout&#233; quelque chose sur une seule ligne dans le fichier source, rien &#224; voir avec les traductions.</p>
<p>Nom du module compl&#233;mentaire pr&#233;c&#233;dent:<br />
extendedWinamp-1.1.nvda-addon<br />
Nom du module compl&#233;mentaire r&#233;cemment mis &#224; jour:<br />
extendedWinamp-1.1-2017-03-24.nvda-addon<br />
Le nom du fichier change simplement de nom afin de le diff&#233;rencier du module compl&#233;mentaire pr&#233;c&#233;dent (en interne c'est le m&#234;me nom et num&#233;ro de version).<br />
Version: 1.1 (version non officielle)<br />
Derni&#232;re mise &#224; jour: 24 Mars 2017</p>
<p><a href="https://blindhelp.github.io/extendedWinamp-1.1-2017-03-24.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire extendedWinamp-1.1-2017-03-24.nvda-addon [via BlindHelp.github.io]</a></p>
<p>Note: Les commandes r&#233;pertori&#233;es ci-dessus sont les m&#234;mes pour ce module compl&#233;mentaire.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="fakeclipboardanouncement">fakeClipboardAnouncement <a id="fakeClipboardAnouncement.nvda-addon"></a></h1>
<pre><code>Type: Extensions
SimulerAnnoncePresse-papiers
Description: Le module compl&#233;mentaire suivant annoncera les
commandes clavier Ctrl+a Ctrl+C Ctrl+V Ctrl+x Ctrl+Y Ctrl+Z lorsque
ils sont press&#233;s.
1.- Utilit&#233; du module compl&#233;mentaire:
Lors de l&#39;utilisation des raccourcis clavier pour utiliser le
presse-papiers sont annonc&#233;es par NVDA et est ensuite envoy&#233;e &#224;
l&#39;application.
Remarque : Se module compl&#233;mentaire ne fonctionne pas dans la
console Windows.
2.- Commandes:     
- -Control+C: copier le texte ou le fichier s&#233;lectionn&#233; dans le presse-papiers.
- Le message annoncer par NVDA est: &quot;Copier&quot;
- - Control+X: couper le texte ou le fichier s&#233;lectionn&#233; et le d&#233;placez dans le presse-papiers.
- Le message annoncer par NVDA est: &quot;Couper&quot;
- - Control+V: pour coller le contenu du presse-papiers.
- Le message annoncer par NVDA est: &quot;Coller&quot;
 - Control+A: s&#233;lectionner tout le texte ou tous les fichiers.
 Le message annoncer par NVDA est: &quot;S&#233;lectionner Tout&quot;
 - Control+Z: annuler la derni&#232;re action.
 Le message annoncer par NVDA est: &quot;Annuler&quot;
 - Control+Y: r&#233;tablir la derni&#232;re action.
 Le message annoncer par NVDA est: &quot;R&#233;tablir&quot;
     Langues: Anglais, Espagnol, Fran&#231;ais, Italien, slovaque et tch&#232;que.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 1.0
Auteur: Peter V&#225;gner et autres contributeurs de NVDA </code></pre>
<p><script type="text/javascript">
<!--
h='&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#46;&#x73;&#x6b;';a='&#64;';n='&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#80;&#x65;&#116;&#x65;&#114;&#32;&#86;&#xe1;&#x67;&#110;&#x65;&#114;&#32;&#40;&#112;&#x65;&#116;&#x65;&#114;&#46;&#118;&#32;&#x61;&#116;&#32;&#100;&#x61;&#116;&#x61;&#x67;&#x61;&#116;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#x73;&#x6b;&#x29;</noscript> <a href="https://blindhelp.github.io/fakeClipboardAnouncement.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire fakeClipboardAnouncement.nvda-addon [via BlindHelp.github.io]</a><br />
S'il vous pla&#238;t Merci de d&#233;sinstaller ce module compl&#233;mentaire si vous avez d&#233;j&#224; install&#233; le module compl&#233;mentaire &quot;NVDAExtensionGlobalPlugin&quot; car le module &quot;fakeClipboardAnouncement&quot; est inclut dans celui-ci.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="fen-code-reader">FEN Code Reader <a id="fenCodeReader.NVDA-addon"></a></h1>
<pre><code>Description: D&#233;crit une position de jeu d&#39;&#233;checs a partir de un code
FEN
Auteur : Javi Dominguez </code></pre>
<p><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#74;&#x61;&#118;&#x69;&#32;&#68;&#x6f;&#x6d;&#x69;&#110;&#x67;&#x75;&#x65;&#122;&#32;&#40;&#102;&#106;&#x61;&#118;&#x69;&#100;&#x73;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Langues: Anglais, Espagnol et Fran&#231;ais.<br />
(Traduit en fran&#231;ais par R&#233;my Ruiz)<br />
Version: 1.0<br />
Derni&#232;re mise &#224; jour : 14 F&#233;vrier 2016<br />
<a href="https://blindhelp.github.io/fenCodeReader.NVDA-addon">T&#233;l&#233;charger le module compl&#233;mentaire fenCodeReader.NVDA-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="festivaltts-2.0-mod.nvda-addon">festivalTts-2.0-mod.nvda-addon <a id="festivalTts-2.0-mod.nvda-addon"></a></h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Festival Text to Speech
Synth&#233;tiseurs Vocaux Festival pour NVDA 2012.2 ou sup&#233;rieur
Le syst&#232;me de synth&#232;se vocale Festival
Version: 2.0
Auteur: NV Access Limited </code></pre>
<p><script type="text/javascript">
<!--
h='&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#46;&#x6f;&#114;&#x67;';a='&#64;';n='&#x61;&#100;&#x6d;&#x69;&#110;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+e+'<\/'+'a'+'>');
// -->
</script><noscript>&#x61;&#100;&#x6d;&#x69;&#110;&#32;&#x61;&#116;&#32;&#110;&#118;&#x61;&#x63;&#x63;&#x65;&#x73;&#x73;&#32;&#100;&#x6f;&#116;&#32;&#x6f;&#114;&#x67;</noscript><br />
et Olga Yakovleva<br />
<script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+e+'<\/'+'a'+'>');
// -->
</script><noscript>&#x59;&#x61;&#x6b;&#x6f;&#118;&#108;&#x65;&#118;&#x61;&#46;&#x4f;&#46;&#86;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;</noscript><br />
Langues support&#233;s dans la version modifier: Anglais, Espagnol, Italien et Tch&#232;que.<br />
Contrairement &#224; la version d'origine qui contient l'Anglais puis le Tch&#232;que Avec la commande, NVDA + Control + S, vous choisissez dans la liste des synth&#233;tiseurs Festival.<br />
Avec la commande, NVDA + Control + V, vous trouverez une liste des voix disponibles et leurs langues.<br />
<a href="https://blindhelp.github.io/festivalTts-2.0-mod.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire festivalTts-2.0-mod.nvda-addon [via BlindHelp.github.io]</a><br />
<a href="http://www.nvda-project.org/wiki/ExtraVoices">Source de la page en anglais &#224; consulter pour les Voix Extra pour NVDA!</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="file-reader">File Reader <a id="File Reader.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Lit les fichiers sans &#234;tre vu
Description: Lit le fichier avec NVDA sans &#234;tre vu. Utilisez le menu
lecteur de documents pour commencer.
Il vous permet de lire avec les m&#233;moires tampons de texte invisible.
Il y a un menu ajout&#233; &#224; la barre de t&#226;ches syst&#232;me et il vous
annonce toutes les touches de raccourci que vous avez besoin de
savoir.
Langues: Anglais, Espagnol et Fran&#231;ais.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 1.1.    
Auteur: Oriol Gomez </code></pre>
<p><a href="https://blindhelp.github.io/File%20Reader.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire File Reader.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="firefox">Firefox <a id="firefox v1.2.nvda-addon"></a></h1>
<p>Type: Extensions<br />
Pour ceux et celles qui utilisent&#160; Firefox avec NVDA, voici un module compl&#233;mentaire qui compl&#232;te celui embarqu&#233; dans NVDA et qui apporte:<br />
l'annonce du nom suivi de la position&#160; de l'onglet (si plusieurs onglets sont ouverts)<br />
la commande clavier &quot;control+=&quot; pour aller &#224; la liste des onglets,<br />
la lecture correcte de la barre d'&#233;tat dynamiquement ou avec la commande clavier &quot;NVDA+Fin&quot;,<br />
la possibilit&#233; de d&#233;sactiver la lecture dynamique de cette barre d'&#233;tat si elle est trop g&#234;nante.<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 1.2<br />
Derni&#232;re mise &#224; jour: 10 Janvier 2017<br />
<a href="https://blindhelp.github.io/firefox%20v1.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire firefox v1.2.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="focus-highlight">Focus Highlight <a id="focusHighlight-5.5.nvda-addon"></a></h1>
<pre><code>Type: Extensions
En dessinant un rectangle color&#233;, ce module compl&#233;mentaire permet aux utilisateurs malvoyants, &#233;ducateurs voyants ou aux d&#233;veloppeurs de suivre l&#39;emplacement de l&#39;objet navigateur de NVDA et l&#39;objet mis en focus ou le contr&#244;le.
Les couleurs suivantes sont utilis&#233;es par ce module compl&#233;mentaire :</code></pre>
<ul>
<li>Rectangle traits mince en ligne pointill&#233; vert, pour indiquer l'objet navigateur.</li>
<li>Rectangle mince rouge, pour indiquer l'objet mis en focus ou le contr&#244;le.</li>
<li>Rectangle &#233;pais rouge, pour indiquer lorsque l'objet navigateur et l'objet mis en focus sont chevauchent.</li>
<li>Rectangle &#233;pais en ligne pointill&#233; bleu, pour indiquer &#224; NVDA qui est en mode focus, c'est-&#224;-dire les principaux types sont pass&#233;s au contr&#244;le.</li>
</ul>
<p>Pour d&#233;sactiver le suivi d'objets, d&#233;sinstallez le module compl&#233;mentaire.<br />
Langues: Plusieurs langues inclus le fran&#231;ais.<br />
Traduit en fran&#231;ais par R&#233;my Ruiz.<br />
Version: 5.5<br />
Derni&#232;re mise &#224; jour: 20 D&#233;cembre 2018<br />
Auteurs : Takuya Nishimoto</p>
<p><a href="https://github.com/nvdajp/focusHighlight/releases/download/5.5/focusHighlight-5.5.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire focusHighlight-5.5.nvda-addon via la page de l'auteur en cliquant ici:</a></p>
<p><a href="https://addons.nvda-project.org/files/get.php?file=fh">T&#233;l&#233;charger le module compl&#233;mentaire focusHighlight-5.5.nvda-addon via le lien du site comunautaire des modules compl&#233;mentaires NVDA en cliquant ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="ifree-skype-recorder">iFree-Skype-Recorder <a id="iFree-Skype-Recorder-2.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour le logiciel iFree Skype Recorder
Description: Ce module compl&#233;mentaire am&#233;liore l&#39;accessibilit&#233; du logiciel iFree Skype Recorder avec NVDA
Langues: Anglais, Espagnol, Fran&#231;ais et Arabe
Traduit en espagnol par R&#233;my Ruiz.
Version: 2.0
Auteurs: Mohammed, Yannick, R&#233;my, Abdellah ZINEDDINE, Abdel      
Derni&#232;re mise &#224; jour: 6 Juin 2016 </code></pre>
<p><a href="http://cyber25.free.fr/nvda-addons/iFree-Skype-Recorder-2.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire iFree-Skype-Recorder-2.0.nvda-addon par ici: [lien externe]</a> Voici le lien direct de t&#233;l&#233;chargement de la derni&#232;re version du logiciel <a href="http://www.ifree-recorder.com/iFreeRecorder.exe">iFreeRecorder</a> <a href="http://www.ifree-recorder.com/">iFreeRecorder page d&#8217;accueil en anglais</a><br />
Pour plus d'informations vous pouvez consulter la documentation pour<br />
la version 2.0 depuis le Gestionnaire des modules compl&#233;mentaires<br />
(dans G&#233;rer les modules compl&#233;mentaires)<br />
Chercher le nom du module compl&#233;mentaire nomm&#233;:<br />
Pour le logiciel iFree Skype Recorder<br />
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,<br />
puis la documentation s'ouvre.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="instant-translate-4.1-dev-mod-remy-ruiz">Instant Translate 4.1-dev-mod-Remy Ruiz <a id="Instant Translate 4.1-dev-mod-Remy Ruiz"></a></h1>
<pre><code>Type: Extensions
Je suis heureux de vous dire qu&#39;instantTranslate fonctionne &#224; nouveau !
Maintenant il utilise le Service de Traduction Yandex au lieu de Google.
Remarque&#160;: il pourrait y avoir quelques probl&#232;mes de qualit&#233; en raison du service de traduction.
S&#39;il vous pla&#238;t, v&#233;rifier son fonctionnement.
Merci.
Description: Ce module compl&#233;mentaire permet de traduire le texte
s&#233;lectionn&#233; et ou le texte copi&#233; dans le presse-papiers d&#39;une langue
&#224; une autre. Il utilise un service externe.
Langues: Anglais, Espagnol, Fran&#231;ais, et 23 autres langues ajout&#233;s
dans la version 4.1-dev.
Traduit en fran&#231;ais par R&#233;my Ruiz.
Version: 4.1-dev
Auteurs : Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto
Buffolino et d&#39;autres contributeurs de NVDA.
Note: la version d&#39;instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon
c&#39;est une version modifi&#233; par mes soins, il inclus la derni&#232;re mise
&#224; jour du fichier nvda.po puis la traduction du fichier manifest.ini
en fran&#231;ais.
Ce n&#39;est pas inclus dans le dossier de la langue en fran&#231;ais dans la
version Instant Translate 4.1-dev. 
J&#39;ai traduit  aussi les derniers changements du module compl&#233;mentaire dans la doc en fran&#231;ais.
 Cela est fait aussi pour la langue en espagnol. 
J&#39;oubliez il faut configurer la langue sible et destination.
puis d&#233;sactivez l&#8217;option automatique. </code></pre>
<p><a href="https://blindhelp.github.io/instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire instantTranslate-4.1-dev-mod-RemyRuiz.nvda-addon [via BlindHelp.github.io]</a></p>
<pre><code>Quelques notes a propos du module compl&#233;mentaire Instant Translate    </code></pre>
<p>version 4.1-dev.</p>
<p>1.- Introduction:<br />
Ce module compl&#233;mentaire permet de traduire le texte s&#233;lectionn&#233; et ou le texte copi&#233; dans le presse-papiers d'une langue &#224; une autre. Il utilise un service externe.</p>
<p>2.- Configurer les langues:<br />
Pour configurer la langue source, destination et dans le cas d'une permutation, allez &#224; : Menu NVDA/Pr&#233;f&#233;rences/Param&#232;tres d'Instant Translate.</p>
<p>y a deux listes d&#233;roulantes appel&#233;es &quot;Langue source&quot; et &quot;Langue cible&quot; et une case &#224; cocher pour d&#233;cider si la traduction doit &#234;tre copi&#233;e dans le presse-papiers.</p>
<p>En outre, si vous avez s&#233;lectionn&#233; l'option automatique (le premier choix) dans la liste d&#233;roulante &quot;Langue source&quot;, Il y a aussi une liste d&#233;roulante appel&#233;e &quot;Langue d'alternance&quot; et une case &#224; cocher sur alternance automatique.</p>
<p>La signification des deux premi&#232;res listes d&#233;roulantes et de la case &#224; cocher pour la copie est claire, mais quelques mots au sujet du reste sont n&#233;cessaires.</p>
<p>Rappelez-vous toujours que les explications ci-dessous supposent la langue source, d&#233;finie sur l'option automatique.</p>
<p>La liste d&#233;roulante &quot;Langue d'alternance&quot; est utile lorsque vous permutez par script (voir ci-dessous) la langue source et la langue cible ; en effet, une langue cible d&#233;finie sur l'option automatique n'a aucun sens, donc le module compl&#233;mentaire lui affecte la valeur de la liste d&#233;roulante ci-dessus.</p>
<p>Alors, Imaginez cette situation : vous traduisez g&#233;n&#233;ralement vers l'Anglais (votre langue principale), mais parfois (par exemple, lorsque vous &#233;crivez un document), vous avez besoin de traduire vers l'Italien (votre seconde langue, supposons); vous pouvez d&#233;finir la zone de liste d&#233;roulante &quot;Langue d'alternance&quot; &#224; l'Italien, donc vous ferez la traduction de l'Anglais vers l'Italien sans acc&#233;der directement aux param&#232;tres du module compl&#233;mentaire. &#201;videmment, cette fonction a une utilit&#233; majeure ou mineure selon vos besoins plus fr&#233;quents.</p>
<p>Maintenant, la case &#224; cocher alternance automatique : elle appara&#238;t si et seulement si vous d&#233;finissez l'option automatique dans la liste d&#233;roulante &quot;Langue source&quot;, et est directement connect&#233;e avec la liste d&#233;roulante &quot;Langue d'alternance&quot;. Si vous l'activez, le module compl&#233;mentaire tente de permuter automatiquement depuis la configuration de votre source et destination &#224; une configuration o&#249; la destination devient la langue source, et la langue s&#233;lectionn&#233;e dans la liste d&#233;roulante &quot;Langue d'alternance&quot; est la nouvelle langue destination ; tr&#232;s utile si la langue source du texte que vous voulez traduire est la langue destination.</p>
<p>Un exemple simple : reprenons &#224; l'esprit la situation imagin&#233;e pr&#233;c&#233;demment ; Si vous traduisez un texte dans une langue diff&#233;rente de l'Anglais, il n'y a pas de probl&#232;me, vous obtenez la traduction correcte en Anglais. Mais si vous avez besoin de traduire un texte de l'Anglais, normalement vous obtenez une traduction en Anglais identique au texte original, et c'est un peu inutile. Gr&#226;ce &#224; la fonction alternance automatique, cependant, en supposant que vous voulez savoir comment votre texte sonne en Italien, le module compl&#233;mentaire commute automatiquement la langue cible &#224; l'Italien, donc elle retourne une traduction valide.</p>
<p>En tout cas, il s'agit d'une configuration temporaire ; si cette option n'a aucun effet (c'est exp&#233;rimental), essayez de permuter manuellement &#224; une configuration stable, en utilisant le geste d'alternance d&#233;crites ci-dessous. C'est exp&#233;rimental car dans certaines situations (avec des textes courts, typiquement), Google ne reconna&#238;t pas la v&#233;ritable langue source correctement, et vous devrez permuter manuellement les langues par script, afin de forcer la langue source &#224; la langue cible pr&#233;c&#233;dente (Anglais dans notre exemple).</p>
<p>3.- Utilisation:<br />
Vous pouvez utiliser ce module compl&#233;mentaire de deux fa&#231;ons :</p>
<ol style="list-style-type: decimal">
<li>S&#233;lectionnez du texte en utilisant les commandes de s&#233;lection (maj avec les touches fl&#233;ch&#233;es, par exemple) et appuyez sur la touche associ&#233;e pour traduire.</li>
</ol>
<p>Le r&#233;sultat de la traduction sera lu avec le synth&#233;tiseur que vous utilisez.</p>
<ol start="2" style="list-style-type: decimal">
<li>Vous pouvez &#233;galement traduire le texte depuis le presse-papiers.</li>
</ol>
<p>4.- Raccourcis clavier:</p>
<pre><code>  Toutes les commandes suivantes doivent &#234;tre frapp&#233;es apr&#232;s la
    touche modificatrice &quot;NVDA+Maj+t&quot;:</code></pre>
<ul>
<li>T: Traduit le texte s&#233;lectionn&#233;,</li>
<li>Maj+t: Traduit le texte depuis le presse-papiers,</li>
<li>S: Permute les langues source et cible,</li>
<li>A: Annonce la configuration courante,</li>
<li>C: Copie le dernier r&#233;sultat dans le presse-papiers,</li>
<li>I: Identifie la langue du texte s&#233;lectionn&#233;,</li>
<li>H: Annonce toutes les commandes disponibles pour l'utilisateur.</li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="jumptoline">JumpToLine <a id="jumpToLine-v1.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Acc&#233;der &#224; une ligne d&#39;un texte avec NVDA+Maj+j
Le raccourci &quot;NVDA+Maj+j&quot; vous permet d&#39;acc&#233;der une ligne
particuli&#232;re du document par son num&#233;ro de ligne. Une boite de
dialogue vous demande d&#39;entrer le num&#233;ro de cette ligne, en
l&#39;initialisant par d&#233;ffaut avec le num&#233;ro de la ligne courante.
Comme son nom l&#39;indique, il vous permet de sauter &#224; n&#39;importe quelle
ligne dans n&#39;importe quel texte, y compris les sites Web.
Raccourci clavier: NVDA+Maj+J
Langues: Espagnol anglais, fran&#231;ais.
Version: 1.2
Auteur: Oriol Gomez (modifi&#233; par Paul de la liste scriptNVDA)
Traduit en fran&#231;ais et espagnol par: R&#233;my Ruiz
Derni&#232;re mise &#224; jour: 22 F&#233;vrier 2013</code></pre>
<p><a href="https://blindhelp.github.io/jumpToLine-v1.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire jumpToLine-v1.2.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="listeiconeszonenotification">ListeIconesZoneNotification <a id="ListeIconesZoneNotification.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Liste des icones de la zone de notification
Description: Affiche la liste des icones dans la zone de
notification avec NVDA+F11
Version: 1.0.
Author: Yannick Mayot, avec la participation de Daniel Poiraud
Langue: Fran&#231;ais. </code></pre>
<p><a href="https://blindhelp.github.io/ListeIconesZoneNotification.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire ListeIconesZoneNotification.nvda-addon [via BlindHelp.github.io]</a><br />
S'il vous pla&#238;t Merci de d&#233;sinstaller ce module compl&#233;mentaire si vous avez d&#233;j&#224; install&#233; le module compl&#233;mentaire &quot;NVDAExtensionGlobalPlugin&quot; car le module &quot;ListeIconesZoneNotification&quot; est inclut dans celui-ci.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="modifylockannouncement">modifyLockAnnouncement <a id="modifyLockAnnouncement.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Changement de l'annonce des touches de verrouillage<br />
Description: Ce module compl&#233;mentaire permet d'offrir la possibilit&#233; de personnaliser l'annonce des touches verrouillage num&#233;rique, verrouillage majuscule, ainsi que la touche arr&#234;t<br />
Version : 1.0<br />
Langues: Anglais, Fran&#231;ais et Espagnol<br />
Traduit en espagnol par: R&#233;my Ruiz<br />
Auteurs : Pierre-Louis, Corentin, R&#233;my, Abdel<br />
Derni&#232;re mise &#224; jour: 6 Juin 2016</p>
<p><a href="http://cyber25.free.fr/nvda-addons/modifyLockAnnouncement.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire modifyLockAnnouncement.nvda-addon par ici: [lien externe]</a></p>
<pre><code>Pour plus d&#39;informations vous pouvez consulter la documentation pour
la version 1.0 depuis le Gestionnaire des modules compl&#233;mentaires
(dans G&#233;rer les modules compl&#233;mentaires)
Chercher le nom du module compl&#233;mentaire nomm&#233;:
modifyLockAnnouncement
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,
puis la documentation s&#39;ouvre.</code></pre>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="mp3directcut">Mp3DirectCut <a id="mp3DirectCut-4.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation de
l&#39;&#233;diteur de fichiers mp3 MP3DirectCut avec NVDA.      
Version : 4.2
Langues: Anglais, Fran&#231;ais, Espagnol, Arabe et autres langues.
Traduit en espagnol par: R&#233;my Ruiz</code></pre>
<p>Auteurs : Abdel, R&#233;my RUIZ, Abdellah ZINEDDINE, Jean-Fran&#231;ois COLA<br />
Derni&#232;re mise &#224; jour: 10 Ao&#251;t 2018 <a href="https://addons.nvda-project.org/files/get.php?file=mp3dc">T&#233;l&#233;charger le module compl&#233;mentaire mp3DirectCut-4.2.nvda-addon par ici:</a></p>
<pre><code>Pour plus d&#39;informations vous pouvez consulter la documentation pour
la version 4.2 depuis le Gestionnaire des modules compl&#233;mentaires
(dans G&#233;rer les modules compl&#233;mentaires)
Chercher le nom du module compl&#233;mentaire nomm&#233;:
mp3DirectCut
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,
puis la documentation s&#39;ouvre.</code></pre>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="nobeepsspeechmode">noBeepsSpeechMode <a id="noBeepsSpeechMode-2.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Ce module supprime les bips dans le mode parole quand on
presse NVDA+s. Vous n&#39;avez le choix qu&#39;entre d&#233;sactiv&#233; et activ&#233;.
Langues: Fran&#231;ais, Italien, Espagnol et 18 autres langues.
Version: 2.3
Auteur: Alberto Buffolino
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://addons.nvda-project.org/files/get.php?file=nb">T&#233;l&#233;charger le module compl&#233;mentaire noBeepsSpeechMode-2.3.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="notepadplusplus">NotepadPlusPlus <a id="NotepadPlusPlus-1.2-dev.nvda-addon"></a></h1>
<p>Type: Extensions<br />
Description: App Module pour Notepad++.<br />
Ce module compl&#233;mentaire am&#233;liore l'accessibilit&#233; de Notepad ++. Pour en savoir plus, appuyez sur le bouton Aide de ce module compl&#233;mentaire.<br />
Version: 1.2-dev<br />
Auteurs: Derek Riemer, Tuukka Ojala.<br />
Modifi&#233; par: Robert H&#228;nggi.<br />
Langues: Allemand, Anglais, Fran&#231;ais, et Espagnol.<br />
Traduit en Fran&#231;ais et Espagnol par: R&#233;my Ruiz.<br />
Traduit en Allemand par: Robert H&#228;nggi.</p>
<p><a href="https://blindhelp.github.io/NotepadPlusPlus-1.2-dev.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire NotepadPlusPlus-1.2-dev.nvda-addon [via BlindHelp.github.io]</a></p>
<pre><code>Changer la touche  NVDA+Maj+Barre oblique invers&#233; dans le module Notepad++    
Ouvrir le programme notepad++ pour avoir le focus.    </code></pre>
<p>Pour cela , lorsque notepad++ a le focus, faire insert +n /pr&#233;f&#233;rences /Gestes de commandes.../ Notepad++<br />
Notepad++ est r&#233;duit, une foisfait fl&#232;che droite il est d&#233;velopp&#233;e<br />
Faire fl&#232;che bas puis,<br />
chercher l'arborescence<br />
annonce l'&#233;l&#233;ment information de ligne sur la barre d'&#233;tat<br />
Cela est r&#233;duit, une foisfait fl&#232;che droite il est d&#233;velopp&#233;e<br />
Appuyer sur le bouton:<br />
Ajouter<br />
Donc, n'oubliez pas que pour ajouter un geste &#224; une commande, s&#233;lectionnez la commande et appuyez sur le bouton &quot;Ajouter&quot;.<br />
puis taper la commande:<br />
NVDA+Maj+souligner<br />
Ensuite tab pour ataindre le bouton:<br />
OK<br />
Donc, n'oubliez pas que lorsque vous avez termin&#233; vos modifications, appuyez sur le bouton &quot;OK&quot; pour les sauvegarder ou sur le bouton &quot;Annuler&quot; pour les ignorer.</p>
<p>Pour supprimer un geste d'une commande, s&#233;lectionnez le geste et appuyez sur le bouton &quot;Supprimer&quot;.<br />
Mais j'ignore si vraiment c'est utile de le faire, car peut-&#234;tre vous pourais utiliser ce addon sur un clavier qwerty.</p>
<p>Donc la commande ajout&#233; sa donne:<br />
NVDA+majuscule+8 (clavier, toutes les dispositions)</p>
<p>En somme vous aurais deux commandes:<br />
NVDA+majuscule+8 (clavier, toutes les dispositions)<br />
C'est par d&#233;faut.<br />
NVDA+majuscule+<code>\</code> (clavier, toutes les dispositions)<br />
C'est la commande d'avant.</p>
<p>Je viens de tester les Gestes de commandes. J'ai pu ajouter NVDA+Maj+souligner comme alternative &#224; la touche NVDA+Maj+Barre oblique invers&#233;. Cela fonctionne !</p>
<p>Remarque: red&#233;marrer NVDA si il n'a pas le focus sur l'application.</p>
<p>Voila pour l'astuce.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="nvdaextensionglobalplugin">NVDAExtensionGlobalPlugin <a id="NVDAExtensionGlobalPlugin_7.4.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Extension des commandes de base de NVDA
Description: Ce module compl&#233;mentaire ajoute &#224; NVDA:</code></pre>
<p>1- Les fonctionnalit&#233;s suivantes (certaines peuvent &#234;tre activ&#233;es ou d&#233;sactiv&#233;es individuellement):</p>
<ul>
<li>Affichage de la liste des ic&#244;nes de la zone de notification,<br />
</li>
<li>Affichage de la liste des fen&#234;tres des applications lanc&#233;es,<br />
</li>
<li>Aide &#224; la composition d'un symbole complexe comme par exemple, un a e li&#233;, un symbole puissance 2 et possibilit&#233; d'ajouter ses propres cat&#233;gories et symboles,<br />
</li>
<li><p>Extension des fonctionnalit&#233;s du tampon virtuel pour les navigateurs Mozilla Firefox, Microsoft Internet Explorer, Microsoft Edge et Google Chrome:</p>
<ul>
<li>commandes pour le mode navigation (paragraphe, division, ancre, r&#233;gion principale),<br />
</li>
<li>nouveaux types d'&#233;l&#233;ments pour la boite de dialogue ouverte par &quot;NVDA+F7&quot; (titre,rep&#232;re, cadre, bouton,etc) avec annonce du nombre d'&#233;l&#233;ments trouv&#233;s,<br />
</li>
<li>commandes pour les tableaux: annoncer les cellules d'une ligne /colonne , aller &#224; la premi&#232;re/derni&#232;re cellule de la ligne/colonne courante, se d&#233;placer &#224; la colonne/ligne pr&#233;c&#233;dente ou suivante avec annonce possible des cellules de la ligne/colonne,<br />
</li>
<li>annonce de l'adresse URL du document,<br />
</li>
<li>navigation en boucle,</li>
</ul></li>
<li>Annonce de la fonction associ&#233;e aux commandes d'&#233;dition<br />
du style Copier, Coller, etc ,<br />
</li>
<li>Annonce du nom du dossier pr&#233;s&#233;lectionn&#233; dans les boites de dialogue du style &quot;Ouvrir&quot;,&quot;Enregistrer&quot;, &quot;Enregistrer sous&quot;,etc,<br />
</li>
<li><p>rapport ou afichage des informations sur l'application sous le focus:</p>
<ul>
<li>Annonce du profil de configuration courant,<br />
</li>
<li>Annonce du nom et num&#233;ro de version de l'application,<br />
</li>
<li>annonce du module compl&#233;mentaire actif associ&#233; &#224; l'application,</li>
</ul></li>
<li>Ouverture du journal ancien ou courant de NVDA et copie du chemin de ce dernier dans le presse-papier,<br />
</li>
<li>historique des annonces vocales,<br />
</li>
<li>pr&#233;sentation du formatage du texte dans une boite de dialogue (d&#233;sactiv&#233; par d&#233;faut (commande clavier NVDA+f),<br />
</li>
<li>renommage des touches clavier,<br />
</li>
<li>annonce s&#233;lective des touches de commandes,<br />
</li>
<li>simple minuterie,<br />
</li>
<li>affichage des &#233;l&#233;ments visibles composant l'objet en avant plan,<br />
</li>
<li>commutation rapide de profil vocal,<br />
</li>
<li>remanence des touches de modification,<br />
</li>
<li>arr&#234;ter, red&#233;marrer ou mettre en veille prolong&#233; l'ordinateur,<br />
</li>
<li>controle du volume principal et de NVDA:
<ul>
<li>coupure ou remise du son pour l'application focalis&#233;e,</li>
<li>&#233;tablissement du volume principal ou de NVDA au d&#233;marrage du module.</li>
<li>convertion en html des fichiers t2t ou markdown de documentation des modules compl&#233;mentaires install&#233;s (pour d&#233;veloppeur).</li>
</ul></li>
</ul>
<p>2- Les options suivantes:</p>
<ul>
<li>supprimer l'annonce de la description des objets dans les rubans Windows,<br />
</li>
<li>annoncer le mot focalis&#233; lors d'une suppression de mot,<br />
</li>
<li>agrandir automatiquement les fen&#234;tres au premier plan,<br />
</li>
<li>annoncer des ponctuations et symboles lors de d&#233;placement par mot .</li>
</ul>
<p>3- Les options avanc&#233;es suivantes:</p>
<ul>
<li>signaler, par un son, l'inscription d'une erreur dans le journal aussi pour les versions finales et release candidate de NVDA.</li>
</ul>
<p>4- et divers autres &#233;l&#233;ments comme:</p>
<ul>
<li>sous-menus pour explorer les dossiers programme ou de configuration,<br />
</li>
<li>script pour red&#233;marrer rapidement NVDA.</li>
</ul>
<p>Ce Module a &#233;t&#233; d&#233;velopp&#233; avec la participation de Daniel Poiraud.<br />
Il n'est pas compatible avec les versions de NVDA inf&#233;rieures &#224; la 2018.2.</p>
<p>Important!!!<br />
Avant d'installer ce module, supprimer toutes les installation du module compl&#233;mentaire Global Plugin &quot;liste des fen&#234;tres&quot; et le module compl&#233;mentaire &quot;fakeClipboardAnouncement&quot; car cette version les inclut.<br />
Attention: Cette version du module n'est pas compatible avec les versions ant&#233;rieures &#224; la version 2018.2 de NVDA<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 7.4.3<br />
Derni&#232;re mise &#224; jour: 7 Janvier 2019</p>
<h1 id="v7.4.3-07012019">v7.4.3 (07/01/2019)</h1>
<ul>
<li>correction du fichier keyboard.ini espagnol qui provoquait le plantage de NVDA en langue espagnole.<br />
</li>
<li>traduction en langue arabe de l'interface du module</li>
</ul>
<p>Les principales nouveaut&#233;s qu'elle apporte sont:</p>
<ul>
<li>la possibilit&#233; de se d&#233;placer d'&#233;l&#233;ment cliquable en &#233;l&#233;ment cliquable en mode navigation dans les navigateurs &quot;Firefox&quot; et &quot;Google crome&quot;.</li>
<li>ajout de la navigation par paragraphe &#233;galement pour&#160; le navigateur Edge.</li>
<li>Le dialogue &quot;Scripts de l'interpr&#233;teur&quot; pr&#233;sente maintenant les scripts sous forme de liste et le script s&#233;lectionn&#233; peut &#234;tre d&#233;clencher directement dans ce dialogue.</li>
<li>deux nouveau scripts pour faire un clic souris gauche ou droite &#224; la position de l'objet navigateur:
<ul>
<li>&quot;nvda+,&quot; pour:amener le curseur de la souris &#224; l'objet navigateur et faire un clic gauche,</li>
<li>&quot;NVDA+majuscule+,&quot; d&#233;placer le curseur de la souris &#224; l'objet navigateur et faire un clic droit. En tapant deux fois ces gestes de commandes, on fait un double clic.</li>
</ul></li>
</ul>
<p>Merci &#224; R&#233;my pour sa traduction en espagnol.</p>
<p><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/NVDAExtensionGlobalPlugin/NVDAExtensionGlobalPlugin-7.4.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire NVDAExtensionGlobalPlugin_7.4.3.nvda-addon par ici: [lien externe]</a></p>
<pre><code>Pour plus d&#39;informations vous pouvez consulter la documentation pour
la version 7.4.3 depuis le Gestionnaire des modules compl&#233;mentaires
(dans G&#233;rer les modules compl&#233;mentaires)
Chercher le nom du module compl&#233;mentaire nomm&#233;:
Extension des commandes  de base de NVDA
Faire Tab, puis rechercher le bouton Aide, puis appuyer sur celuici,
puis la documentation s&#39;ouvre.</code></pre>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="objsounds-kevangc-version">OBJSounds (KevanGC Version <a id="OBJSounds (KevanGC Version).nvda-addon"></a>)</h1>
<pre><code>Type: Extensions
Obj Sounds c&#39;est la m&#234;me version mais modifier par KevanGC
Auteur: Tyler Spivey
Version: 0.20120928.01
Commentaire par BlindHelp:
Il peut &#233;galement &#234;tre personnalis&#233; sans trop de difficult&#233;, ont
peut mettre dans le dossiers correspondants les fichiers sons avec
leurs noms et le format appropri&#233;.
Se module compl&#233;mentaire , contrairement &#224; l&#39;original, a une fa&#231;on
de Activer et d&#233;sactiver les sons, avec NVDA + alt + o.
Ce que je n&#39;aime pas c&#39;est qu&#39;ils ont mis la touche alt; lorsque la
touche alt est enfonc&#233;e, le menu s&#39;ouvre.
Je le pr&#233;f&#232;re aussi parce que le son des oiseaux est plus faible et
moins envahissant. Par ailleurs, je pense qu&#39;il est &#233;gal aux
complement de l&#39;auteur original.
J&#39;esp&#232;re qu&#39;ils servent. </code></pre>
<p><a href="https://blindhelp.github.io/OBJSounds%20%28KevanGC%20Version%29.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire OBJSounds (KevanGC Version).nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="objsounds">objsounds <a id="objsounds.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Obj Sounds c&#39;est la version original fait par l&#39;auteur: Tyler
Spivey
Version: 0.20120928.01
Commentaire par BlindHelp:
il me semble sauf erreur de ma part que Le son est plus fort que la
version modifier par KevanGC
J&#39;esp&#232;re qu&#39;ils servent. </code></pre>
<p><a href="https://blindhelp.github.io/objsounds.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire objsounds.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="ocr">OCR <a id="ocr_0.20120529.01.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Description: Effectue une reconnaissance de caract&#232;res (OCR) pour
extraire le texte d&#39;un objet inaccessible.
Utilise le moteur d&#39;OCR Tesseract.
Pour ex&#233;cuter l&#39;OCR, placez-vous sur l&#39;objet et appuyez sur NVDA+r.
Vous pouvez d&#233;finir la langue de l&#39;OCR en allant dans le menu
Pr&#233;f&#233;rences du menu NVDA et s&#233;lectionnez R&#233;glage OCR.
Auteurs: NV Access Limited et autres colaborateurs.
Version: 0.20120529.01
Langues: Anglais, Fran&#231;ais, Italien, Espagnol et autres 7 langues.
Derni&#232;re mise &#224; jour: 29 Mai 2012</code></pre>
<p><a href="https://blindhelp.github.io/ocr_0.20120529.01.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire ocr_0.20120529.01.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="outlook-extended">Outlook Extended<a id="outlookExtended-1.0-dev.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Voici un nouveau module compl&#233;mentaire nomm&#233; Outlook Extended qui fait son apparition pour toutes les personnes qui poss&#232;dent Microsoft Outlook.
Si vous voulez en savoir plus sur ce fabuleux add-on, vous pouvez lire la description ci-dessous faite par son auteur:
Merci Cyrille! &#128515;
Derni&#232;re mise &#224; jour: 17 Janvier 2019</code></pre>
<h1 id="outlook-extended-1">Outlook extended</h1>
<ul>
<li>Auteurs: Cyrille Bougot, Ralf Kefferpuetz</li>
<li>Compatibilit&#233; NVDA: 2018.3 &#224; 2019.1</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=outlookextended">version stable</a></li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=outlookextended">version de d&#233;veloppement</a></li>
</ul>
<p>Ce module compl&#233;mentaire am&#233;liore l'utilisation de Microsoft Outlook par la vocalisation de certaines commandes et l'ajout de commandes suppl&#233;mentaires.</p>
<h2 id="commandes">Commandes</h2>
<ul>
<li>Alt+1 &#224; Alt+9, Alt+0, Alt+), alt+=: Annonce le champ d'en-t&#234;te 1 &#224; 12 dans un message, un &#233;l&#233;ment de calendrier ou une t&#226;che. Une double pression d&#233;place le focus dans ce champ si possible. Une tripe pression copie son contenu dans le presse-papiers.</li>
<li>NVDA+Maj+I: Annonce la barre d'information dans un message, un &#233;l&#233;ment de calendrier ou une fen&#234;tre de t&#226;che. Une double pression y d&#233;place le focus. Une tripe pression copie son contenu dans le presse-papiers.</li>
<li>NVDA+Maj+A: Annonce le nombre et le nom des pi&#232;ces jointes dans une fen&#234;tre de message. Une double pression y d&#233;place le focus.</li>
<li>NVDA+Maj+M: D&#233;place le focus dans le corps du message.</li>
<li>Control+Alt+Gauche and Control+Alt+Droite: Dans la liste des r&#233;sultats de recherche du carnet d'adresses, navigue entre les champs de la ligne s&#233;lectionn&#233;e.</li>
<li>Control+Q: Dans la liste des messages, marque le message ou le groupe de messages s&#233;lectionn&#233; comme lu.</li>
<li>Control+U: Dans la liste des messages, marque le message ou le groupe de messages s&#233;lectionn&#233; comme non lu.</li>
</ul>
<h2 id="notes-1">Notes</h2>
<p>Tous les gestes de commandes peuvent &#234;tre modifi&#233;s dans la bo&#238;te de dialogue Gestes de commandes de NVDA. Vous pourriez en particulier vouloir les modifier dans les situations suivantes :</p>
<ul>
<li>Les raccourcis par d&#233;faut pour marquer un message comme lu ou non lu sont ceux de la version anglaise d'Outlook. S'ils sont diff&#233;rents de ceux de votre version locale d'Outlook, vous devrez les modifier en cons&#233;quence.</li>
<li>Les geste de commande par d&#233;faut pour lire les en-t&#234;tes correspondent &#224; Alt en combinaison avec les touches de la premi&#232;re ligne du clavier alpha-num&#233;rique. Vous pourriez avoir besoin de r&#233;attribuer les gestes de commandes pour lire les en-t&#234;tes 11 et 12 s'ils ne sont pas en concordance avec votre disposition de clavier locale.</li>
</ul>
<h2 id="journal-des-modifications">Journal des modifications</h2>
<h3 id="version-1.0">Version 1.0</h3>
<ul>
<li>Version initiale</li>
</ul>
<h2 id="versions-compatibles-doutlook">Versions compatibles d'Outlook</h2>
<p>Ce module compl&#233;mentaire a &#233;t&#233; test&#233; avec Microsoft Outlook 2016 et 2013.</p>
<h1 id="plus-dinformations-sur-outlook-extended">Plus d'informations sur Outlook Extended</h1>
<p>Version actuelle: 1.0-dev(en d&#233;veloppement)</p>
<p>Retrouver le module compl&#233;mentaire <a href="https://addons.nvda-project.org/addons/outlookExtended.fr.html">Outlook extended</a> sur le site comunautaire des modules compl&#233;mentaires NVDA</p>
<p><a href="https://github.com/CyrilleB79/OutlookExtended">Code source sur GitHub</a></p>
<p>Merci Cyrille! &#128515;</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="partial-lines">Partial Lines <a id="partialLines-0.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Description: Change les fl&#232;ches haut/bas pour lire avant ou apr&#232;s le curseur</code></pre>
<p>Auteur: <script type="text/javascript">
<!--
h='&#112;&#x63;&#100;&#x65;&#x73;&#x6b;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#116;&#x73;&#112;&#x69;&#118;&#x65;&#x79;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#84;&#x79;&#108;&#x65;&#114;&#32;&#x53;&#112;&#x69;&#118;&#x65;&#x79;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#84;&#x79;&#108;&#x65;&#114;&#32;&#x53;&#112;&#x69;&#118;&#x65;&#x79;&#32;&#40;&#116;&#x73;&#112;&#x69;&#118;&#x65;&#x79;&#32;&#x61;&#116;&#32;&#112;&#x63;&#100;&#x65;&#x73;&#x6b;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript></p>
<pre><code>Version: 0.1
Version minimale de NVDA: Aucune
Langues: Anglais
Derni&#232;re mise &#224; jour: 9 Octobre 2018</code></pre>
<p><a href="https://github.com/tspivey/partialLines/releases/download/v0.1/partialLines-0.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire partialLines-0.1.nvda-addon via la page github de l'auteur en cliquant ici:</a></p>
<h1 id="partial-lines-lignes-partielles">Partial Lines (Lignes Partielles)</h1>
<p>Ce module compl&#233;mentaire a plusieurs op&#233;rations traitant les lignes:</p>
<ul>
<li>NVDA+maj+effacement change les fl&#232;ches haut/bas pour lire &#224; partir du d&#233;but de la ligne vers le curseur, &#224; partir du curseur jusqu'&#224; la fin de la ligne, ou toute la ligne.</li>
<li>NVDA+maj+page pr&#233;c&#233;dente lit depuis le d&#233;but de la ligne jusqu'au curseur</li>
<li>NVDA+maj+page suivante lit &#224; partir du curseur jusqu'&#224; la fin de la ligne.</li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="percentage-checker">percentage checker <a id="percentage checker.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Pourcent de texte (CTRL+NVDA+P)
Lire le pourcentage de texte actuel &#224; l&#39;aide du raccourci
CTRL+NVDA+P
Vous permet de v&#233;rifier de combien vous &#234;tes loin en lisant &#224;
travers d&#39;un texte + le nombre de mots de ce texte.
Raccourci: CTRL+NVDA+P
Langues: Allemand, Anglais, Espagnol, Fran&#231;ais
Version: 1.2
Auteur: Oriol Gomez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://blindhelp.github.io/percentage%20checker.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire percentage checker.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="perky">Perky <a id="perky-1.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire pour l&#39;application Perky
Version: 1.0
Auteur: Noelia Ruiz Mart&#237;nez
Langues: Anglais, Fran&#231;ais et Espagnol
Traduit en fran&#231;ais et espagnol par R&#233;my Ruiz
Utilisation du module compl&#233;mentaire Perky pour l&#39;application Perky Duck:</code></pre>
<p>Module compl&#233;mentaire Perky Duck:<br />
Ce module permet de conna&#238;tre les points en braille correspondant &#224; un caract&#232;re donn&#233; dans les documents de Perky Duck.<br />
1. Notifications automatiques</p>
<pre><code>- NVDA peut signaler les points correspondant au dernier caract&#232;re
&#233;crit (y compris l&#39;espace et la nouvelle ligne), sur les documents
en braille de Perky.
- Pour activer ces notifications, il suffit de basculer sur le mode
&#233;criture.

- Lorsque le curseur syst&#232;me est d&#233;plac&#233;, le mode &#233;criture sera
d&#233;sactiv&#233; automatiquement.

    2. Commandes

     2.1. Commandes clavier     

- NVDA+control+maj+b: Bascule entre activ&#233; et d&#233;sactiv&#233; le mode
d&#39;&#233;criture.
- NVDA+maj+control+n: Signale les points correspondant au
caract&#232;re pr&#233;c&#233;dent. Elle permet de r&#233;p&#233;ter l&#39;annonce du dernier
symbole &#233;crit sans d&#233;placer le curseur de revue. (Disponible
uniquement en mode &#233;criture). - 
- NVDA+control+maj+m: Signale les
points associ&#233;es au caract&#232;re sous le curseur de revue.

    2.2. Menu

Ce module compl&#233;mentaire ajoute au menu NVDA (NVDA+n) les options
suivantes:

- Param&#232;tres pour Perky, pr&#233;f&#233;rences sous menu: Contient les bo&#238;te
de dialogues standar pour associer les combinaison de points avec
les caract&#232;res.

- Aide pour Perky: Ouvre le guide du module compl&#233;mentaire Perky
dans la langue actuel de NVDA si disponible, ou en anglais par
d&#233;faut. </code></pre>
<p><a href="https://blindhelp.github.io/perky-1.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire perky-1.0.nvda-addon [via BlindHelp.github.io]</a> <a href="http://www.duxburysystems.org/downloads/perky1102.msi">T&#233;l&#233;charger le programme gratuit Perky Duck par ici: [lien externe]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="placemarkers">placeMarkers <a id="placeMarkers-12.2.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
N&#233;cessite NVDA 2018.3 ou ult&#233;rieur.
Ce module compl&#233;mentaire sert &#224; sauvegarder et rechercher des cha&#238;nes de</code></pre>
<p>caract&#232;res ou des marqueurs sp&#233;cifiques sur des pages web ou des documents en Mode navigation de NVDA. Ce module compl&#233;mentaire peut &#233;galement &#234;tre utilis&#233; pour sauvegarder et rechercher des cha&#238;nes de caract&#232;res Dans des contr&#244;leurs multilignes; dans ce cas, s'il n'est pas possible de mettre &#224; jour le point d'insertion, la cha&#238;ne correspondante sera copi&#233;e dans le Presse-papiers, afin de pouvoir la rechercher &#224; l'aide d'autres outils. Le module compl&#233;mentaire sauvegarde les textes et les marqueurs sp&#233;cifi&#233;s dans des fichiers. Le nom des fichiers est bas&#233; sur le titre et l'url du document en cours. Ce module compl&#233;mentaire est bas&#233; sur les modules compl&#233;mentaires SpecificSearch et Bookmark&amp;Search, d&#233;velopp&#233; par le m&#234;me auteur. Vous devriez les d&#233;sinstaller pour utiliser celui-ci, car ils ont des raccourcis et des caract&#233;ristiques communes.</p>
<p>Touches de commandes :</p>
<ul>
<li>Contr&#244;le+maj+NVDA+f : Ouvre un dialogue avec une zone d'&#233;dition qui affiche la derni&#232;re recherche enregistr&#233;e; Dans ce dialogue, vous pouvez &#233;galement s&#233;lectionner les recherches pr&#233;c&#233;demment enregistr&#233;es dans une zone de liste d&#233;roulante ou supprimer la cha&#238;ne s&#233;lectionn&#233;e de l'historique &#224; l'aide d'une case &#224; cocher. Vous pouvez choisir si le texte contenu dans la zone d'&#233;dition sera ajout&#233; &#224; l'historique de vos textes enregistr&#233;s. Enfin, choisissez une action du prochain groupe de boutons radio (entre Recherche suivante, Recherche pr&#233;c&#233;dente ou Ne pas rechercher), et sp&#233;cifiez si NVDA effectuera une recherche Respecter la casse. Lorsque vous appuyez sur OK, NVDA recherche cette cha&#238;ne.</li>
<li>Contr&#244;le+maj+NVDA+k : Enregistre la position actuelle comme un marqueur. Si vous souhaitez donner un nom &#224; ce marqueur, s&#233;lectionner un texte &#224; partir de cette position avant de l'enregistrer.</li>
<li>Contr&#244;le+maj+NVDA+effacement : Supprime le marqueur correspondant &#224; cette position.</li>
<li>NVDA+k : D&#233;placer vers le marqueur suivant.</li>
<li>Maj+NVDA+k : D&#233;placer vers le marqueur pr&#233;c&#233;dent.</li>
<li>Control+maj+k : Copier le nom du fichier o&#249; les donn&#233;es des marqueurs de position seront enregistr&#233;es dans le presse-papiers, sans l'extension.</li>
<li>Alt+NVDA+k : Ouvre un dialogue avec les marqueurs sauvegard&#233;s pour ce document. Vous pouvez &#233;crire une note pour chaque marqueur ; Appuyez sur Enregistrer note pour enregistrer les modifications. En appuyant sur Supprimer vous pouvez supprimer le marqueur s&#233;lectionn&#233;. En appuyant sur OK vous pouvez vous d&#233;placer &#224; la position s&#233;lectionn&#233;e.</li>
<li>Non assign&#233; : Enregistrer la position actuelle en tant que marqueur temporaire.</li>
<li>Non assign&#233; : Ce d&#233;placer au marqueur temporaire pour le document en cours.</li>
</ul>
<p>Sous-menu des marqueurs (NVDA+N</p>
<p>En utilisant le sous-menu des marqueurs, dans le menu pr&#233;f&#233;rences de NVDA, vous pouvez acc&#233;der &#224; :</p>
<ul>
<li>Dossier des recherches sp&#233;cifiques : Ouvre le dossier des recherches sp&#233;cifiques pr&#233;c&#233;demment sauvegard&#233;es.</li>
<li>Dossier des marqueurs : Ouvre le dossier des marqueurs sauvegard&#233;s.</li>
<li>Copier le dossier des marqueurs : Vous pouvez sauvegarder une copie du dossier des marqueurs.</li>
<li>Restorer des marqueurs : Vous pouvez restorer vos marqueurs &#224; partir d'un dossier de marqueurs pr&#233;c&#233;demment sauvegard&#233;.</li>
</ul>
<p>Note : la position du marqueur est bas&#233; sur le nombre de caract&#232;res. Dans les pages au contenu dynamique, il vaut mieux utiliser la recherche de texte sp&#233;cifique, pas les marqueurs.</p>
<pre><code>Version: 12.2.1
Compatible avec NVDA 2018.3 ou version ult&#233;rieure (requis).
Langues: Anglais, Fran&#231;ais, Italien, Espagnol et 29 autres
langues.
Auteurs : Noelia, Chris.
Traduit en fran&#231;ais par: R&#233;my Ruiz 
Derni&#232;re mise &#224; jour: 29 D&#233;cembre 2018          </code></pre>
<p><a href="http://addons.nvda-project.org/files/get.php?file=pm">T&#233;l&#233;charger le module compl&#233;mentaire placeMarkers-12.2.1.nvda-addon par ici:</a></p>
<p>Si n&#233;cessaire, vous pouvez t&#233;l&#233;charger la <a href="https://github.com/nvdaes/placeMarkers/releases/download/10.2/placeMarkers-10.2.nvda-addon">derni&#232;re version compatible avec NVDA 2017.3</a>.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="poeditmadeeasy">poeditMadeEasy <a id="poeditMadeEasy-3.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Am&#233;lioration de l&#39;Acc&#232;s sur poedit.
Description: Ce module compl&#233;mentaire annonce les actions effectu&#233;
en appuyant sur les commandes des raccourci de poedit. Il indique
les diff&#233;rente cat&#233;gories de messages par un bip sp&#233;cifique.
&#201;galement en appuyant sur les gestes sp&#233;cifi&#233;s, vous pouvez
conna&#238;tre la source et le texte du message traduit en plus de
basculer entre activer/d&#233;sactiver le mode bip.
Auteur : Him Prasad Gautam
Version : 3.1
Langues: Anglais, Fran&#231;ais, Espagnol, Hindi, N&#233;palais et tamoul
Traduit en fran&#231;ais par: R&#233;my Ruiz
Traduit en espagnol par: Iv&#225;n Novegil Cancelas et R&#233;my Ruiz
Cette derni&#232;re mise &#224; jour contient la correction de la documentation en fran&#231;ais par R&#233;my Ruiz et espagnol par Iv&#225;n Novegil Cancelas.
Voila, les messages puis la documentation son maintenant traduite en
fran&#231;ais et espagnol !
C&#39;est pour le logiciel poedit qui sert a traduire les modules
compl&#233;mentaires et autres programmes utilisant le catalogue de
poedit.
Derni&#232;re mise &#224; jour: 7 Ao&#251;t  2018
Note: la version 3.1 du module compl&#233;mentaire poeditMadeEasy
proposer par l&#39;auteur ne contient-pas ces deux langues.
S&#39;il vous pla&#238;t, n&#39;oubliez pas de lire la documentation relative &#224;
son utilisation.
Vous pouvez consulter l&#39;aide du module compl&#233;mentaire:
Pour cela appuyer sur NVDA+N (Menu NVDA) puis aller dans le Menu
&quot;Aide&quot; puis chercher l&#39;&#233;l&#233;ment nomm&#233;:
&quot;Am&#233;lioration de l&#39;Acc&#232;s sur poedit. 3.1&quot;
Faire entr&#233;e
ou en allant dans le Menu &quot;Outils&quot;
puis &quot;Gestion des modules compl&#233;mentaires&quot;
Chercher le d&#233;but du nom de l&#39;&#233;l&#233;ment nomm&#233;:
Am&#233;lioration de l&#39;Acc&#232;s sur poedit.;
Faire TAB
puis appuyer sur le bouton &quot;Aide de ce module compl&#233;mentaire&quot;
L&#39;aide du module compl&#233;mentaire s&#39;ouvre en fran&#231;ais, une fois fini
la lecture, fermer la documentation par Alt+F4. </code></pre>
<p><a href="https://blindhelp.github.io/poeditMadeEasy-3.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire poeditMadeEasy-3.1.nvda-addon [via BlindHelp.github.io]</a> <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/poeditMadeEasy-3.1.nvda-addon">ou par l&#224;: [lien externe]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="qtranslate">QTranslate <a id="QTranslate-1.0-dev.nvda-addon"></a></h1>
<p>Type: Extensions<br />
App Module pour QTranslate<br />
Description : Am&#233;liore l'accessibilit&#233; de l'application QTranslate.<br />
Auteur : Hrvoje Katic<br />
Version : 1.0-dev<br />
<a href="https://blindhelp.github.io/QTranslate-1.0-dev.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire QTranslate-1.0-dev.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="https://qtranslate1.appspot.com/QTranslate.6.7.1.exe">T&#233;l&#233;charger le programme QTranslate.6.7.1 version instalable par ici: [archive exe]</a></p>
<p><a href="http://qtranslate2.appspot.com/QTranslate.6.7.1.zip">T&#233;l&#233;charger le programme QTranslate.6.7.1 version portable par ici: [archive zip]</a></p>
<p>Notes par BlindHelp:<br />
Vous verrez que son utilisation est intuitive:<br />
Il y a une zone d'&#233;dition o&#249; le texte que nous voulons traduire devra &#234;tre plac&#233;, et dans la suivante bo&#238;te de dialogue la traduction appara&#238;tra, une fois que nous avons cliqu&#233; sur le bouton&quot;Traduire&quot;.<br />
Les langues source et destination peuvent &#234;tre facilement chang&#233;es dans les options dans les zones de listes d&#233;roulantes.<br />
Par d&#233;faut il utilise le Service de Traduction de Google.<br />
Remarque&#160;: il pourrait y avoir quelques probl&#232;mes de qualit&#233; en raison du service de traduction, lorsque vous faites Ctrl+Tab par inadvertance, car vous changer le Service de Traduction ; pour y rem&#233;dier faire &#224; nouveau Ctrl+Tab plusieurs fois pour revenir au Service de Traduction de Google.</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="radiosure">RadioSure <a id="radiosure 1.4.nvda-addon"></a></h1>
<pre><code>Type: Extensions
RadioSure permet d&#39;&#233;couter et d&#39;enregistrer les radios sur internet.
Il comprend plus de 17 000 stations pr&#233;install&#233;es et il est possible
d&#39;en rajouter d&#39;autres. Il prend en charge les formats mp3, wma, ogg
vorbis, aac+. La recherche dans la liste des radios est rapide.
Effet de fondu encha&#238;n&#233; entre deux radios. Il enregistre les
chansons une par une (avec nom de l&#39;auteur et titre si la radio
fournit l&#39;information) ou en un seul fichiers en continu.
Possibilit&#233; d&#39;enregistrer 2 radios simultan&#233;ment.
Ce module compl&#233;mentaire apporte de nombreuses am&#233;liorations dans
l&#39;utilisation de RadioSure avec NVDA par l&#39;ajout d&#39;un certain nombre
de raccourcis clavier.
Consulter la documentation du module compl&#233;mentaire  &#224; partir du menu Aide de NVDA puis chercher l&#39;&#233;l&#233;ment nom&#233;:
radiosure 1.4
Auteur : Paul de la liste scriptNVDA     
Version : 1.4      
Langues: Anglais, Fran&#231;ais et Espagnol      
Traduit en espagnol par R&#233;my Ruiz      
Derni&#232;re mise &#224; jour: 26 Juin 2014     </code></pre>
<p><a href="https://blindhelp.github.io/radiosure%201.4.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire radiosure 1.4.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="read-feeds">Read Feeds <a id="readFeeds-6.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions
N&#233;cessite NVDA 2018.3 ou ult&#233;rieur.
Description: Module compl&#233;mentaire pour utiliser NVDA comme un
lecteur de flux RSS.
Ce module compl&#233;mentaire fournit un moyen simple de lire les flux aux</code></pre>
<p>formats Atom ou RSS &#224; l'aide de NVDA. Les flux ne sont pas actualis&#233;es automatiquement. Ci-dessous lorsque nous mentionnons flux, nous voulons dire que les deux signifient flux RSS et ATOM.</p>
<p>Installation ou Mise &#224; jour :</p>
<p>Si vous utilisiez une version ant&#233;rieure de ce module compl&#233;mentaire, il y a un dossier RSS ou personalFeeds dans votre dossier de configuration personnel de NVDA, lorsque vous installez la version actuelle, une bo&#238;te de dialogue vous demandera si vous souhaitez mettre &#224; jour ou installer. Choisissez mise &#224; jour pour pr&#233;server vos flux enregistr&#233;s et pour continuer &#224; les utiliser dans la nouvelle version install&#233;e de readFeeds.</p>
<p>Commandes :</p>
<p>Menu Read Feeds</p>
<p>Vous pouvez acc&#233;der au sous-menu Read Feeds depuis le menu NVDA, sous-menu Outils, o&#249; les suivantes options du menu sont disponibles :</p>
<p>Flux...</p>
<p>Ouvre une bo&#238;te de dialogue avec les contr&#244;les suivants :</p>
<ul>
<li>Filtrer par : Une zone d'&#233;dition pour rechercher des flux pr&#233;c&#233;demment enregistr&#233;s.</li>
<li>Une liste des flux enregistr&#233;s.</li>
<li>Liste des articles : Ouvre une bo&#238;te de dialogue qui pr&#233;sente la liste des articles de vvos flux actuel. S&#233;lectionnez l'article que vous souhaitez lire et appuyer sur Entr&#233;e ou Ouvrir la page Web du bouton de l'article s&#233;lectionn&#233; pour ouvrir la page correspondante dans votre navigateur. Appuyez sur le bouton &#192; propos de l'article pour ouvrir une bo&#238;te de dialogue affichant le titre et le lien de l&#8217;article s&#233;lectionn&#233;&#160;; dans cette bo&#238;te de dialogue, vous serez en mesure de copier ces informations dans le presse-papiers.</li>
<li>Nouveau : Ouvre une bo&#238;te de dialogue avec une zone d'&#233;dition pour entrer l'adresse d'un nouveau flux. Si l'adresse est valide et que le flux peut &#234;tre enregistr&#233;, son nom, bas&#233; sur le titre du flux, appara&#238;t au bas de la liste des flux.</li>
<li>Renommer : Ouvre une bo&#238;te de dialogue avec une zone d'&#233;dition pour renommer le flux s&#233;lectionn&#233;.</li>
<li>Supprimer : Ouvre une bo&#238;te de dialogue pour supprimer le flux s&#233;lectionn&#233; apr&#232;s confirmation.</li>
<li>D&#233;finir par d&#233;faut : D&#233;finit le flux s&#233;lectionn&#233; comme valeur par d&#233;faut, afin que ses articles soient accessibles avec les gestes de NVDA.</li>
<li>Fermer : Ferme la bo&#238;te de dialogue Flux.</li>
</ul>
<p>Notes</p>
<ul>
<li>Si un flux nomm&#233; tempFeed est cr&#233;&#233;, renommez-le, car ce fichier pourrait &#234;tre remplac&#233; si n&#233;cessaire pour cr&#233;er un flux dont le nom existe d&#233;j&#224;.</li>
<li>Le flux d&#233;fini par d&#233;faut ne peut pas &#234;tre supprim&#233;. Le flux addressFile sera utilis&#233; comme valeur par d&#233;faut lors de la r&#233;initialisation de la configuration, donc il ne peut pas &#234;tre supprim&#233;.</li>
</ul>
<p>Copier le dossier des flux...</p>
<p>Ouvre une bo&#238;te de dialogue pour choisir un dossier dans lequel vous pouvez enregistrer le dossier personalFeeds de vos flux. Par d&#233;faut, le dossier s&#233;lectionn&#233; est dans la configuration de NVDA, qui cr&#233;era le r&#233;pertoire personalFeeds.</p>
<p>Restaurer les flux...</p>
<p>Ouvre une bo&#238;te de dialogue pour s&#233;lectionner un dossier qui remplace vos flux dans le dossier personalFeeds. Assurez-vous de charger un dossier contenant des URL de flux.</p>
<p>Commandes clavier :</p>
<ul>
<li>Ctrl+Maj+NVDA+Espace : Annonce l'URL de l'article actuel. En appuyant deux fois ouvrira la page web.</li>
<li>Ctrl+Maj+NVDA+8 : Actualise le flux s&#233;lectionn&#233; et annonce son plus r&#233;cent titre.</li>
<li>Ctrl+Maj+NVDA+I : Annonce le titre et le lien du flux actuel. En appuyant deux fois copie le titre et le lien associ&#233;e dans le presse-papiers.</li>
<li>Ctrl+Maj+NVDA+U : Annonce le titre du flux pr&#233;c&#233;dent.</li>
<li>Ctrl+Maj+NVDA+O : Annonce le titre du flux suivant.</li>
</ul>
<p>Notifications :</p>
<ul>
<li>Lorsque le titre ou l'URL ont &#233;t&#233; copi&#233;s.</li>
<li>Lorsqu'il est Impossible de se connecter/actualiser un flux, ou l'URL ne correspond pas &#224; un flux valide.</li>
<li>NVDA affichera un message d'erreur s'Il n'&#233;tait pas possible de sauvegarder ou de restaurer le dossier personalFeeds.</li>
<li>La bo&#238;te de dialogue affiche Le titre de la Liste de l'article le nom de flux s&#233;lectionn&#233; et le nombre d'&#233;l&#233;ments disponibles.</li>
</ul>
<p>Version: 6.2<br />
Compatible avec NVDA 2018.3 ou version ult&#233;rieure (requis). Langues: Anglais, Fran&#231;ais, Italien, Espagnol et 24 autres langues.<br />
Auteurs : Noelia Ruiz Mart&#237;nez, Mesar Hameed<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
<a href="http://addons.nvda-project.org/files/get.php?file=rf">T&#233;l&#233;charger le module compl&#233;mentaire readFeeds-6.2.nvda-addon par ici:</a></p>
<p>Si n&#233;cessaire, vous pouvez t&#233;l&#233;charger la <a href="https://github.com/nvdaes/readFeeds/releases/download/4.5/readFeeds-4.5.nvda-addon">derni&#232;re version compatible avec NVDA 2017.3</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="reportpasswords">reportPasswords <a id="reportPasswords-1.3-dev.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Voici un module tr&#232;s pratique qui permet &#224; nvda de vocaliser le mot de passe lors de la r&#233;daction.
On peut aussi activer ou d&#233;sactiver cette fonctionnalit&#233; selon le besoin, avec le raccourci : NVDA+Contr&#244;le+Maj+p.
Remarque : La commande ci-dessus peut &#234;tre chang&#233;e dans le Menu NVDA, sous-menu Pr&#233;f&#233;rences, dans le dialogue Gestes de commandes, cat&#233;gorie Parole.
Vous pourrez configurer ce module compl&#233;mentaire en allant dans le menu &quot;Pr&#233;f&#233;rences/Param&#232;tres ReportPasswords&quot;,
pour cocher ou d&#233;cocher la case &#224; cocher :
Report passwords
Ensuite faire tab, puis faire entr&#233;e sur le bouton :
OK
Si vous souhaitez conserver cette case &#224; cocher active, vous devez cliquer sur l&#39;&#233;l&#233;ment :
Sauvegarder la configuration
en allant dans le menu NVDA
Ces changements seront sauvegard&#233;s dans le fichier nvda.ini</code></pre>
<p>Cette case &#224; cocher n&#8217;est pas coch&#233;e par d&#233;faut.<br />
Version: 1.3-dev<br />
Langues: Anglais, Fran&#231;ais et Espagnol.<br />
J'ai oubli&#233;, la traduction en Fran&#231;ais et Espagnol n&#8217;est pas incluse dans le module compl&#233;mentaire d'origine fait par l'auteur.<br />
Auteur: Noelia Ruiz Mart&#237;nez<br />
Traduit en Fran&#231;ais et Espagnol par: R&#233;my Ruiz<br />
<a href="https://blindhelp.github.io/reportPasswords-1.3-dev.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire reportPasswords-1.3-dev.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="report-symbols">Report Symbols <a id="reportSymbols-4.5.nvda-addon"></a></h1>
<pre><code>Type: Extensions
N&#233;cessite NVDA 2018.3 ou ult&#233;rieur.</code></pre>
<p>Ce module compl&#233;mentaire permet d'&#233;couter les symboles &#233;crit (caract&#232;res non alphanum&#233;riques ou caract&#232;res en blanc), m&#234;me si la verbalisation des caract&#232;res &#233;crit est d&#233;sactiv&#233; dans NVDA.<br />
Il est bas&#233; sur l'ancien module compl&#233;mentaire ReportSymbols, d&#233;velopp&#233; par le m&#234;me auteur. Vous devez d&#233;sinstaller celui-ci pour utiliser cette nouvelle version.<br />
Menu Pr&#233;f&#233;rences</p>
<ul>
<li>Param&#232;tres Report Symbols : Permet de d&#233;finir les pr&#233;f&#233;rences pour la verbalisation des symboles &#233;crit.</li>
</ul>
<p>Note : Un geste pour ouvrir cette bo&#238;te de dialogue peut &#234;tre assign&#233; en allant dans le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans le dialogue Gestes de commandes, dans la cat&#233;gorie Configuration.</p>
<pre><code>Auteur: Noelia Ruiz Mart&#237;nez     
Traduit en Fran&#231;ais par: R&#233;my Ruiz     </code></pre>
<p>Version: 4.5<br />
Derni&#232;re mise &#224; jour: 17 D&#233;cembre 2018<br />
<a href="http://addons.nvda-project.org/files/get.php?file=rsy">T&#233;l&#233;charger le module compl&#233;mentaire reportSymbols-4.5.nvda-addon par ici:</a></p>
<p>&#201;galement a &#233;t&#233; publi&#233;e La version 3.6 compatible &#224; partir de NVDA 2018.1.1 &#224; 2017.3. <a href="https://github.com/nvdaes/reportSymbols/releases/download/3.6/reportSymbols-3.6.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire reportSymbols-3.6.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="savelog">SaveLog <a id="savelog-4.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Enregistrer le journal (log) (fichier du registre)
Description: Module compl&#233;mentaire pour g&#233;rer le fichier journal
(log); pr&#233;c&#233;dent et actuel de NVDA.</code></pre>
<ol style="list-style-type: decimal">
<li>Objectif:<br />
Permet de sauvegarder le log (journal) de NVDA, aussi bien celui correspondant &#224; la session actuelle et celui g&#233;n&#233;r&#233; lors de la session pr&#233;c&#233;dente.<br />
</li>
<li>Commandes:<br />
2.1. Raccourcis clavier:<br />
control+maj+NVDA+l<br />
Sauvegarde le fichier journal actuel dans le dossier configuration de l'utilisateur de NVDA.<br />
2.2. Commandes du menu<br />
Depuis le menu &#8220;SaveLog (journal)&#8221;, sous-menu du menu principal de NVDA (NVDA+n), vous pouvez ex&#233;cuter les commandes suivantes:<br />
Afficher le journal actuel<br />
Ouvre la visionneuse du journal, disponible depuis le menu Outils de NVDA .<br />
Afficher le journal pr&#233;c&#233;dent<br />
Ouvre la visionneuse du journal pr&#233;c&#233;dent de NVDA, disponible dans ce module compl&#233;mentaire, pour lire et sauvegarder le journal g&#233;n&#233;r&#233; lors de la session pr&#233;c&#233;dente. En appuyant sur alt depuis la visionneuse, il s'ouvrira un menu avec les options Enregistrer sous... et Quitter, semblable &#224; la Visionneuse du journal actuel.<br />
Emplacement du menu<br />
Ouvre une bo&#238;te de dialogue pour s&#233;lectionner et enregistrer la position du menu &#8220;Save log (journal)&#8221;, qui peut &#234;tre dans le menu Principal ou le menu Outils<br />
Initialiser la journalisation<br />
Ouvre une bo&#238;te de dialogue de confirmation pour supprimer le contenu du journal actuel et supprimez le fichier du journal pr&#233;c&#233;dent, de fa&#231;on a red&#233;marrer le processus de journalisation.<br />
ouvrir documentation<br />
Ouvre la documentation pour ce module compl&#233;mentaire; si il n'y a aucune aide disponible dans la langue s&#233;lectionn&#233;e, il s'ouvre la documentation en anglais.<br />
</li>
<li>Notification<br />
NVDA annonce:<br />
</li>
</ol>
<ul>
<li>Si c'est possible ou non de sauvegarder le journal gr&#226;ce &#224; la commande control+maj+NVDA+l</li>
<li>Dans une bo&#238;te de dialogue, S'il n'a pas &#233;t&#233; possible de sauvegarder le journal de la session actuelle ou pr&#233;c&#233;dente &#224; l'aide de l'option correspondante dans le menu des visionneuses de journal<br />
Version: 4.0<br />
Langues: Anglais, Fran&#231;ais, Espagnol et Italien.<br />
Auteur: Noelia Ruiz Mart&#237;nez<br />
Traduit en fran&#231;ais par: R&#233;my Ruiz<br />
J'ai oubli&#233;, la traduction en Fran&#231;ais et espagnol n&#8217;est pas incluse dans le module compl&#233;mentaire d'origine fait par l'auteur.<br />
<a href="https://blindhelp.github.io/savelog-4.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire SaveLog-4.0.nvda-addon [via BlindHelp.github.io]</a></li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="shortlink">ShortLink <a id="ShortLink-2.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
R&#233;duire URL
Description: R&#233;duire URL: module compl&#233;mentaire pour utiliser Bitly
avec NVDA

module compl&#233;mentaire pour r&#233;duire les liens avec Bitly et NVDA
1. Comandes: menu Lien court (sous menu de NVDA: NVDA+n)
R&#233;duire URL...
Ouvre une bo&#238;te de dialogue permettant d&#39;entrer l&#39;adresse &#224; laquelle vous souhaitez r&#233;duire. Si l&#39;URL a &#233;t&#233; correctement abr&#233;g&#233;e, le lien court sera copi&#233; dans le presse-papiers; si ont fait OK une autre bo&#238;te de dialogue s&#39;ouvre pour indiquer un nom avec lequel vous pouvez enregistrer le nouveau lien dans le module compl&#233;mentaire. Comande disponible avec les touches control+shift+u.
Statistiques
Ouvre la liste des liens enregistr&#233;s dans le module compl&#233;mentaire. Pour chaque nom choisi il sera affich&#233; en stockant l&#39;adresse courte correspondante. Si ont fait OK il s&#39;ouvrira la page de statistiques de Bitly pour l&#39;URL choisi.
Supprimer le lien
Ouvre une bo&#238;te de dialogue pour choisir le lien que vous souhaitez supprimer. Si on fait OK une autre bo&#238;te de dialogue s&#39;ouvre pour confirmer si vous voulez vraiment supprimer le lien s&#233;lectionn&#233;.
Ajouter des liens de fichier
Ouvre une bo&#238;te de dialogue pour s&#233;lectionner un fichier qui contient les liens g&#233;n&#233;r&#233;s avec le module compl&#233;mentaire ShortLink install&#233; sur un autre PC, pour les ajouter au module compl&#233;mentaire dans le PC actuel.
Ouvrez le site de Bitly
Ouvre la page d&#39;accueil de Bitly, contenant des informations en anglais &#224; propos de ce service et des liens pour cr&#233;er un nouveau compte ou s&#39;inscrire dans des comptes d&#233;j&#224; existantes.
Pr&#233;f&#233;rences de Bitly
Ouvre une bo&#238;te de dialogue pour indiquer le nom et la &#8220;API key&#8221; d&#39;une compte personnels cr&#233;&#233; en Bitly. Si ont fait OK, Ces donn&#233;es seront stock&#233;es &#224; l&#39;int&#233;rieur du module compl&#233;mentaire, de telle sorte que la r&#233;duction des liens s&#39;effectue en utilisant le compte sp&#233;cifi&#233;.
Copier dossier de configuration
Ouvre une bo&#238;te de dialogue pour choisir l&#39;endroit o&#249; sera copi&#233; le dossier de configuration du module compl&#233;mentaire, avec les pr&#233;f&#233;rences et les liens stock&#233;e.
Restauration du dossier de configuration
restaurer la configuration du module compl&#233;mentaire, depuis la copie de sauvegarde de s&#233;curit&#233; g&#233;n&#233;r&#233;e avec la comande Copier dossier de configuration
Ouvrir le dossier d&#39;information
Ouvre un dossier avec les fichiers d&#39;information a propos du module compl&#233;mentaire, s&#39;il existe pour la langue s&#233;lectionn&#233;e dans NVDA.
2. Important
Pour utiliser se module compl&#233;mentaire, c&#39;est important de cr&#233;er un compte propre &#224; Bitly. ShortLink incorpore un nom et un&#8220;API key&#8221; seulement pour tester leurs fonctions.

Version: 2.0
Langues: Anglais, Fran&#231;ais, et Espagnol.
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p>Tr&#232;s important : Le module compl&#233;mentaire Short Link (Lien court), marqu&#233; comme obsol&#232;te il y a des ann&#233;es par son auteur ((m&#234;me si &#231;a marche toujours parce que je l'ai essay&#233;), a subi un changement dans son fonctionnement. D&#233;sormais, ceux qui souhaitent continuer &#224; l'utiliser doivent s'enregistrer dans le r&#233;ducteur bitly et ajouter leurs propres identifiants de connexion dans la configuration. Cela est d&#251; au fait que l'auteur a r&#233;voqu&#233; l'acc&#232;s incorpor&#233; en s&#233;rie dans le module compl&#233;mentaire.</p>
<p>Pour plus d'informations vous pouvez consulter la page principal de Bitly (en anglais):<br />
<a href="https://bitly.com/">bitly &#9829; your bitmarks</a></p>
<p><a href="https://blindhelp.github.io/ShortLink-2.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire ShortLink-2.0.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="specificsearch-mod">SpecificSearch mod <a id="SpecificSearch mod.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Recherche sp&#233;cifique mod
Description: Module compl&#233;mentaire pour rechercher le texte que vous
souhaitez rechercher dans des documents virtuels sp&#233;cifiques.
Version: 2.0
Langues: Anglais, Fran&#231;ais, et Espagnol.
Auteur: Noelia Ruiz Mart&#237;nez
Traduit en fran&#231;ais par: R&#233;my Ruiz
Maintenant le module compl&#233;mentaire Specific Search mod utilise les
touches: point et deux-pouints sur des sites Web avec aucune bo&#238;te
de dialogue
Une modif pour le module compl&#233;mentaire d&#233;velopp&#233; par Noelia Ruiz
Mart&#237;nez, avec quelques changements fait par Oriol G&#243;mez: il s&#39;agit
d&#39;un module compl&#233;mentaire pour rechercher du texte selon le titre
de la page.
Les modifications fait par Oriol G&#243;mez sont:
-Remplacement des raccourcis clavier pour (point et deux-points)
pour le rendre plus facile &#224; utiliser comme les touches de
navigation rapide, avec des filtres dynamiques pour s&#39;assurer que
vous &#234;tes en mode de navigation.
NVDA ne remplace pas le dernier texte rechercher pour une
recherche sp&#233;cifique. L&#39;autre module compl&#233;mentaire fait cela, et je
ne vois pas pourquoi. Il est plus commode d&#39;avoir NVDA Rechercher
son propre texte et d&#39;avoir une recherche sp&#233;cifique afin de
rechercher ce qu&#39;il veut sans remplacer le texte recherch&#233; de NVDA.
Enlev&#233; le texte %s non trouv&#233; de message dans la bo&#238;te de dialogue
et la remplac&#233; pour un appel au synth&#233;tiseur. </code></pre>
<p><a href="https://blindhelp.github.io/SpecificSearch%20mod.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire SpecificSearch mod.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="svox-pico-synthesizer">Svox-Pico-Synthesizer <a id="Svox-Pico-Synthesizer.nvda-addon"></a></h1>
<pre><code>Type: Synth&#233;tiseurs Vocaux
Synth&#233;tiseur Svox Pico
Le module Svox-Pico installe le synth&#233;tiseur Open-Source Svox Pico
pour NVDA.
Auteur : Aleksey Sadovoy, Michael Curran
Version : 2011.2
Ex&#233;cutez le raccourci: Control+NVDA+S pour s&#233;lectionner le
synth&#233;tiseur. </code></pre>
<p><a href="https://blindhelp.github.io/Svox-Pico-Synthesizer.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire Svox-Pico-Synthesizer.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="switch_synth">switch_synth <a id="switchSynth-1.02.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Description: Ce module compl&#233;mentaire permet de basculer facilment entre les synth&#233;tiseurs via des raccourcis.</code></pre>
<p>C&#8217;est une version am&#233;lior&#233;e de mon pr&#233;c&#233;dent module compl&#233;mentaire switch_synth avec un souligner, qui doit &#234;tre d&#233;sinstall&#233;. Les configurations de synth&#233;tiseur pr&#233;existantes continueront &#224; fonctionner avec cette version.<br />
Il y a 6 positions de synth&#233;tiseur, 1 jusqu'&#224; 6. Par d&#233;faut, ils sont vides. les positions peuvent &#234;tre altern&#233;s en appuyant sur contr&#244;le+maj+NVDA+1 jusqu'&#224; contr&#244;le+maj+NVDA+6. Une fois qu'une position est altern&#233; jusqu'&#224; celle-ci, son synth&#233;tiseur et ces param&#232;tres seront charg&#233;s si elles existent. Pour sauvegarder le synth&#233;tiseur actuel et ses param&#232;tres dans la position active, appuyez sur contr&#244;le+maj+NVDA+v.<br />
Version: 1.02<br />
Auteur: Tyler Spivey<br />
<a href="https://addons.nvda-project.org/files/get.php?file=sws">T&#233;l&#233;charger le module compl&#233;mentaire switchSynth-1.02.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="tapin_radio">Tapin_Radio <a id="TapinRadioStatusAnnouncer-2.0.nvda-addon"></a></h1>
<pre><code>Type: Extensions
         Tapin Radio Information Announcer </code></pre>
<ul>
<li>Auteur : Jiri Holzinger,</li>
</ul>
<p>Description :</p>
<p>Un module compl&#233;mentaire qui montre les informations de ce qui se joue et vous permet de maximiser la fen&#234;tre du programme avec la commande NVDA+maj+t.</p>
<p>Raccourci:</p>
<ul>
<li>Une simple frappe de NVDA+Maj+T annonce la station s&#233;lectionn&#233;e, le temps &#233;coul&#233; et la quantit&#233; de donn&#233;es utilis&#233;es pour la station. Ces informations sont copi&#233;es dans le presse-papier.</li>
<li>Une double frappe de NVDA+Maj+T maximise la fen&#234;tre du programme. Cette action est vocalis&#233;e. Avec une double frappe, il y a bien s&#251;r copie des infos dans le presse-papier.<br />
Langues: Il prend en compte la langue du programme TapinRadio.<br />
Lorsqu'il maximise la fen&#234;tre du programme. Cette action est vocalis&#233;e par NVDA en utilisant la localization du module compl&#233;mentaire Tapin Radio Information Announcer (si disponnible).<br />
Version: 2.0<br />
Auteur: Jiri Holzinger<br />
<a href="https://github.com/BlindHelp/TapinRadioStatusAnnouncer/releases/download/2.0/TapinRadioStatusAnnouncer-2.0.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire TapinRadioStatusAnnouncer-2.0.nvda-addon [via BlindHelp.github.io]</a><br />
Remarque par BlindHelp: Le module TapinRadio utilise la m&#234;me commande que le module compl&#233;mentaire Instant Translate par d&#233;faut.<br />
Note : La commande ci-dessus peut &#234;tre chang&#233; depuis le menu NVDA, sous-menu Pr&#233;f&#233;rences, dans la bo&#238;te de dialogue Gestes de commandes, dans la cat&#233;gorie Configuration.<br />
Gestes de commandes<br />
Dans ce dialogue, vous pouvez configurer les gestes de commandes<br />
(raccourcis clavier, boutons d'un afficheur braille etc) pour les commandes NVDA.<br />
Seules les commandes qui sont applicables imm&#233;diatement avant l'ouverture du dialogue sont affich&#233;es. Par exemple, si vous souhaitez personnaliser des commandes li&#233;es au mode navigation, vous devez ouvrir le dialogue des gestes de commandes lorsque vous &#234;tes en mode navigation. L'arborescence de ce dialogue r&#233;pertorie toutes les commandes NVDA applicables regroup&#233;es par cat&#233;gories.<br />
Vous pouvez les filtrer en entrant un ou plusieurs mots du nom de la commande dans la zone d'&#233;dition Filtrer par dans n'importe quel ordre. Tous les gestes associ&#233;s &#224; une commande sont &#233;num&#233;r&#233;s au niveau suivant la commande. Pour ajouter un geste &#224; une commande, s&#233;lectionnez la commande et appuyez sur le bouton &quot;Ajouter&quot;. Ensuite, effectuez le geste de commande que vous souhaitez associer, par exemple appuyez sur une touche du clavier ou un bouton sur l'afficheur braille. Parfois, un geste peut &#234;tre interpr&#233;t&#233; de plusieurs fa&#231;ons. Par exemple, si vous avez appuy&#233; sur une touche du clavier, vous voudrez peut-&#234;tre qu'elle soit sp&#233;cifique &#224; la configuration actuelle du clavier (par exemple,<br />
ordinateur de bureau ou ordinateur portable) ou vous voudrez peut-&#234;tre l'appliquer pour toutes les configurations. Dans ce cas, un menu appara&#238;t, vous permettant de s&#233;lectionner l'option d&#233;sir&#233;e. Pour supprimer un geste d'une commande, s&#233;lectionnez le geste et appuyez sur le bouton &quot;Supprimer&quot;. Lorsque vous avez termin&#233; vos modifications, appuyez sur le bouton &quot;OK&quot; pour les sauvegarder ou sur le bouton &quot;Annuler&quot; pour les ignorer.</li>
</ul>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="thunderbird">Thunderbird <a id="thunderBird-2.9.6.1, 2019-01-02.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Description du module compl&#233;mentaire Thunderbird pour NVDA, compagnon de Chichi Par Pierre-Louis:
J&#39;ai le plaisir de vous annoncer la sortie de la version 2.9.6.1-2019-01-02 du
Module compl&#233;mentaire Thunderbird pour NVDA, compagnon de Chichi
d&#233;velopp&#233; par notre ami Yannick.
Encore plus de confort et d&#39;efficacit&#233; !
   Jugez-en par vous-m&#234;me :</code></pre>
<p>C'est une version corrig&#233;e du module compl&#233;mentaire pour Thunderbird, vous la trouverez en t&#233;l&#233;chargement ci-dessous.</p>
<p>Pour remettre les pendules &#224; l'heure, j'ai mis &#224; jour le site avec les derni&#232;res versions de l'extension Chichi pour Thunderbird et du module compagnon Thunderbird pour NVDA.</p>
<ol style="list-style-type: decimal">
<li>T&#233;l&#233;chargement et documentation de Chichi :</li>
</ol>
<p><a href="http://www.rptools.org/Outils-DV/chichi-thunderbird.html">Pour plusd'informations consulter la pr&#233;sentation de Chichi: extension d'accessibilit&#233; et d'efficacit&#233; pour Mozilla Thunderbird en cliquant ici:</a><br />
Note : Cette page contient des informations sur la version de Chichi et la version du module compl&#233;mentaire pour NVDA associ&#233; &#224; Thunderbird. ; compatible avec Thunderbird 60 et plus.<br />
Derni&#232;re mise &#224; jour le 7 Janvier 2019</p>
<p><a href="http://www.rptools.org/?p=8561">T&#233;l&#233;chargez ici l'extension Chichi pour Thunderbird [version 60 et plus]</a><br />
Nom du fichier:<br />
chichi-2018-10-30-<span class="citation">@rptools.org.xpi</span></p>
<p><a href="http://www.rptools.org/beta/Chicfhi%20TB%2060%202018%2010%2030.zip">Vous pouvez t&#233;l&#233;charger l'extension Chichi en archive .zip en cliquant ici:</a></p>
<p>Ce paquet contient la version beta du 28/10/2018 de Chichi, la version associ&#233;e du module thunderbird pour NVDA et l'aide de Chichi.<br />
Dans l'archive, il y a un fichier d'aide que je recommande de lire, des changements assez importants ont eu lieu.</p>
<p>Note Tr&#232;s Importante!<br />
Ne prenez que module Chichi, celui-ci peut bient&#244;t changer, n'utilisez pas le module compl&#233;mentaire de Thunderbird contenu dans le fichier, mais t&#233;l&#233;chargez la derni&#232;re version du module compl&#233;menttair Thunderbird ci-dessous.</p>
<ol start="2" style="list-style-type: decimal">
<li>T&#233;l&#233;chargement du module Thunderbird et documentation :</li>
</ol>
<p><a href="http://www.rptools.org/beta/thunderBird-2.9.6.1,%202019-01-02.nvda-addon">T&#233;l&#233;chargez ici la derni&#232;re version 2.9.6.1-2019-01-02 du module compl&#233;mentaire Thunderbird,compatible avec Chichi pour Thunderbird [version 60 et plus]</a></p>
<p>voici une petite mise &#224; jour du module qui corrige quelques bugs apparus assez r&#233;cemment. En outre, j'ai modifi&#233; le num&#233;ro de version afin de ne plus s'y perdre et j'ai ajout&#233; des infos de version dans le fichier manifest.ini afin de rendre le module compatible avec la future version 2019.1 de NVDA.</p>
<p>Le fichier d'aide du module contient les Notes de version suivantes :</p>
<h1 id="version-2.9.6.1-02-janvier-2019">5.1. Version 2.9.6.1, 02 Janvier 2019</h1>
<ul>
<li>Correction du d&#233;marrage bloqu&#233; du module suite &#224; la disparition du fichier de configuration par d&#233;faut ;</li>
<li>R&#233;tablissement du raccourci NVDA+a pour ne plus emp&#234;cher la fonction dire tout de fonctionner avec un clavier de PC portable ;</li>
<li>Correction de la vocalisation des dates dans la liste des messages ;</li>
</ul>
<p>Apr&#232;s r&#233;installation, vous devrez sans doute le reconfigurer. Pour ce faire, placer-vous dans le tableau des messages, pressez Alt+puissance 2, descendez sur Options pour NVDAet dans le sous-menu, r&#233;glez chaque option &#224; votre convenance. Certaines de ces options sont tr&#232;s confortables lorsqu'elles sont activ&#233;es.</p>
<p>Remarque : Si vous utilisez actuellement le module compl&#233;menttair Thunderbird sans l'extension Chichi, vous devez installer cette nouvelle version du module compl&#233;menttair pour NVDA associ&#233;e &#224; Chichi:</p>
<p>Module compl&#233;mentaire Thunderbird pour NVDA, compagnon de Chichi<br />
<a href="http://www.rptools.org/?p=8551">Version: 2.9.6.1 du 2 janvier 2019</a><br />
Correction de bogue par Yannick.<br />
Non compatible avec Windows XP.<br />
Derni&#232;re mise &#224; jour le 2 Janvier 2019<br />
Pour d'autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.</p>
<p><a href="http://www.rptools.org/Outils-DV/NVDA-Thunderbird.html">Pour plusd'informations consulter la pr&#233;sentation du module compl&#233;mentaire Thunderbird pour NVDA, compagnon de Chichi en cliquant ici:</a><br />
Derni&#232;re mise &#224; jour le 7 Janvier 2019</p>
<pre><code>Cette version de Chichi convient &#224; Thunderbird 60 et sup&#233;rieures, pas &#224; la version 52. N&#39;utilisez pas une ancienne version du module Thunderbird avec la pr&#233;sente version de Chichi.         </code></pre>
<p>Si vous utilisez une version de Chichi ant&#233;rieure &#224; la version du 28 octobre 2018, il est n&#233;cessaire de la d&#233;sinstaller au pr&#233;alable.</p>
<p>Et enfin, pour devancer des questions au sujet de l&#8217;acc&#232;s aux pi&#232;ces jointes :</p>
<ul>
<li><p>Dans la fen&#234;tre principale, le panneau de visualisation d'un message doit &#234;tre affich&#233; pour pouvoir acc&#233;der aux pi&#232;ces jointes avec TAB, F6 ou encore la lettre p. Ceci est inh&#233;rent &#224; Thunderbird, pas &#224; Chichi. Pressez sur F8 pour afficher ce panneau.</p></li>
<li><p>Dans la fen&#234;tre de r&#233;daction,&#160; la liste des pi&#232;ces jointes est accessible via Tab ou&#160; maj+Tab mais aucune action&#160; sur une pi&#232;ce jointe n'est possible lorsque vous venez d'en ajouter au message. Je n'ai pas trouv&#233; de moyen de contourner ce probl&#232;me sinon de ne pas se tromper d&#232;s le d&#233;part. Toute astuce sera la bienvenue.</p>
<p>Bonne d&#233;couverte !<br />
Pierre-Louis</p></li>
</ul>
<p><a href="http://www.rptools.org/Outils-DV/NVDA-Thunderbird.html#toc2">La version 2.9.2 pr&#233;sente sur cette page pose des probl&#232;mes avec les versions 52 et suivantes de Thunderbird.</a><br />
Elle a &#233;t&#233; remplac&#233;e par l'extension Chichi pour Thunderbird et une version sp&#233;cifiquement associ&#233;e du module Thunderbird pour NVDA :<br />
<a href="http://www.rptools.org/Outils-DV/chichi-thunderbird.html">Consulter la page Chichi et le module Thunderbird associ&#233; en cliquant ici:</a><br />
Note : Cette page contient des informations sur la version de Chichi et la version du module compl&#233;mentaire pour NVDA associ&#233; &#224; Thunderbird. ; compatible avec Thunderbird 60 et plus.<br />
Derni&#232;re mise &#224; jour le 7 Janvier 2019</p>
<p>Module compl&#233;mentaire Thunderbird pour NVDA<br />
<a href="http://www.rptools.org/?p=854">Version : 2.9.2</a><br />
Non compatible avec Windows XP.<br />
Derni&#232;re mise &#224; jour le 27/05/2017<br />
Pour d'autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.</p>
<p><a href="http://www.rptools.org/?p=854">T&#233;l&#233;charger l'ancienne version 2.9.2 du module ici: [lien externe]</a></p>
<p>N'utilisez pas cette version avec Chichi.</p>
<p><a href="http://www.rptools.org/Outils-DV/">Visitez son site Outils-DV, logiciels et tutos pour D&#233;ficients visuels, en cliquant ici.</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="tonemaster">toneMaster <a id="toneMaster-1.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Description : Jouer des m&#233;lodies musicales cr&#233;&#233; &#224; partir des fichiers de donn&#233;es de tonalit&#233; en utilisant les bips de NVDA.
Pour commencer, allez dans le menu NVDA-&gt;Outils-&gt;Tone Master.
Appuyer sur NVDA+Alt+T pour jouer le fichier de donn&#233;es de tonalit&#233; charg&#233;. Appuyer sur NVDA+Alt+Maj+T pour arr&#234;ter la lecture.
Pour d&#39;autres instructions, appuyez sur le bouton Aide de ce module compl&#233;mentaire, dans le Gestionnaire de modules compl&#233;mentaires.
Auteur: Hrvoje Kati&#263; </code></pre>
<p><script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#72;&#114;&#118;&#x6f;&#106;&#x65;&#32;&#x4b;&#x61;&#116;&#x69;&#x107;&#32;&#40;&#104;&#114;&#118;&#x6f;&#106;&#x65;&#x6b;&#x61;&#116;&#x69;&#x63;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
<a href="https://github.com/hkatic/tonemaster">Consultez la page du r&#233;f&#233;rentiel (repository) sur JitHub</a><br />
Ce module compl&#233;mentaire est mis &#224; jour avec les nouvelles sources puis retraduit en fran&#231;ais et en espagnol par R&#233;my Ruiz et d'autres contributeurs.<br />
Mais la nouvelle mise &#224; jour des traductions pour les langues disponibles sont pas encore int&#233;gr&#233;es dans le module compl&#233;mentaire en t&#233;l&#233;chargement donn&#233; par l'auteur mais sont int&#233;gr&#233;es dans les sourrces qui se trouvent sur le r&#233;f&#233;rentiel (repository.</p>
<p>Derni&#232;re mise &#224; jour: 10 Octobre 2018<br />
Version: 1.3 (version de d&#233;veloppement non officielle)<br />
Traduit en fran&#231;ais par: Michel Such et R&#233;my Ruiz<br />
Traduit en espagnol par: Iv&#225;n Novegil Cancelas, Juan C. Buno et R&#233;my Ruiz<br />
<a href="https://blindhelp.github.io/toneMaster-1.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire toneMaster-1.3.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="training-keyboard-commands">Training Keyboard Commands<a id="trainingKeyboardCommands-1.2-dev.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Voici un nouveau module compl&#233;mentaire nomm&#233; Training Keyboard Commands qui fait son apparition pour toutes les personnes qui souhaite s&#39;exercer avec les commandes de NVDA  en jouant.
Si vous voulez en savoir plus sur ce fabuleux add-on, vous pouvez lire la description ci-dessous faite par son auteur:
Merci &#224; Ibrahim Hamadeh! &#128515;
Derni&#232;re mise &#224; jour: 20 Janvier 2019
Version actuelle: 1.2-dev(en d&#233;veloppement)</code></pre>
<p>Note: le premier lien de t&#233;l&#233;chargement via le site comunautaire des modules compl&#233;mentaires NVDA nous renvoi &#224; l'ancienne version de d&#233;veloppement 1.1, veuillez utiliser le lien donn&#233; par son auteur pour t&#233;l&#233;charger la nouvelle version de d&#233;veloppement 1.2, que vous trouverez ci-dessous. Merci.</p>
<h1 id="training-keyboard-commands-1">Training Keyboard Commands</h1>
<ul>
<li>Auteur: Ibrahim Hamadeh</li>
<li>T&#233;l&#233;charger <a href="https://addons.nvda-project.org/files/get.php?file=trainingkbdcmd">version de d&#233;veloppement</a></li>
</ul>
<p>Ce module compl&#233;mentaire est con&#231;u pour s'exercer aux commandes NVDA comme s'il s'agissait d'un jeu, que ce soit pour les dispositions clavier pour les ordinateurs de bureau (Desktop) ou pour les ordinateurs portables (Laptop).</p>
<p>Toutes les donn&#233;es des commandes sont extraites du fichier keyCommands.html du dossier documentation selon la localisation de la langue de NVDA.</p>
<p>Vous devez lui affecter un geste sp&#233;cifique via: le menu NVDA&gt;Pr&#233;f&#233;rences&gt;Gestes de commandes&gt;trainingKeyboardCommands.</p>
<h2 id="mode-dutilisation-1">Mode d'utilisation</h2>
<ul>
<li>Vous choisissez le mode de disposition clavier que vous souhaitez vous exercer et commencez &#224; jouer</li>
<li>Une commande ou une question et sa description seront affich&#233;es. Vous devez appuyer sur les touches appropri&#233;es ou r&#233;pondre</li>
<li>Si vous avez choisi la bonne r&#233;ponse, vous gagnerez un point</li>
<li>Si la r&#233;ponse &#233;tait incorrecte, le score ne changera pas et vous continuerez sans rien perdre</li>
<li>&#192; tout moment, si vous souhaitez quitter, il vous sera demand&#233; si vous souhaitez enregistrer les questions restantes pour la partie suivante</li>
<li>Si vous choisissez par la suite une disposition avec des questions enregistr&#233;es, il vous sera demand&#233; si vous souhaitez reprendre les questions restantes de la partie pr&#233;c&#233;dente</li>
<li><p>En r&#233;pondant &#224; toutes les questions, environ 88 pour chaque disposition, vous serez d&#233;clar&#233; gagnant de la coupe NVDA.</p>
<p>Ceci est une nouvelle version de d&#233;veloppement 1.2 du module compl&#233;mentaire Training Keyboard Commands.</p></li>
</ul>
<h1 id="changements">Changements:</h1>
<ul>
<li>Maintenant, la disposition du clavier actuelle est s&#233;lectionn&#233;e par d&#233;faut au d&#233;marrage.</li>
<li>comme un utilisateur hispanophone a sugg&#233;r&#233; d'ajouter des sons &#224; certains &#233;v&#233;nements des sons ont &#233;t&#233; ajout&#233;s pour une r&#233;ponse correcte, pour une r&#233;ponse incorrecte et &#224; la fin du jeu.</li>
</ul>
<h1 id="lien-de-t&#233;l&#233;chargement">Lien de t&#233;l&#233;chargement:</h1>
<p>T&#233;l&#233;charger <a href="https://github.com/ibrahim-s/trainingNvdaCommands/releases/download/v1.2/trainingKeyboardCommands-1.2-dev.nvda-addon">Version de d&#233;veloppement 1.2</a></p>
<p>Retrouver le module compl&#233;mentaire <a href="https://addons.nvda-project.org/addons/trainingKeyboardCommands.fr.html">Training Keyboard Commands</a> sur le site comunautaire des modules compl&#233;mentaires NVDA</p>
<p><a href="https://github.com/ibrahim-s/trainingNvdaCommands">Code source sur GitHub</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="translate">Translate<a id="translate-2018.12.2.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Compatible avec NVDA 2018.3 et  versions ult&#233;rieures</code></pre>
<h1 id="translate-1">Translate</h1>
<ul>
<li>Auteur: Yannick PLASSIARD</li>
</ul>
<h1 id="traduction">Traduction</h1>
<p>Utilise le service Google Traduction pour traduire &#224; la vol&#233;e le texte parl&#233; dans la langue de votre choix.</p>
<p>Une connexion internet est requise.</p>
<h1 id="t&#233;l&#233;charger-le-module-compl&#233;mentaire-translate">T&#233;l&#233;charger le module compl&#233;mentaire Translate</h1>
<p>Voici un module compl&#233;mentaire rapide que notre ami Yannick PLASSIARD a cr&#233;&#233; pour traduire automatiquement tout texte parl&#233; dans la langue d&#233;finie par NVDA.</p>
<p>Il peut traduire n'importe quel texte, du contenu de la page Web aux jeux, &#224; condition que NVDA soit utilis&#233; pour parler le texte.</p>
<p>Derni&#232;re mise &#224; jour: 20 D&#233;cembre 2018:</p>
<p>Version actuelle: 2018.12.2.1</p>
<p><a href="https://github.com/yplassiard/nvda-translate/releases/download/v2018.12.2.1/translate-2018.12.2.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire Traduction v2018.12.2.1 via la page de l'auteur sur GitHub</a></p>
<h1 id="plus-dinformations-sur-le-module-compl&#233;mentaire-translate">Plus d'informations sur le module compl&#233;mentaire Translate</h1>
<p><a href="https://github.com/yplassiard/nvda-translate/releases">Vous pouvez trouver la derni&#232;re release en date du module compl&#233;mentaire Traduction via la page de l'auteur sur GitHub</a></p>
<p><a href="https://github.com/yplassiard/nvda-translate/">Consulter le repository (r&#233;f&#233;rentiel) du module compl&#233;mentaire Traduction via la page de l'auteur sur GitHub</a></p>
<p>Merci &#224; Yannick PLASSIARD! &#128515;</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="virtual-review">Virtual Review <a id="virtualRevision-2.4.nvda-addon"></a></h1>
<pre><code>Type: Extensions
R&#233;vision virtuelle
Ce module permet aux utilisateurs de NVDA de r&#233;visez le contenu
d&#39;une fen&#234;tre dans une zone de texte, de la m&#234;me mani&#232;re qu&#39;avec la
virtualisation de la fen&#234;tres de Jaws pour Windows. A notez
cependant que ceci n&#39;est qu&#39;une facilit&#233; pour les utilisateurs et
&quot;ne&quot; remplace pas l&#39;excellent support pour les modes de revue de
NVDA ou la navigation par objets.
Utilisation
Appuyez sur NVDA+contr&#244;le+w pour ouvrir la fen&#234;tre de
r&#233;vision virtuelle. Puis naviguez simplement dans la zone de texte
affich&#233;e comme vous feriez dans n&#39;importe quel texte. Vous pouvez
appuyer sur &#201;CHAP pour fermer la fen&#234;tre de r&#233;vision virtuelle.
Ancien nom  du module compl&#233;mentaire : virtualRevision.
Nouveau nom du module compl&#233;mentaire : Virtual Review.
Derni&#232;re mise &#224; jour: 14 Janvier 2019
Version: 2.4
Auteurs : Rui Batista et l&#39;&#233;quipe de la communaut&#233; des modules
compl&#233;mentaires NVDA
Traduit en fran&#231;ais par: R&#233;my Ruiz </code></pre>
<p><a href="https://addons.nvda-project.org/files/get.php?file=VR">T&#233;l&#233;charger le module compl&#233;mentaire virtualRevision-2.4.nvda-addon par ici:</a><br />
Quelques notes a propos du module compl&#233;mentaire Virtual Review version 2.4</p>
<pre><code>1.- Fonctionnement du module compl&#233;mentaire virtualRevision-2.4.nvda-addon:

Avec la commande : NVDA+Ctrl+W.

Une fen&#234;tre similaire au bloc-notes, s&#39;ouvre avec le texte
    d&#39;information qui se trouve sur l&#39;&#233;cran.

Nous pouvons passer &#224; travers elle, avec les commandes
    de lecture.

Nous pouvons s&#233;lectionner et copier des informations.

Pour fermer il faut Appuyez sur la touche Echap.

2.- Exemple:

Nous sommes all&#233;s &#224; Ce PC sous W10, ou Ordinateur sous W7, ou Poste de travail sous
    Windows XP, nous cherchons Windows (C:), ou Disque locale (C:),

Nous avons appuyez sur ALT + entr&#233;e, pour avoir les propri&#233;t&#233;s.

Avec la commande NVDA+B , nous pouvons lire toutes les
    informations, mais avec l&#39;&#233;cran virtuel, NVDA+Ctrl+W,</code></pre>
<p>nous pouvons lire les informations &#224; l'aide des touches, puis s&#233;lectionner... et copier...</p>
<pre><code>Remarques par BlindHelp:
Ce compl&#233;ment pour moi est tr&#232;s fonctionnel...
J&#39;esp&#232;re que tr&#232;s bient&#244;t nous pourrons progresser &#224; travers les
fen&#234;tres avec le curseur de la souris...</code></pre>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="vlcaccessenhancement">VLCAccessEnhancement<a id="VLCAccessEnhancement-1.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Cet addon ajoute diverses commandes pour faciliter la lecture des m&#233;dias:</p>
<ul>
<li>script pour annoncer la dur&#233;e du m&#233;dia d&#233;j&#224; lue,</li>
<li>script pour annoncer la dur&#233;e du m&#233;dia restante &#224; lire,</li>
<li>script pour annoncer la dur&#233;e totale du m&#233;dia,</li>
<li>script pour annoncer la vitesse courante,</li>
<li>annonce automatique des changements d'&#233;tat comme la mise en pause , la coupure du son, la modification de la hauteur du son ou de la vitesse de lecture, la mise en lecture r&#233;p&#233;t&#233;e ou al&#233;atoire,</li>
<li>annonce automatique de la dur&#233;e apr&#232;s une commande de saut,</li>
<li>scripts pour marquer une position de lecture et relancer la lecture &#224; cette position,</li>
<li>script pour reprendre la lecture interrompue au temps m&#233;moris&#233; par VLC,</li>
<li>lecture correcte de la barre d'&#233;tat,</li>
<li><p>possibilit&#233; de modification de certains raccourcis clavier g&#233;nants de VLC.</p>
<p>La liste des commandes est obtenue par Control+NVDA+H<br />
Compatible avec VLC 3.0 ou sup&#233;rieure.<br />
Test&#233; avec NVDA 2018.2 et NVDA 2018.3</p>
<p>Auteur: PaulBer19<br />
Version : 1.1<br />
Langues: Anglais, Fran&#231;ais Espagnol.<br />
Traduit en espagnol par R&#233;my Ruiz<br />
Derni&#232;re mise &#224; jour: 20 D&#233;cembre 2018<br />
Petite mise &#224; jour cosm&#233;tique pour &#234;tre conforme aux versions alpha de NVDA et avec correction de bug et de documentation.</p></li>
</ul>
<p><a href="https://rawgit.com/paulber007/AllMyNVDAAddons/master/VLC/VLCAccessEnhancement-1.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire VLCAccessEnhancement-1.1.nvda-addon par ici:[lien externe]</a></p>
<pre><code>Pour plus d&#39;informations vous pouvez consulter la documentation pour
la version 1.1 depuis le Gestionnaire des modules compl&#233;mentaires
(dans G&#233;rer les modules compl&#233;mentaires)
Chercher le nom du module compl&#233;mentaire nomm&#233;:
Lecteur multim&#233;dia vlc
Faire Tab, pour rechercher le bouton Aide, puis appuyer sur celuici,
puis la documentation s&#39;ouvre.</code></pre>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="weather-plus">Weather Plus <a id="Weather Plus4.8.nvda-addon"></a></h1>
<pre><code>Consulter sur BlindHelp.github.io:                           </code></pre>
<p><a href="https://blindhelp.github.io/Weather-Plus-supprim%C3%A9-de-la-page-du-site-comunautaire-des-modules-compl%C3%A9mentaires-NVDA-%C3%A0-la-demande-de-son-auteur/">Weather Plus supprim&#233; de la page du site comunautaire des modules compl&#233;mentaires NVDA &#224; la demande de son auteur</a><br />
Lundi 7 Janvier 2019</p>
<p><a href="https://blindhelp.github.io/Weather-Plus-message-de-l&#39;auteur/">Weather Plus message de l'auteur</a><br />
Lundi 7 Janvier 2019</p>
<p><a href="https://blindhelp.github.io/Weather-Plus-prend-des-vacances/">Weather Plus prend des vacances</a><br />
Vendredi 4 Janvier 2019</p>
<p><a href="https://blindhelp.github.io/Avertissement-WeatherPlus-Le-module-compl%C3%A9mentaire-cesse-de-fonctionner-car-le-service-dont-il-d%C3%A9pend-n&#39;est-plus-disponible/">Avertissement WeatherPlus - Le module compl&#233;mentaire cesse de fonctionner car le service dont il d&#233;pend n'est plus disponible</a><br />
Vendredi 4 Janvier 2019</p>
<pre><code>D&#233;sol&#233; pour le d&#233;rangement.                   

Type: Extensions
Ce module compl&#233;mentaire ajoute la temp&#233;rature locale et les pr&#233;visions m&#233;t&#233;o &#224; 24 heures actuelles et les pr&#233;visions jusqu&#39;&#224; 9 jours suppl&#233;mentaires &#224; NVDA.
    Appuyez sur NVDA + w pour la temp&#233;rature actuelle et les conditions m&#233;t&#233;o.
Appuyez sur NVDA + maj + W pour les pr&#233;visions &#224; 24 heures et les pr&#233;visions &#224; 9 jours.
Appuyez sur NVDA + maj + contr&#244;le + w pour d&#233;finir une ville temporaire.
Appuyez sur NVDA + maj + contr&#244;le + alt + w pour ouvrir la bo&#238;te de dialogue Param&#232;tres Weather Plus.
Appuyez sur NVDA + alt + w pour conna&#238;tre la derni&#232;re mise &#224; jour du bulletin m&#233;t&#233;o.
Appuyez sur Contr&#244;le + maj + w pour basculer entre Fahrenheit, Celsius ou Kelvin.</code></pre>
<p>Pour configurer Weather Plus:<br />
Lire le fichier : Weather Plus First Settings.html.</p>
<p>Attention !<br />
Lisez la documentation disponible dans le menu Pr&#233;f&#233;rences Param&#232;tres Weather Plus pour obtenir des instructions sur la fa&#231;on de configurer le module compl&#233;mentaire Weather Plus<br />
Lire le fichier : Weather Plus First Settings.html.<br />
Une fois ouvert l'&#233;l&#233;ment: Documentation<br />
Le dossier fr s'ouvre.<br />
Rechercher la documentation souhaitez en utilisant les fl&#232;ches bas ou haut.<br />
Ici vous trouverez les 3 fichiers suivants:</p>
<ul>
<li>changes.html<br />
Lisez ce fichier pour voir les derni&#232;res modifications apport&#233;es &#224; ce module compl&#233;mentaire.<br />
</li>
<li>readme.html<br />
Lisez ce fichier pour d'autres instructions sur le fonctionnement du module compl&#233;mentaire Weather Plus.<br />
</li>
<li>Weather Plus First Settings.html<br />
Lisez ce fichier pour configurer le module compl&#233;mentaire Weather Plus.</li>
</ul>
<p>Nom de l'auteur :&#160;Adriano Barbieri<br />
Traduit et mis &#224; jour par Adriano Barbieri <script type="text/javascript">
<!--
h='&#x79;&#x61;&#104;&#x6f;&#x6f;&#46;&#x69;&#116;';a='&#64;';n='&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#x41;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#32;&#66;&#x61;&#114;&#98;&#x69;&#x65;&#114;&#x69;&#32;&#40;&#x61;&#100;&#114;&#x69;&#x61;&#110;&#x6f;&#98;&#x61;&#114;&#98;&#32;&#x61;&#116;&#32;&#x79;&#x61;&#104;&#x6f;&#x6f;&#32;&#100;&#x6f;&#116;&#32;&#x69;&#116;&#x29;</noscript><br />
Localis&#233; en : Allemand, Anglais, Arabe, Espagnol, Fran&#231;ais, Galicien, Italien, Polonais, Portugais-Br&#233;sil, Portugais-Portugal, Roumain, Russe, Serbe, Slovaque, Tch&#232;que, Ukrainien.<br />
Publi&#233; sous la GNU GPL (General Public License)<br />
Version: 4.8<br />
Traduit en fran&#231;ais par R&#233;my Ruiz, Michel Such et Corentin Bacqu&#233;-cazenave<br />
Derni&#232;re mise &#224; jour: Ier Janvier 2019<br />
Si vous avez install&#233; une version ant&#233;rieure de Weather Plus, celui-ci peut se mettre &#224; jour seul, cependant, il est possible de t&#233;l&#233;charger manuellement &#224; partir des liens suivants:<br />
<a href="http://www.nvda.it/files/plugin/weather_plus4.8.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire Weather Plus4.8.nvda-addon par ici: [lien externe]</a> <a href="http://www.nvda.it/weather-plus">ou &#224; partir de la page Web en Italien du module compl&#233;mentaire Weather Plus:</a> <a href="https://addons.nvda-project.org/addons/weatherPlus.fr.html">ou &#224; partir de la page de Weather Plus qui se trouve sur le site comunautaire des modules compl&#233;mentaires NVDA</a></p>
<p>Assurez-vous que l'extension du fichier t&#233;l&#233;charg&#233; est correcte, sinon Renommez-le en .nvda-addon. Merci</p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="windows7magnifier">windows7magnifier <a id="windows7magnifier-1.1.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Loupe de Windows 7
Incorporation de la loupe de Windows 7 &#224; l&#39;interface graphique de
NVDA
Langue: Anglais, Fran&#231;ais, Espagnol et N&#233;palais.
Traduit en fran&#231;ais par R&#233;my Ruiz
Description: Ce module compl&#233;mentaire int&#232;gre des options de
configurati&#243;n a l&#39;interface graphique standard de NVDA.
Pour acc&#233;der, allez dans Pr&#233;f&#233;rences, Param&#232;tres de la loupe, dans
le menu de NVDA.
Raccourci clavier:
NVDA- + MAJ + g: activer ou d&#233;sactiver la loupe.
NVDA- + i: changer l&#39;inversion des couleurs.
NVDA- + signe plus: approcher.
NVDA + signe moins: &#233;loigner.
Auteur: Dominic Canare </code></pre>
<p><script type="text/javascript">
<!--
h='&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#46;&#110;&#x65;&#116;';a='&#64;';n='&#100;&#x6f;&#x6d;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#68;&#x6f;&#x6d;&#x69;&#110;&#x69;&#x63;&#32;&#x43;&#x61;&#110;&#x61;&#114;&#x65;&#32;&#40;&#100;&#x6f;&#x6d;&#32;&#x61;&#116;&#32;&#100;&#x6f;&#x6d;&#x73;&#116;&#x79;&#108;&#x65;&#32;&#100;&#x6f;&#116;&#32;&#110;&#x65;&#116;&#x29;</noscript><br />
Version: 1.1.1 <a href="https://blindhelp.github.io/windows7magnifier-1.1.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire windows7magnifier-1.1.1.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="windows-mail">Windows Mail <a id="windowsmail_v2.3.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Le module propos&#233; est utilisable avec Windows 7 &#224; 10, NVDA 2014.4 et suivants.<br />
Ce module agrandit automatiquement les fen&#234;tres de Windows Mail, vocalise les boutons de la boite de Dialogue &quot;Orthographe&quot;, et apporte les commandes suivantes:<br />
Alt +1 &#224; 6: lecture des en-t&#234;tes, double frappe pour placer le focus sur les en-t&#234;tes.<br />
Alt +7 ou NVDA +A: dans la fen&#234;tre principale, annonce la pr&#233;sence de pi&#232;ces jointes si le volet de lecture est affich&#233;, double frappe pour ouvrir le menu contextuel des pi&#232;ces jointes. Dans la fen&#234;tre de lecture, simple frappe pour placer le focus dans la zone des pi&#232;ces jointes.<br />
Ctrl +H: ouvrir une boite de dialogue contenant la liste des dossiers de l'arborescence. Entr&#233;e pour ouvrir le dossier s&#233;lectionner, Alt +D ou Tab puis Espace, pour ouvrir son menu contextuel.<br />
Ctrl +L: aller dans la liste des messages. Si on entend seulement &quot;Liste des messages&quot;, Fl&#232;che bas pour s&#233;lectionner le premier message.<br />
Alt +K: basculer entre les affichages &quot;Afficher tous les messages&quot; et &quot;Masquer les messages lus&quot;.<br />
Ctrl +I: lire le message d'alerte pour le message s&#233;lectionn&#233;, s'il existe.<br />
Alt +O: dans la fen&#234;tre du correcteur orthographique, relire le mot mal orthographi&#233; et le mot propos&#233;, et conna&#238;tre le nombre de suggestions.<br />
Windows +Ctrl +Fl&#232;che bas: lire le contenu du message sans d&#233;placement du focus, y compris dans la fen&#234;tre principale, si le volet de lecture est affich&#233;. Pour une lecture compl&#232;te, vous devrez d&#233;placer le focus dans la zone de contenu du message.<br />
NVDA +F8: ouvrir une boite de dialogue contenant la liste des boutons de la barre d'outils courrier. Entr&#233;e pour activer le bouton s&#233;lectionn&#233;, par exemple &quot;Contacts&quot; pour ouvrir la fen&#234;tre des contacts.<br />
Il n'a pas &#233;t&#233; possible d'obtenir la vocalisation de messages avec pi&#232;ces jointes. En remplacement, vous entendrez un signal sonore.<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A2">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.2<br />
Derni&#232;re mise &#224; jour: 28 Janvier 2016<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/windowsmail_v2.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire windowsmail_v2.2.nvda-addon par ici:</a><br />
Derni&#232;re mise &#224; jour du module compl&#233;mentaire Windows Mail<br />
Derni&#232;res modifications:<br />
- Dans la fen&#234;tre du correcteur orthographique, le mot mal orthographi&#233; et le mot propos&#233; sont lus et &#233;pel&#233;s. Avec la commande Alt +O, ces informations sont rappel&#233;es et le nombre de suggestions est indiqu&#233; (version 2.2).<br />
- Dans le d&#233;placement dans l'arborescence par Fl&#232;ches ou l'initiale des dossiers, le focus est ramen&#233; automatiquement dans l'arborescence si le dossier s&#233;lectionn&#233; contient des messages. En pratique, il arrive que le retour du focus ne se fasse pas. Vous le saurez, car dans ce cas, le message s&#233;lectionn&#233; dans la liste est lu (version 2.1).<br />
- Correction de dysfonctionnements, et signal sonore pour les pi&#232;ces jointes (version 2.0).<br />
- La commande pour la lecture du contenu des messages sans d&#233;placement du focus est d&#233;sormais Windows +Ctrl +Fl&#232;che bas (version 1.2).<br />
- Les messages sont annonc&#233;s non lus sous Xp et Windows 7 (mais pas sous Windows 8). Affichage d'une boite de dialogue rappelant les commandes, par NVDA +Ctrl +H (version 1.1).<br />
Les utilisateurs du correcteur orthographique ne manqueront pas de faire cette mise &#224; jour.<br />
Note: Suite a une correction fait par l'auteur le module compl&#233;mentaire Windows Mail est donc la 2.3 et non la 2.2.<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A2">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.3<br />
Derni&#232;re mise &#224; jour: 31 Janvier 2016<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/windowsmail_v2.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire windowsmail_v2.3.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="winexplore">winExplore <a id="winExplore_v1.2.nvda-addon"></a></h1>
<p>Type: Extensions<br />
Le globalPlugin &quot;winExplore&quot;<br />
Ce module compl&#233;mentaire remplace le module navObjets.<br />
Il facilite la navigation par objets. Il permet &#233;galement de lister les &#233;l&#233;ments contenus dans la fen&#234;tre de l'application active, puis de leur appliquer les actions &quot;Clic gauche&quot;, &quot;Clic droit&quot; ou &quot;Objet navigateur&quot;, pour simuler un clic gauche de souris, un clic droit de souris ou obtenir que le bouton s&#233;lectionn&#233; dans la liste devienne l'objet navigateur.<br />
La navigation par objets se fait soit en mode normal (aller &#224; l'objet parent, enfant, pr&#233;c&#233;dent ou suivant) soit en mode analyse ou scan (aller &#224; l'objet pr&#233;c&#233;dent ou suivant selon leur position &#224; l'&#233;cran).<br />
1. Les commandes disponibles.<br />
Les commandes ont &#233;t&#233; choisies pour permettre de maintenir activ&#233; le pav&#233; num&#233;rique d'un clavier desktop pendant cette navigation. Elles sont de type &quot;s&#233;quentielles&quot; (frappe d'une commande pour lancer ce type, puis utilisation de touches uniques), ou &quot;classiques&quot; ou &quot;group&#233;es&quot; (utilisation simultan&#233;e de plusieurs touches).</p>
<p>Commandes s&#233;quentielles.<br />
Passer des commandes group&#233;es aux commandes s&#233;quentielles: NVDA +Ctrl +$ ou NVDA +Ctrl +* (seulement pour clavier desktop).<br />
Aller &#224; l'objet parent, enfant, pr&#233;c&#233;dent ou suivant en mode normal: Fl&#232;che haut, Fl&#232;che bas, Fl&#232;che gauche ou Fl&#232;che droite.<br />
Atteindre l'objet pr&#233;c&#233;dent ou suivant en mode scan: Page pr&#233;c&#233;dente ou Page suivante.<br />
Atteindre le premier objet de la fen&#234;tre et en faire l'objet navigateur: Origine.<br />
Activer l'objet navigateur: Entr&#233;e. La commande de base NVDA +pavNumEntr&#233;e reste disponible.<br />
Quitter les commandes s&#233;quentielles: NVDA +Ctrl +Ast&#233;risque, ou NVDA +Ctrl +Ast&#233;risque, ou Espace, ou Ast&#233;risque, ou $.</p>
<p>Commandes group&#233;es.<br />
Atteindre l'objet pr&#233;c&#233;dent ou suivant en mode scan: NVDA +Ctrl +Page pr&#233;c&#233;dente ou NVDA +Ctrl +Page suivante.<br />
Atteindre le premier objet de la fen&#234;tre et en faire l'objet navigateur: NVDA +Ctrl +Maj +Origine.<br />
Activer l'objet navigateur: NVDA +Ctrl +Maj +Entr&#233;e. La commande de base NVDA +pavNumEntr&#233;e reste disponible.</p>
<p>Commandes pour la boite de dialogue &quot;Liste des &#233;l&#233;ments de la fen&#234;tre&quot;.<br />
Ouvrir la boite de dialogue : NVDA +$ ou NVDA +* (seulement pour clavier desktop). Choisir ensuite le type d'&#233;l&#233;ment &#224; lister.<br />
Appliquer les actions &quot;Clic gauche&quot;, &quot;Clic droit&quot; ou &quot;Objet navigateur&quot;: tabuler jusqu'aux boutons, ou utiliser les raccourcis Alt +G, Alt +D, Alt +O. Le bouton par d&#233;faut est &quot;Clic gauche&quot;. Il peut donc &#234;tre activ&#233; par Entr&#233;e.</p>
<p>Indications.<br />
L'ouverture de la boite de dialogue &quot;Liste des &#233;l&#233;ments&quot; est normalement rapide, mais elle peut demander plusieurs secondes pour certaines applications.<br />
Attention. Les actions des boutons ne s'exercent que sur les &#233;l&#233;ments affich&#233;s sur l'&#233;cran. Il est donc important de maximiser la fen&#234;tre avant une recherche d'&#233;l&#233;ments.<br />
Si dans la liste des boutons vous entendez deux fois le m&#234;me intitul&#233;, c'est qu'il existe deux boutons de m&#234;me nom, qui sont regroup&#233;s. C'est le cas par exemple dans les rubans de l'Explorateur de fichier, pour le bouton &quot;Supprimer&quot;. Le second bouton permet d'ouvrir une liste d&#233;roulante.<br />
Il est recommand&#233; de cocher la case &quot;Mode de revue simple&quot; dans les param&#232;tres du curseur de revue. Sans cette configuration, l'activation de l'objet navigateur peut ne pas se faire correctement.<br />
Pour Windows Live Mail, si le dossier s&#233;lectionn&#233; contient un grand nombre de messages, le d&#233;lai d'affichage de la boite de dialogue serait tr&#232;s long, et NVDA pourrait m&#234;me se bloquer. La recherche des &#233;l&#233;ments ne prend donc pas en compte la zone des messages. Si la fen&#234;tre vient d'&#234;tre ouverte et qu'aucun &#233;l&#233;ment n'est focalis&#233;, la commande NVDA +* ne fonctionne pas avec un clavier desktop. Utilisez la commande NVDA +$. Par la suite, NVDA +* fonctionnera normalement.<br />
Pour Word, &#233;vitez d'ouvrir la liste des &#233;l&#233;ments si le document comporte plus de 5 &#224; 10 pages: le d&#233;lai d'affichage de la boite de dialogue serait tr&#232;s long.<br />
Puisque ce module est utilisable pour toutes les fen&#234;tres, il ne peut pas prendre en compte les particularit&#233;s de chacune d'elles. Vous pourrez donc trouver des r&#233;sultats parfois surprenants. Ils correspondent &#224; une programmation elle-m&#234;me parfois surprenante.<br />
2. T&#233;l&#233;chargement.<br />
Les liens de t&#233;l&#233;chargement sont : winExplore_v1.2.nvda-addon, pour la version actuelle du 18.01.2017, et winExplore_v1.1.nvda-addon, pour la version pr&#233;c&#233;dente du 22.12.2016.</p>
<p>Attention. Si vous aviez install&#233; le module navObjets, d&#233;sinstallez-le, puis installez winExplore. En effet, ils utilisent les m&#234;mes raccourcis-clavier.<br />
Auteur : Daniel Poiraud<br />
T&#233;l&#233;charger Le globalPlugin &quot;winExplore&quot;.<br />
Version : 1.1<br />
Derni&#232;re mise &#224; jour 22 D&#233;cembre 2016 <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/winExplore_v1.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire winExplore_v1.1.nvda-addon par ici:</a></p>
<p>T&#233;l&#233;charger Le globalPlugin &quot;winExplore&quot;.<br />
Version : 1.2<br />
Derni&#232;re mise &#224; jour: 18 Janvier 2017<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/winExplore_v1.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire winExplore_v1.2.nvda-addon par ici:</a></p>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A3">Consulter la fiche d&#233;di&#233; pour le globalPlugin winExplore sur le site AVH Angoul&#234;me:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="winword-spanish">winword-spanish <a id="winword-spanish1.2.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Se module compl&#233;mentaire c&#39;est pour &#234;tre utiliser avec le programme
Microsoft Word dans une version hispanophone uniquement.
Description:Module compl&#233;mentaire en espagnol pour les commandes de
Word
C&#39;est un module compl&#233;mentaire pour verbaliser les commandes de
Word.
Commande: NVDA+control+h, ouvre la liste des commandes configurer.
Auteur: Angelo Miguel Abrantes, corriger par Manuel Eduardo Cort&#233;z
Vallejo, et modifier et compil&#233; par Tjaguar
Version: 1.2 </code></pre>
<p><a href="https://blindhelp.github.io/winword-spanish1.2.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire pour Microsoft Word uniquement en espagnol [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="windows-live-mail">Windows Live Mail <a id="wlmail_v2.4.nvda-addon"></a></h1>
<pre><code>Type: Extensions</code></pre>
<p>Le module propos&#233; est utilisable avec Windows 7 &#224; 10, Windows Live Mail 2009 &#224; 2012, NVDA 2015.4 et suivants.<br />
Ce module annonce si les messages sont non lus, vocalise les boutons de la boite de Dialogue &quot;Orthographe&quot;, et apporte les commandes suivantes:<br />
Alt +1 &#224; 6: lisent des en-t&#234;tes, double frappe pour placer le focus sur les en-t&#234;tes.<br />
Ctrl +L : dans la fen&#234;tre principale, d&#233;place le focus dans la liste des messages.<br />
Alt +7 : dans la fen&#234;tre principale, annonce la pr&#233;sence de pi&#232;ces jointes si le volet de lecture est affich&#233;, double frappe pour s&#233;lectionner la premi&#232;re pi&#232;ce jointe.<br />
Windows +Ctrl +Fl&#232;che bas: lit le contenu du message sans d&#233;placement du focus, y compris dans la fen&#234;tre principale, si le volet de lecture est affich&#233;. Pour une lecture compl&#232;te, vous devrez d&#233;placer le focus dans la zone de contenu du message.<br />
Dans la fen&#234;tre de r&#233;daction,<br />
- NVDA +K ouvre la boite de dialogue &quot;Envoyer un message &#233;lectronique&quot; et dans cette boite, Alt +K place le curseur dans la zone de recherche.<br />
- Ctrl +Fl&#232;che fin d&#233;marre le processus de s&#233;lection d'une adresse autocompl&#233;t&#233;e dans la liste des adresses. Le nombre des adresses est annonc&#233;, et la premi&#232;re s&#233;lectionn&#233;e. Pour vous d&#233;placer dans la liste des adresses visibles, utilisez Ctrl +Fl&#232;che bas et Ctrl +Fl&#232;che haut. Si l'adresse recherch&#233;e n'est pas visible, utilisez Fl&#232;che bas pour faire afficher les adresses suivantes dans la liste. Ajoutez l'adresse s&#233;lectionn&#233;e dans le champ des destinataires par Ctrl +L. Attention. Ce script est bas&#233; sur la vocalisation des suggestions pour les adresses atteintes par Ctrl +Fl&#232;che bas ou Ctrl +Fl&#232;che haut. Ces suggestions contiennent l'adresse &#233;lectronique, mais pas le nom associ&#233;. Il est donc n&#233;cessaire que la case &quot; Annoncer les suggestions&quot; soit coch&#233;e dans la boite de configuration &quot;Pr&#233;sentation des objets&quot;.<br />
- Alt +8 place le focus dans la zone de r&#233;daction du message.<br />
- Dans la boite de dialogue de correction orthographique, l'activation des boutons est vocalis&#233;e, et Alt +A lit puis &#233;pelle le mot mal orthographi&#233;.<br />
NVDA +Ctrl +H : ouvre une boite de dialogue contenant la liste des principales commandes. Elle se ferme par &#201;chapp, Entr&#233;e ou Espace.<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A1">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Live Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.3<br />
Derni&#232;re mise &#224; jour: 10 Janvier 2016<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/wlmail_v2.3.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire wlmail_v2.3.nvda-addon par ici:</a><br />
Derni&#232;re mise &#224; jour du module compl&#233;mentaire Windows Live Mail<br />
Derni&#232;res modifications:<br />
- Am&#233;lioration de la vocalisation de la fen&#234;tre du correcteur orthographque pour Windows Live Mail 2009 et 2011 (version 2.4).<br />
- Le raccourci pour aller dans la liste des messages est d&#233;sormais Ctrl +L, en remplacement de Ctrl +Fl&#232;che gauche. Am&#233;lioration de la vocalisation des adresses autocompl&#233;t&#233;es pour Windows Live Mail 2009 et 2011 (version 2.3).<br />
- Coche automatique de la case &#224; cocher &quot;Annoncer les suggestions&quot;. Elle est d&#233;coch&#233;e quand on quitte la fen&#234;tre de r&#233;daction, si c'est le choix par d&#233;faut dans les pr&#233;f&#233;rences. Am&#233;lioration de la vocalisation de la boite de dialogue du v&#233;rificateur orthographique (version 2.2).<br />
- Vocalisation de la zone des adresses autocompl&#233;t&#233;es, et commande pour ouvrir la boite de dialogue de s&#233;lection des contacts (version 2.0).<br />
- Vocalisation de la pr&#233;sence de pi&#232;ces jointes, que le volet de lecture des messages soit affich&#233; ou non (version 1.2).<br />
- Modification du raccourci pour la lecture du contenu du message. Il devient: Windows +Ctrl +Fl&#232;che bas (version 1.1).<br />
- Lecture du contenu du message (dans le volet d'affichage si vous &#234;tes dans la fen&#234;tre principale) sans d&#233;placement du focus (version 1.1).</p>
<pre><code>Les utilisateurs du correcteur orthographique ne manqueront pas de
faire cette mise &#224; jour. </code></pre>
<p><a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules2.htm#A1">Consulter la fiche d&#233;di&#233; au Module compl&#233;mentaire pour Windows Live Mail sur le site AVH Angoul&#234;me:</a><br />
Auteur : Daniel Poiraud<br />
Version : 2.4<br />
Derni&#232;re mise &#224; jour: 28 Janvier 2016<br />
<a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/data/wlmail_v2.4.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire wlmail_v2.4.nvda-addon par ici:</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="word">Word <a id="word 3.1.nvda-addon"></a></h1>
<pre><code>Type: Extensions
pour les personnes qui ont install&#233; une version pr&#233;c&#233;dente de NVDA,
vous pouvez utiliser l&#39;ancienne version du module compl&#233;mentaire:
word 2.4.nvda-addon
pour les personnes qui ont install&#233; la version de NVDA 2016.1 , vous
pouvez utiliser la nouvelle version 3.1 du module compl&#233;mentaire,
voir ci-dessous sa description.
Description de l&#39;ancienne version 2.4 du module compl&#233;mentaire
pour&#160;&#160; Microsoft Word.
Ce module compl&#233;mentaire am&#233;liore le confort d&#39;utilisation du
traitement de texte MSWord avec NVDA. Il apporte les fonctions
suivantes :
la commande clavier &quot;NVDA+alt+F5&quot; pour obtenir la liste de divers
objets Word (commentaires, modifications, signets,...),
la commande clavier &quot;NVDA+alt+F6&quot; pour connaitre suivant le cas: le
num&#233;ro de ligne et de page de la position du curseur syst&#232;me, le
d&#233;but et la fin de la s&#233;lection, ou le num&#233;ro de ligne et colonne de
la cellule courante d&#39;un tableau
la commande clavier &quot;NVDA+alt+c&quot;frapp&#233;e deux fois pour ins&#233;rer un
commentaire ,
la commande clavier &quot;NVDA+alt+n&quot; pour lire la note de bas de page ou
la note de fin &#224; la position du curseur,
la commande clavier &quot;NVDA+alt+r&quot; pour lire la modification de texte
&#224; la position du curseur,
ajout dans les scripts de base &quot;Control+Fl&#232;che bas&quot; et
&quot;control+fl&#232;che haut &quot; ( D&#233;placement de paragraphe en paragraphe),
le saut des paragraphes vides (configurable),
les scripts pour se d&#233;placer dans un tableau ou lire ses &#233;l&#233;ments
(ligne, colonne, cellule), - l&#39;annonce des changements de niveau de
titre (commande clavier &quot;maj +alt +fl&#232;che droite&quot; ou &quot;maj + alt+
fl&#232;che gauche&quot;.
la possibilit&#233; de naviguer plus rapidement dans le document, - le
d&#233;placement de phrase en phrase (commandes clavier &quot;alt+ fl&#232;che bas&quot;
et &quot;alt+ Fl&#232;che haut&quot;).
Auteur : Paul de la liste scriptNVDA     
Version : 2.4      
Ancienne mise &#224; jour: 18 Juin 2015       </code></pre>
<p><a href="https://blindhelp.github.io/word%202.4.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire word 2.4.nvda-addon [via BlindHelp.github.io]</a><br />
Nouvelle mise &#224;&#160; jour du module compl&#233;mentaire pour&#160;&#160; Microsoft Word.<br />
Compatibilit&#233;: Cette version du module n'est pas compatible avec les versions ant&#233;rieures &#224; NVDA 2016.1. Elle a &#233;tait test&#233; avec les version 2016.1 de NVDA, Microsoft Word 2003 , 2007 et 2013 , sous Windows XP , Windows 7, Windows 8.1 et Windows 10.<br />
pour les personnes qui ont install&#233; une version pr&#233;c&#233;dente de NVDA, vous pouvez utiliser l'ancienne version du module compl&#233;mentaire:<br />
word 2.4.nvda-addon<br />
Voir ci-dessus sa description.<br />
Description de la nouvelle version 3.1 du module compl&#233;mentaire pour&#160;&#160; Microsoft Word.<br />
Son principal objectif est d'&#234;tre conforme &#224; NVDA 2016.1 et les changements principaux sont:<br />
ajout de l'annonce de la colonne pour la commande clavier &quot;alt + &#233;ffacement &quot;,<br />
suppression des scripts de d&#233;placement rapide propre au module<br />
(doublon avec le mode de navigation de NVDA),<br />
suppression des scripts pour annoncer au second appui le titre des lignes ou colonnes (utilisation maintenant de l'option incluse dans NVDA),,<br />
changement de commande clavier: &quot;nvda+control+f6&quot; en &quot;alt+effacement&quot; et nvda + numpad effacement&quot;,<br />
indication de la position par rapport au bord gauche et sup&#233;rieur (commande &quot;alt + effacement&quot;&quot;, &quot;alt + numpad effacement&quot;),<br />
ajout de la recherche des objets dans la page courante (commande nvda+alt+f5).<br />
Pour rappel:<br />
Ce module compl&#232;te les scripts int&#233;gr&#233;s dans la version de base de NVDA et apporte:<br />
la commande clavier &quot;NVDA+alt+F5&quot; pour obtenir la liste de divers objets Word (commentaires, modifications, signets,...),<br />
la commande clavier &quot;Alt+effacement&quot; pour connaitre suivant le cas:<br />
le num&#233;ro de ligne, colonne et de page de la position du curseur syst&#232;me,&#160; le d&#233;but&#160; et la fin de la s&#233;lection, ou le num&#233;ro de ligne et colonne de la cellule courante d'un tableau(avec indication &#233;ventuelle de la position par rapport&#160; au bord gauche&#160; et sup&#233;rieur),<br />
la&#160; commande clavier &quot;NVDA+majuscule+alt+ c&quot; pour ins&#233;rer un commentaire&#160; &#224; la position du curseur,,<br />
la commande clavier &quot;NVDA+alt+n&quot; pour lire la note de bas de page ou de fin &#224; la position du curseur,<br />
la commande clavier &quot;NVDA+alt+r&quot; pour lire la modification de texte &#224; la position du curseur,<br />
ajout dans les scripts de base&#160; de d&#233;placement de paragraphe en paragraphe (&quot;Control+Fl&#232;che bas ou haut&quot;), la possibilit&#233; configurable&#160; de sauter&#160; les paragraphes vides,<br />
les scripts pour se d&#233;placer dans un tableau ou lire ses &#233;l&#233;ments (ligne, colonne, cellule),<br />
l'annonce des changements de niveau de titre lors de l'utilisation des commandes clavier &quot;majuscule + alt +fl&#232;che&#160; droite ou gauche&quot; de Word,<br />
compl&#232;te le mode &quot;navigation&quot; de NVDA par de nouvelles commandes propre &#224; Microsoft Word,<br />
le d&#233;placement de phrase en phrase (commandes clavier &quot;alt+ fl&#232;che bas ou haut&quot; .<br />
Auteur : Paul de la liste scriptNVDA<br />
Version : 3.1<br />
Derni&#232;re mise &#224; jour: 10 Avril 2016<br />
<a href="https://blindhelp.github.io/word%203.1.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire word 3.1.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<h1 id="word-count">Word-Count <a id="word-count.nvda-addon"></a></h1>
<pre><code>Type: Extensions
Module compl&#233;mentaire word count Comptage de mots
Version: 1.0
Auteur: Oriol G&#243;mez
Langues: Anglais, Fran&#231;ais et Espagnol
Traduit en fran&#231;ais par R&#233;my Ruiz
Description: comptage de mots lorsque vous s&#233;lectionnez du texte et
vous appuyez sur NVDA + maj + W </code></pre>
<p><a href="https://blindhelp.github.io/word-count.nvda-addon">T&#233;l&#233;charger le module compl&#233;mentaire word-count.nvda-addon [via BlindHelp.github.io]</a></p>
<p><a href="#Modules%20compl&#233;mentaires">Retour aux modules compl&#233;mentaires</a></p>
<hr />
<p>Je vous souhaite a vous tous un bon t&#233;l&#233;chargement!<br />
Merci de me faire savoir S'il vous plait s'il y a un lien bris&#233; ou un module compl&#233;mentaire non mis &#224; jour.<br />
Et si vous souhaitez que un module compl&#233;mentaire figure ici! faites-le savoire SVP!!!pour cela envoyez-moi un courriel en cliquant sur l'adresse qui se trouve en bas: <script type="text/javascript">
<!--
h='&#x67;&#x6d;&#x61;&#x69;&#108;&#46;&#x63;&#x6f;&#x6d;';a='&#64;';n='&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;';e=n+a+h;
document.write('<a h'+'ref'+'="ma'+'ilto'+':'+e+'" clas'+'s="em' + 'ail">'+'&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;'+'<\/'+'a'+'>');
// -->
</script><noscript>&#82;&#xe9;&#x6d;&#x79;&#32;&#82;&#x75;&#x69;&#122;&#32;&#40;&#66;&#108;&#x69;&#110;&#100;&#72;&#x65;&#108;&#112;&#x29;&#32;&#40;&#114;&#x65;&#x6d;&#x79;&#114;&#x75;&#x69;&#122;&#32;&#x61;&#116;&#32;&#x67;&#x6d;&#x61;&#x69;&#108;&#32;&#100;&#x6f;&#116;&#32;&#x63;&#x6f;&#x6d;&#x29;</noscript><br />
Merci par avance pour votre contribution!!!<br />
@+<br />
BlindHelp!</p>
<hr />
<h4 id="references_des_liens_externes">4. R&#233;f&#233;rences des liens externes:</h4>
<hr />
<div>
<p>Voici quelques liens externes ou trouver des modules compl&#233;mentaires que peut-&#234;tre ils ne sont pas list&#233; ici:</p>
</div>
<p><a href="https://www.nvda-fr.org/addons.php">Page de t&#233;l&#233;chargement pour les Modules Compl&#233;mentaires dans le site francophone</a><br />
<a href="http://www.cecitek.fr/index.php?module=nvda&amp;action=index">Page de t&#233;l&#233;chargement pour les Modules Compl&#233;mentaires dans le site CECITEK</a><br />
de notre ami Yannick PLASSIARD <a href="https://www.progaccess33.net/cat.php?id=10">Page de t&#233;l&#233;chargement pour les Modules Compl&#233;mentaires sur le site ProgAccess</a><br />
de notre ami Corentin <a href="http://angouleme.avh.asso.fr/fichesinfo/fiches_nvda/nvda/nvda_modules.htm">Visitez la page d&#233;di&#233; aux Modules Compl&#233;mentaires dans le site AVH Angoul&#234;me</a><br />
<a href="http://addons.nvda-project.org/">Page principal du site comunautaire des modules compl&#233;mentaires NVDA pour t&#233;l&#233;charger les AddOns pour NVDA</a><br />
<a href="http://jeff.tdrealms.com/index.php?page=NVDA">Page de Jeff en anglais qui rassemble aussi des modules compl&#233;mentaires &#224; t&#233;l&#233;charger pour NVDA</a></p>
<hr />
<h1 id="sp&#233;cial-merci-&#224;">Sp&#233;cial Merci &#224; :</h1>
<p>A mes amis Patrick Zajda, Michel Such et Bachir Benanou ;<br />
Merci de m'avoir donner leurs conseils bien averti de la fa&#231;on de Comment traduire un module compl&#233;mentaire pour NVDA<br />
et Merci d'avoir rep&#233;r&#233; tous les points faibles dans la traductions de ceux-ci en fran&#231;ais y compris leurs pages Web d&#233;dier qui se trouve sur<br />
le site comunautaire des modules compl&#233;mentaires NVDA... et de les avoir corriger ...<br />
Encore un grand Merci &#224; eux !<br />
Voila un clin d'&#339;il !</p>
<hr />
<p>Je vous remercie pour votre visite dans le coffre des Modules Compl&#233;mentaires de NVDA!!!<br />
Et si vous le souhaitez vous pouvez laisser votre commentaire! <a href="http://blindhelp.blogspot.fr/2013/02/le-coffre-des-modules-complementaires.html">Pour cela cliquez par ici!</a><br />
Et si vous le souhaitez vous pouvez aussi visiter le blog de BlindHelp!<br />
<a href="http://blindhelp.blogspot.fr/">Pour cela cliquez par la!</a><br />
ET...<br />
<a href="https://blindhelp.github.io/">Voici le nouvel espace de BlindHelp via GitHub que est aussi le votre!</a><br />
Sur ce, je vous dit &#224; tr&#232;s bient&#244;t, donc!!!<br />
@+<br />
BlindHelp !!!</p>
<hr />
</div>
<footer>
Derni&#232;re mise &#224; jour le Lundi 21 Janvier 2019
</footer>
</div>
</body>
</html>
